Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden1 (Dense)              (None, 8)                 72        
_________________________________________________________________
hidden2 (Dense)              (None, 4)                 36        
_________________________________________________________________
hidden3 (Dense)              (None, 2)                 10        
_________________________________________________________________
output (Dense)               (None, 1)                 3         
=================================================================
Total params: 121
Trainable params: 121
Non-trainable params: 0
_________________________________________________________________
None
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden1 (Dense)              (None, 4)                 36        
_________________________________________________________________
hidden2 (Dense)              (None, 2)                 10        
_________________________________________________________________
hidden3 (Dense)              (None, 4)                 12        
_________________________________________________________________
output (Dense)               (None, 1)                 5         
=================================================================
Total params: 63
Trainable params: 63
Non-trainable params: 0
_________________________________________________________________
None
