Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden1 (Dense)              (None, 45)                405       
_________________________________________________________________
hidden2 (Dense)              (None, 45)                2070      
_________________________________________________________________
hidden3 (Dense)              (None, 45)                2070      
_________________________________________________________________
output (Dense)               (None, 1)                 46        
=================================================================
Total params: 4,591
Trainable params: 4,591
Non-trainable params: 0
_________________________________________________________________
None
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden1 (Dense)              (None, 32)                288       
_________________________________________________________________
hidden2 (Dense)              (None, 16)                528       
_________________________________________________________________
hidden3 (Dense)              (None, 8)                 136       
_________________________________________________________________
output (Dense)               (None, 1)                 9         
=================================================================
Total params: 961
Trainable params: 961
Non-trainable params: 0
_________________________________________________________________
None
Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden1 (Dense)              (None, 16)                144       
_________________________________________________________________
hidden2 (Dense)              (None, 8)                 136       
_________________________________________________________________
hidden3 (Dense)              (None, 4)                 36        
_________________________________________________________________
output (Dense)               (None, 1)                 5         
=================================================================
Total params: 321
Trainable params: 321
Non-trainable params: 0
_________________________________________________________________
None
Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden1 (Dense)              (None, 32)                288       
_________________________________________________________________
hidden2 (Dense)              (None, 2)                 66        
_________________________________________________________________
hidden3 (Dense)              (None, 32)                96        
_________________________________________________________________
output (Dense)               (None, 1)                 33        
=================================================================
Total params: 483
Trainable params: 483
Non-trainable params: 0
_________________________________________________________________
None
Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden1 (Dense)              (None, 1)                 9         
_________________________________________________________________
hidden2 (Dense)              (None, 64)                128       
_________________________________________________________________
hidden3 (Dense)              (None, 32)                2080      
_________________________________________________________________
output (Dense)               (None, 1)                 33        
=================================================================
Total params: 2,250
Trainable params: 2,250
Non-trainable params: 0
_________________________________________________________________
None
Model: "sequential_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden1 (Dense)              (None, 10)                90        
_________________________________________________________________
hidden2 (Dense)              (None, 100)               1100      
_________________________________________________________________
hidden3 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 1)                 11        
=================================================================
Total params: 2,211
Trainable params: 2,211
Non-trainable params: 0
_________________________________________________________________
None
Model: "sequential_6"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden1 (Dense)              (None, 16)                144       
_________________________________________________________________
hidden2 (Dense)              (None, 8)                 136       
_________________________________________________________________
hidden3 (Dense)              (None, 4)                 36        
_________________________________________________________________
output (Dense)               (None, 1)                 5         
=================================================================
Total params: 321
Trainable params: 321
Non-trainable params: 0
_________________________________________________________________
None
Model: "sequential_7"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden1 (Dense)              (None, 8)                 72        
_________________________________________________________________
hidden2 (Dense)              (None, 16)                144       
_________________________________________________________________
hidden3 (Dense)              (None, 32)                544       
_________________________________________________________________
output (Dense)               (None, 1)                 33        
=================================================================
Total params: 793
Trainable params: 793
Non-trainable params: 0
_________________________________________________________________
None
Model: "sequential_8"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden1 (Dense)              (None, 32)                288       
_________________________________________________________________
hidden2 (Dense)              (None, 16)                528       
_________________________________________________________________
hidden3 (Dense)              (None, 2)                 34        
_________________________________________________________________
output (Dense)               (None, 1)                 3         
=================================================================
Total params: 853
Trainable params: 853
Non-trainable params: 0
_________________________________________________________________
None
