Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden1 (Dense)              (None, 8)                 72        
_________________________________________________________________
hidden2 (Dense)              (None, 4)                 36        
_________________________________________________________________
hidden3 (Dense)              (None, 2)                 10        
_________________________________________________________________
output (Dense)               (None, 1)                 3         
=================================================================
Total params: 121
Trainable params: 121
Non-trainable params: 0
_________________________________________________________________
None
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden1 (Dense)              (None, 32)                288       
_________________________________________________________________
hidden2 (Dense)              (None, 16)                528       
_________________________________________________________________
hidden3 (Dense)              (None, 8)                 136       
_________________________________________________________________
output (Dense)               (None, 1)                 9         
=================================================================
Total params: 961
Trainable params: 961
Non-trainable params: 0
_________________________________________________________________
None
Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden1 (Dense)              (None, 8)                 72        
_________________________________________________________________
hidden2 (Dense)              (None, 4)                 36        
_________________________________________________________________
hidden3 (Dense)              (None, 2)                 10        
_________________________________________________________________
output (Dense)               (None, 1)                 3         
=================================================================
Total params: 121
Trainable params: 121
Non-trainable params: 0
_________________________________________________________________
None
Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden1 (Dense)              (None, 100)               900       
_________________________________________________________________
hidden2 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden3 (Dense)              (None, 50)                5050      
_________________________________________________________________
output (Dense)               (None, 1)                 51        
=================================================================
Total params: 16,101
Trainable params: 16,101
Non-trainable params: 0
_________________________________________________________________
None
Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden1 (Dense)              (None, 8)                 72        
_________________________________________________________________
hidden2 (Dense)              (None, 4)                 36        
_________________________________________________________________
hidden3 (Dense)              (None, 2)                 10        
_________________________________________________________________
output (Dense)               (None, 1)                 3         
=================================================================
Total params: 121
Trainable params: 121
Non-trainable params: 0
_________________________________________________________________
None
