Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden1 (Dense)              (None, 8)                 72        
_________________________________________________________________
hidden2 (Dense)              (None, 8)                 72        
_________________________________________________________________
output (Dense)               (None, 1)                 9         
=================================================================
Total params: 153
Trainable params: 153
Non-trainable params: 0
_________________________________________________________________
None
