Total jobs: 120
{'Ntraining': 2, 'rotation': 7}
Params: JI_Ntraining_2_rotation_7
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_2_rotation_7
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/2377 [..............................] - ETA: 1s - loss: 1.7358e-04 - fvaf: 0.9738 - root_mean_squared_error: 0.0132 928/2377 [==========>...................] - ETA: 0s - loss: 9.1112e-04 - fvaf: 0.9703 - root_mean_squared_error: 0.03021792/2377 [=====================>........] - ETA: 0s - loss: 5.2465e-04 - fvaf: 0.9714 - root_mean_squared_error: 0.02292377/2377 [==============================] - 0s 65us/sample - loss: 4.3527e-04 - fvaf: 0.9734 - root_mean_squared_error: 0.0209
  32/1252 [..............................] - ETA: 1s - loss: 0.0033 - fvaf: -3.7731 - root_mean_squared_error: 0.0573 704/1252 [===============>..............] - ETA: 0s - loss: 0.0036 - fvaf: 0.5294 - root_mean_squared_error: 0.0601 1252/1252 [==============================] - 0s 101us/sample - loss: 0.0071 - fvaf: 0.4751 - root_mean_squared_error: 0.0845
  32/1375 [..............................] - ETA: 0s - loss: 0.0024 - fvaf: -0.7846 - root_mean_squared_error: 0.0489 992/1375 [====================>.........] - ETA: 0s - loss: 0.0057 - fvaf: 0.4657 - root_mean_squared_error: 0.0752 1375/1375 [==============================] - 0s 58us/sample - loss: 0.0057 - fvaf: 0.4958 - root_mean_squared_error: 0.0756
