Total jobs: 120
{'Ntraining': 5, 'rotation': 5}
Params: JI_Ntraining_5_rotation_5
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_5_rotation_5
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/6261 [..............................] - ETA: 1s - loss: 4.9956e-05 - fvaf: 0.8889 - root_mean_squared_error: 0.00711600/6261 [======>.......................] - ETA: 0s - loss: 9.9925e-05 - fvaf: 0.9881 - root_mean_squared_error: 0.01003104/6261 [=============>................] - ETA: 0s - loss: 3.1899e-04 - fvaf: 0.9835 - root_mean_squared_error: 0.01794544/6261 [====================>.........] - ETA: 0s - loss: 2.4881e-04 - fvaf: 0.9855 - root_mean_squared_error: 0.01585920/6261 [===========================>..] - ETA: 0s - loss: 2.1303e-04 - fvaf: 0.9861 - root_mean_squared_error: 0.01466261/6261 [==============================] - 0s 36us/sample - loss: 2.0581e-04 - fvaf: 0.9861 - root_mean_squared_error: 0.0143
  32/1265 [..............................] - ETA: 0s - loss: 0.0028 - fvaf: 0.7543 - root_mean_squared_error: 0.05251265/1265 [==============================] - 0s 34us/sample - loss: 0.0038 - fvaf: 0.5290 - root_mean_squared_error: 0.0619
  32/1498 [..............................] - ETA: 0s - loss: 0.0037 - fvaf: 0.7541 - root_mean_squared_error: 0.06081498/1498 [==============================] - 0s 36us/sample - loss: 0.0064 - fvaf: 0.5555 - root_mean_squared_error: 0.0802
