Total jobs: 120
{'Ntraining': 1, 'rotation': 11}
Params: JI_Ntraining_1_rotation_11
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_1_rotation_11
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/1146 [..............................] - ETA: 0s - loss: 6.6864e-05 - fvaf: 0.6876 - root_mean_squared_error: 0.0082 928/1146 [=======================>......] - ETA: 0s - loss: 7.6181e-05 - fvaf: 0.9782 - root_mean_squared_error: 0.00871146/1146 [==============================] - 0s 61us/sample - loss: 7.5750e-05 - fvaf: 0.9773 - root_mean_squared_error: 0.0087
  32/1257 [..............................] - ETA: 0s - loss: 0.0035 - fvaf: -0.0407 - root_mean_squared_error: 0.0591 928/1257 [=====================>........] - ETA: 0s - loss: 0.0063 - fvaf: 0.1464 - root_mean_squared_error: 0.0796 1257/1257 [==============================] - 0s 66us/sample - loss: 0.0057 - fvaf: 0.1570 - root_mean_squared_error: 0.0758
  32/1265 [..............................] - ETA: 0s - loss: 0.0058 - fvaf: 0.3333 - root_mean_squared_error: 0.0761 896/1265 [====================>.........] - ETA: 0s - loss: 0.0072 - fvaf: 0.2017 - root_mean_squared_error: 0.08461265/1265 [==============================] - 0s 62us/sample - loss: 0.0067 - fvaf: 0.2397 - root_mean_squared_error: 0.0818
