Total jobs: 120
{'Ntraining': 1, 'rotation': 13}
Params: JI_Ntraining_1_rotation_13
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_1_rotation_13
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/1238 [..............................] - ETA: 0s - loss: 5.5178e-05 - fvaf: 0.9546 - root_mean_squared_error: 0.00741152/1238 [==========================>...] - ETA: 0s - loss: 6.1686e-05 - fvaf: 0.9770 - root_mean_squared_error: 0.00791238/1238 [==============================] - 0s 48us/sample - loss: 6.3313e-05 - fvaf: 0.9760 - root_mean_squared_error: 0.0080
  32/1146 [..............................] - ETA: 0s - loss: 0.0019 - fvaf: -4.9389 - root_mean_squared_error: 0.04311056/1146 [==========================>...] - ETA: 0s - loss: 0.0048 - fvaf: 0.2748 - root_mean_squared_error: 0.0692 1146/1146 [==============================] - 0s 54us/sample - loss: 0.0046 - fvaf: 0.2848 - root_mean_squared_error: 0.0682
  32/1225 [..............................] - ETA: 0s - loss: 0.0037 - fvaf: 0.2262 - root_mean_squared_error: 0.06111120/1225 [==========================>...] - ETA: 0s - loss: 0.0041 - fvaf: 0.1588 - root_mean_squared_error: 0.06371225/1225 [==============================] - 0s 49us/sample - loss: 0.0041 - fvaf: 0.1518 - root_mean_squared_error: 0.0641
