Total jobs: 120
{'Ntraining': 18, 'rotation': 10}
Params: JI_Ntraining_18_rotation_10
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_18_rotation_10
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
   32/23772 [..............................] - ETA: 17s - loss: 9.3579e-05 - fvaf: 0.9782 - root_mean_squared_error: 0.0097  928/23772 [>.............................] - ETA: 1s - loss: 1.3760e-04 - fvaf: 0.9750 - root_mean_squared_error: 0.0117  2016/23772 [=>............................] - ETA: 1s - loss: 1.0801e-04 - fvaf: 0.9762 - root_mean_squared_error: 0.0104 3232/23772 [===>..........................] - ETA: 1s - loss: 9.6773e-05 - fvaf: 0.9752 - root_mean_squared_error: 0.0098 4320/23772 [====>.........................] - ETA: 1s - loss: 9.6748e-05 - fvaf: 0.9734 - root_mean_squared_error: 0.0098 5504/23772 [=====>........................] - ETA: 0s - loss: 9.4633e-05 - fvaf: 0.9737 - root_mean_squared_error: 0.0097 6592/23772 [=======>......................] - ETA: 0s - loss: 9.2584e-05 - fvaf: 0.9732 - root_mean_squared_error: 0.0096 7680/23772 [========>.....................] - ETA: 0s - loss: 9.7062e-05 - fvaf: 0.9741 - root_mean_squared_error: 0.0099 8768/23772 [==========>...................] - ETA: 0s - loss: 9.7741e-05 - fvaf: 0.9740 - root_mean_squared_error: 0.0099 9824/23772 [===========>..................] - ETA: 0s - loss: 9.6535e-05 - fvaf: 0.9737 - root_mean_squared_error: 0.009810976/23772 [============>.................] - ETA: 0s - loss: 9.5513e-05 - fvaf: 0.9732 - root_mean_squared_error: 0.009812128/23772 [==============>...............] - ETA: 0s - loss: 9.4848e-05 - fvaf: 0.9728 - root_mean_squared_error: 0.009713344/23772 [===============>..............] - ETA: 0s - loss: 9.5097e-05 - fvaf: 0.9729 - root_mean_squared_error: 0.009814464/23772 [=================>............] - ETA: 0s - loss: 9.4366e-05 - fvaf: 0.9728 - root_mean_squared_error: 0.009715648/23772 [==================>...........] - ETA: 0s - loss: 9.3462e-05 - fvaf: 0.9726 - root_mean_squared_error: 0.009716832/23772 [====================>.........] - ETA: 0s - loss: 9.2742e-05 - fvaf: 0.9729 - root_mean_squared_error: 0.009618016/23772 [=====================>........] - ETA: 0s - loss: 9.2877e-05 - fvaf: 0.9729 - root_mean_squared_error: 0.009619136/23772 [=======================>......] - ETA: 0s - loss: 9.4088e-05 - fvaf: 0.9732 - root_mean_squared_error: 0.009720288/23772 [========================>.....] - ETA: 0s - loss: 9.5490e-05 - fvaf: 0.9738 - root_mean_squared_error: 0.009821472/23772 [==========================>...] - ETA: 0s - loss: 9.8624e-05 - fvaf: 0.9737 - root_mean_squared_error: 0.009922624/23772 [===========================>..] - ETA: 0s - loss: 9.9604e-05 - fvaf: 0.9741 - root_mean_squared_error: 0.010023648/23772 [============================>.] - ETA: 0s - loss: 1.3380e-04 - fvaf: 0.9734 - root_mean_squared_error: 0.011623772/23772 [==============================] - 1s 46us/sample - loss: 1.3359e-04 - fvaf: 0.9734 - root_mean_squared_error: 0.0116
  32/1247 [..............................] - ETA: 0s - loss: 0.0030 - fvaf: 0.8225 - root_mean_squared_error: 0.05451120/1247 [=========================>....] - ETA: 0s - loss: 0.0032 - fvaf: 0.6383 - root_mean_squared_error: 0.05631247/1247 [==============================] - 0s 48us/sample - loss: 0.0030 - fvaf: 0.6323 - root_mean_squared_error: 0.0550
  32/1257 [..............................] - ETA: 0s - loss: 0.0019 - fvaf: 0.4830 - root_mean_squared_error: 0.04381120/1257 [=========================>....] - ETA: 0s - loss: 0.0030 - fvaf: 0.6293 - root_mean_squared_error: 0.05521257/1257 [==============================] - 0s 64us/sample - loss: 0.0030 - fvaf: 0.6405 - root_mean_squared_error: 0.0545
