Total jobs: 120
{'Ntraining': 3, 'rotation': 0}
Params: JI_Ntraining_3_rotation_0
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_3_rotation_0
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/3828 [..............................] - ETA: 0s - loss: 1.5680e-04 - fvaf: 0.9852 - root_mean_squared_error: 0.01251536/3828 [===========>..................] - ETA: 0s - loss: 9.7062e-05 - fvaf: 0.9811 - root_mean_squared_error: 0.00993040/3828 [======================>.......] - ETA: 0s - loss: 9.6896e-05 - fvaf: 0.9820 - root_mean_squared_error: 0.00983828/3828 [==============================] - 0s 35us/sample - loss: 9.9526e-05 - fvaf: 0.9820 - root_mean_squared_error: 0.0100
  32/1389 [..............................] - ETA: 0s - loss: 0.0016 - fvaf: 0.6251 - root_mean_squared_error: 0.03961389/1389 [==============================] - 0s 38us/sample - loss: 0.0021 - fvaf: 0.6353 - root_mean_squared_error: 0.0461
  32/1289 [..............................] - ETA: 0s - loss: 0.0027 - fvaf: 0.6153 - root_mean_squared_error: 0.05181289/1289 [==============================] - 0s 35us/sample - loss: 0.0046 - fvaf: 0.5125 - root_mean_squared_error: 0.0680
