Total jobs: 120
{'Ntraining': 3, 'rotation': 13}
Params: JI_Ntraining_3_rotation_13
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_3_rotation_13
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/4167 [..............................] - ETA: 1s - loss: 1.2747e-04 - fvaf: 0.9270 - root_mean_squared_error: 0.0113 864/4167 [=====>........................] - ETA: 0s - loss: 1.1257e-04 - fvaf: 0.9551 - root_mean_squared_error: 0.01061696/4167 [===========>..................] - ETA: 0s - loss: 1.3502e-04 - fvaf: 0.9554 - root_mean_squared_error: 0.01162464/4167 [================>.............] - ETA: 0s - loss: 1.3464e-04 - fvaf: 0.9535 - root_mean_squared_error: 0.01163200/4167 [======================>.......] - ETA: 0s - loss: 1.6503e-04 - fvaf: 0.9441 - root_mean_squared_error: 0.01283968/4167 [===========================>..] - ETA: 0s - loss: 1.7993e-04 - fvaf: 0.9450 - root_mean_squared_error: 0.01344167/4167 [==============================] - 0s 68us/sample - loss: 1.7799e-04 - fvaf: 0.9453 - root_mean_squared_error: 0.0133
  32/1146 [..............................] - ETA: 0s - loss: 0.0015 - fvaf: -2.5741 - root_mean_squared_error: 0.0382 800/1146 [===================>..........] - ETA: 0s - loss: 0.0034 - fvaf: 0.6023 - root_mean_squared_error: 0.0580 1146/1146 [==============================] - 0s 73us/sample - loss: 0.0030 - fvaf: 0.5989 - root_mean_squared_error: 0.0552
  32/1225 [..............................] - ETA: 0s - loss: 0.0028 - fvaf: 0.4888 - root_mean_squared_error: 0.0525 608/1225 [=============>................] - ETA: 0s - loss: 0.0023 - fvaf: 0.6405 - root_mean_squared_error: 0.04741216/1225 [============================>.] - ETA: 0s - loss: 0.0025 - fvaf: 0.5932 - root_mean_squared_error: 0.05041225/1225 [==============================] - 0s 90us/sample - loss: 0.0025 - fvaf: 0.5950 - root_mean_squared_error: 0.0503
