Total jobs: 120
{'Ntraining': 3, 'rotation': 1}
Params: JI_Ntraining_3_rotation_1
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_3_rotation_1
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/3900 [..............................] - ETA: 0s - loss: 5.6598e-05 - fvaf: 0.9565 - root_mean_squared_error: 0.00751504/3900 [==========>...................] - ETA: 0s - loss: 9.0451e-05 - fvaf: 0.9801 - root_mean_squared_error: 0.00953008/3900 [======================>.......] - ETA: 0s - loss: 9.0337e-05 - fvaf: 0.9809 - root_mean_squared_error: 0.00953900/3900 [==============================] - 0s 34us/sample - loss: 9.5124e-05 - fvaf: 0.9811 - root_mean_squared_error: 0.0098
  32/1289 [..............................] - ETA: 0s - loss: 0.0044 - fvaf: 0.5902 - root_mean_squared_error: 0.06651289/1289 [==============================] - 0s 37us/sample - loss: 0.0050 - fvaf: 0.4897 - root_mean_squared_error: 0.0710
  32/1193 [..............................] - ETA: 0s - loss: 0.0036 - fvaf: 0.6291 - root_mean_squared_error: 0.05971193/1193 [==============================] - 0s 34us/sample - loss: 0.0023 - fvaf: 0.6515 - root_mean_squared_error: 0.0484
