Total jobs: 120
{'Ntraining': 5, 'rotation': 14}
Params: JI_Ntraining_5_rotation_14
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_5_rotation_14
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/7261 [..............................] - ETA: 2s - loss: 1.5901e-04 - fvaf: 0.9797 - root_mean_squared_error: 0.01261536/7261 [=====>........................] - ETA: 0s - loss: 1.1363e-04 - fvaf: 0.9671 - root_mean_squared_error: 0.01073104/7261 [===========>..................] - ETA: 0s - loss: 1.6425e-04 - fvaf: 0.9548 - root_mean_squared_error: 0.01284672/7261 [==================>...........] - ETA: 0s - loss: 1.5841e-04 - fvaf: 0.9574 - root_mean_squared_error: 0.01266304/7261 [=========================>....] - ETA: 0s - loss: 1.4678e-04 - fvaf: 0.9594 - root_mean_squared_error: 0.01217261/7261 [==============================] - 0s 33us/sample - loss: 1.4142e-04 - fvaf: 0.9599 - root_mean_squared_error: 0.0119
  32/1225 [..............................] - ETA: 0s - loss: 0.0013 - fvaf: 0.7866 - root_mean_squared_error: 0.03671225/1225 [==============================] - 0s 34us/sample - loss: 0.0024 - fvaf: 0.6139 - root_mean_squared_error: 0.0493
  32/1238 [..............................] - ETA: 0s - loss: 0.0019 - fvaf: 0.5268 - root_mean_squared_error: 0.04341238/1238 [==============================] - 0s 35us/sample - loss: 0.0020 - fvaf: 0.6380 - root_mean_squared_error: 0.0444
