Total jobs: 120
{'Ntraining': 1, 'rotation': 1}
Params: JI_Ntraining_1_rotation_1
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_1_rotation_1
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/1104 [..............................] - ETA: 0s - loss: 2.3070e-04 - fvaf: 0.7691 - root_mean_squared_error: 0.01521104/1104 [==============================] - 0s 44us/sample - loss: 3.2918e-04 - fvaf: 0.7812 - root_mean_squared_error: 0.0181
  32/1289 [..............................] - ETA: 0s - loss: 0.0092 - fvaf: 0.3253 - root_mean_squared_error: 0.09591289/1289 [==============================] - 0s 31us/sample - loss: 0.0064 - fvaf: -0.0399 - root_mean_squared_error: 0.0799
  32/1193 [..............................] - ETA: 0s - loss: 0.0030 - fvaf: 0.5353 - root_mean_squared_error: 0.05461193/1193 [==============================] - 0s 32us/sample - loss: 0.0041 - fvaf: -0.1064 - root_mean_squared_error: 0.0642
