Total jobs: 120
{'Ntraining': 1, 'rotation': 3}
Params: JI_Ntraining_1_rotation_3
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_1_rotation_3
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/1265 [..............................] - ETA: 0s - loss: 5.5957e-05 - fvaf: 0.9920 - root_mean_squared_error: 0.0075 672/1265 [==============>...............] - ETA: 0s - loss: 5.7888e-05 - fvaf: 0.9831 - root_mean_squared_error: 0.00761265/1265 [==============================] - 0s 82us/sample - loss: 5.3775e-05 - fvaf: 0.9853 - root_mean_squared_error: 0.0073
  32/1104 [..............................] - ETA: 0s - loss: 0.0031 - fvaf: -0.6582 - root_mean_squared_error: 0.0561 736/1104 [===================>..........] - ETA: 0s - loss: 0.0040 - fvaf: 0.0862 - root_mean_squared_error: 0.0635 1104/1104 [==============================] - 0s 85us/sample - loss: 0.0040 - fvaf: 0.0302 - root_mean_squared_error: 0.0633
  32/1531 [..............................] - ETA: 0s - loss: 0.0054 - fvaf: 0.3498 - root_mean_squared_error: 0.0732 672/1531 [============>.................] - ETA: 0s - loss: 0.0045 - fvaf: 0.3041 - root_mean_squared_error: 0.06711408/1531 [==========================>...] - ETA: 0s - loss: 0.0043 - fvaf: 0.2698 - root_mean_squared_error: 0.06561531/1531 [==============================] - 0s 80us/sample - loss: 0.0042 - fvaf: 0.2593 - root_mean_squared_error: 0.0650
