Total jobs: 120
{'Ntraining': 3, 'rotation': 5}
Params: JI_Ntraining_3_rotation_5
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_3_rotation_5
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/3757 [..............................] - ETA: 0s - loss: 8.3869e-05 - fvaf: 0.8826 - root_mean_squared_error: 0.00921440/3757 [==========>...................] - ETA: 0s - loss: 1.2896e-04 - fvaf: 0.9901 - root_mean_squared_error: 0.01142816/3757 [=====================>........] - ETA: 0s - loss: 1.2676e-04 - fvaf: 0.9904 - root_mean_squared_error: 0.01133757/3757 [==============================] - 0s 36us/sample - loss: 3.3320e-04 - fvaf: 0.9838 - root_mean_squared_error: 0.0183
  32/1265 [..............................] - ETA: 0s - loss: 0.0026 - fvaf: 0.7153 - root_mean_squared_error: 0.05061265/1265 [==============================] - 0s 36us/sample - loss: 0.0043 - fvaf: 0.3956 - root_mean_squared_error: 0.0654
  32/1498 [..............................] - ETA: 0s - loss: 0.0040 - fvaf: 0.7137 - root_mean_squared_error: 0.06291498/1498 [==============================] - 0s 34us/sample - loss: 0.0072 - fvaf: 0.4728 - root_mean_squared_error: 0.0847
