Total jobs: 120
{'Ntraining': 2, 'rotation': 14}
Params: JI_Ntraining_2_rotation_14
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_2_rotation_14
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/2929 [..............................] - ETA: 0s - loss: 2.6539e-04 - fvaf: 0.9577 - root_mean_squared_error: 0.0163 896/2929 [========>.....................] - ETA: 0s - loss: 1.3877e-04 - fvaf: 0.9386 - root_mean_squared_error: 0.01181888/2929 [==================>...........] - ETA: 0s - loss: 1.7134e-04 - fvaf: 0.9333 - root_mean_squared_error: 0.01312929/2929 [==============================] - 0s 53us/sample - loss: 1.6071e-04 - fvaf: 0.9514 - root_mean_squared_error: 0.0127
  32/1225 [..............................] - ETA: 0s - loss: 0.0027 - fvaf: 0.4797 - root_mean_squared_error: 0.05201120/1225 [==========================>...] - ETA: 0s - loss: 0.0029 - fvaf: 0.4804 - root_mean_squared_error: 0.05421225/1225 [==============================] - 0s 50us/sample - loss: 0.0029 - fvaf: 0.4785 - root_mean_squared_error: 0.0538
  32/1238 [..............................] - ETA: 0s - loss: 0.0025 - fvaf: 0.4463 - root_mean_squared_error: 0.04961152/1238 [==========================>...] - ETA: 0s - loss: 0.0024 - fvaf: 0.4998 - root_mean_squared_error: 0.04931238/1238 [==============================] - 0s 51us/sample - loss: 0.0025 - fvaf: 0.4870 - root_mean_squared_error: 0.0497
