Total jobs: 120
{'Ntraining': 5, 'rotation': 11}
Params: JI_Ntraining_5_rotation_11
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_5_rotation_11
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/6538 [..............................] - ETA: 2s - loss: 1.0068e-04 - fvaf: 0.8990 - root_mean_squared_error: 0.01001056/6538 [===>..........................] - ETA: 0s - loss: 1.4719e-04 - fvaf: 0.9776 - root_mean_squared_error: 0.01212144/6538 [========>.....................] - ETA: 0s - loss: 1.4326e-04 - fvaf: 0.9767 - root_mean_squared_error: 0.01203104/6538 [=============>................] - ETA: 0s - loss: 1.4504e-04 - fvaf: 0.9752 - root_mean_squared_error: 0.01204160/6538 [==================>...........] - ETA: 0s - loss: 1.5076e-04 - fvaf: 0.9752 - root_mean_squared_error: 0.01235312/6538 [=======================>......] - ETA: 0s - loss: 1.4929e-04 - fvaf: 0.9747 - root_mean_squared_error: 0.01226144/6538 [===========================>..] - ETA: 0s - loss: 1.5704e-04 - fvaf: 0.9769 - root_mean_squared_error: 0.01256538/6538 [==============================] - 0s 52us/sample - loss: 1.5695e-04 - fvaf: 0.9772 - root_mean_squared_error: 0.0125
  32/1257 [..............................] - ETA: 0s - loss: 0.0011 - fvaf: 0.6637 - root_mean_squared_error: 0.0326 480/1257 [==========>...................] - ETA: 0s - loss: 0.0042 - fvaf: 0.5739 - root_mean_squared_error: 0.06471257/1257 [==============================] - 0s 87us/sample - loss: 0.0029 - fvaf: 0.6321 - root_mean_squared_error: 0.0537
  32/1265 [..............................] - ETA: 0s - loss: 0.0035 - fvaf: 0.7379 - root_mean_squared_error: 0.0589 960/1265 [=====================>........] - ETA: 0s - loss: 0.0039 - fvaf: 0.6388 - root_mean_squared_error: 0.06241265/1265 [==============================] - 0s 60us/sample - loss: 0.0039 - fvaf: 0.6451 - root_mean_squared_error: 0.0621
