Total jobs: 120
{'Ntraining': 1, 'rotation': 0}
Params: JI_Ntraining_1_rotation_0
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_1_rotation_0
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/1193 [..............................] - ETA: 0s - loss: 4.5408e-05 - fvaf: 0.9889 - root_mean_squared_error: 0.0067 288/1193 [======>.......................] - ETA: 0s - loss: 4.5024e-05 - fvaf: 0.9791 - root_mean_squared_error: 0.0067 864/1193 [====================>.........] - ETA: 0s - loss: 4.3601e-05 - fvaf: 0.9819 - root_mean_squared_error: 0.00661193/1193 [==============================] - 0s 125us/sample - loss: 4.3677e-05 - fvaf: 0.9801 - root_mean_squared_error: 0.0066
  32/1389 [..............................] - ETA: 1s - loss: 0.0020 - fvaf: -0.0024 - root_mean_squared_error: 0.0445 224/1389 [===>..........................] - ETA: 0s - loss: 0.0040 - fvaf: 0.3653 - root_mean_squared_error: 0.0632  480/1389 [=========>....................] - ETA: 0s - loss: 0.0044 - fvaf: 0.4108 - root_mean_squared_error: 0.06661120/1389 [=======================>......] - ETA: 0s - loss: 0.0045 - fvaf: 0.3835 - root_mean_squared_error: 0.06701389/1389 [==============================] - 0s 142us/sample - loss: 0.0045 - fvaf: 0.3575 - root_mean_squared_error: 0.0667
  32/1289 [..............................] - ETA: 0s - loss: 0.0034 - fvaf: 0.3751 - root_mean_squared_error: 0.0583 704/1289 [===============>..............] - ETA: 0s - loss: 0.0086 - fvaf: 0.0104 - root_mean_squared_error: 0.09301289/1289 [==============================] - 0s 99us/sample - loss: 0.0064 - fvaf: 0.1237 - root_mean_squared_error: 0.0803
