Total jobs: 120
{'Ntraining': 2, 'rotation': 18}
Params: JI_Ntraining_2_rotation_18
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_2_rotation_18
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/2678 [..............................] - ETA: 0s - loss: 1.0297e-04 - fvaf: 0.9659 - root_mean_squared_error: 0.01011216/2678 [============>.................] - ETA: 0s - loss: 9.4643e-05 - fvaf: 0.9816 - root_mean_squared_error: 0.00972432/2678 [==========================>...] - ETA: 0s - loss: 9.9575e-05 - fvaf: 0.9828 - root_mean_squared_error: 0.01002678/2678 [==============================] - 0s 44us/sample - loss: 9.8163e-05 - fvaf: 0.9827 - root_mean_squared_error: 0.0099
  32/1579 [..............................] - ETA: 0s - loss: 0.0044 - fvaf: 0.7468 - root_mean_squared_error: 0.06641344/1579 [========================>.....] - ETA: 0s - loss: 0.0035 - fvaf: 0.5830 - root_mean_squared_error: 0.05891579/1579 [==============================] - 0s 40us/sample - loss: 0.0033 - fvaf: 0.5701 - root_mean_squared_error: 0.0572
  32/1364 [..............................] - ETA: 0s - loss: 0.0041 - fvaf: 0.5120 - root_mean_squared_error: 0.06411280/1364 [===========================>..] - ETA: 0s - loss: 0.0032 - fvaf: 0.5691 - root_mean_squared_error: 0.05671364/1364 [==============================] - 0s 43us/sample - loss: 0.0032 - fvaf: 0.5708 - root_mean_squared_error: 0.0565
