Total jobs: 120
{'Ntraining': 1, 'rotation': 16}
Params: JI_Ntraining_1_rotation_16
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_1_rotation_16
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/1579 [..............................] - ETA: 0s - loss: 9.8793e-05 - fvaf: 0.9934 - root_mean_squared_error: 0.0099 928/1579 [================>.............] - ETA: 0s - loss: 9.2912e-05 - fvaf: 0.9874 - root_mean_squared_error: 0.00961579/1579 [==============================] - 0s 61us/sample - loss: 8.5609e-05 - fvaf: 0.9865 - root_mean_squared_error: 0.0093
  32/1570 [..............................] - ETA: 0s - loss: 0.0099 - fvaf: 0.5775 - root_mean_squared_error: 0.0997 928/1570 [================>.............] - ETA: 0s - loss: 0.0037 - fvaf: 0.4351 - root_mean_squared_error: 0.06121570/1570 [==============================] - 0s 59us/sample - loss: 0.0037 - fvaf: 0.4320 - root_mean_squared_error: 0.0608
  32/1359 [..............................] - ETA: 0s - loss: 0.0018 - fvaf: 0.8034 - root_mean_squared_error: 0.0427 960/1359 [====================>.........] - ETA: 0s - loss: 0.0071 - fvaf: 0.3314 - root_mean_squared_error: 0.08441359/1359 [==============================] - 0s 60us/sample - loss: 0.0060 - fvaf: 0.3718 - root_mean_squared_error: 0.0777
