Total jobs: 120
{'Ntraining': 18, 'rotation': 8}
Params: JI_Ntraining_18_rotation_8
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_18_rotation_8
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
   32/23771 [..............................] - ETA: 14s - loss: 6.2108e-05 - fvaf: 0.9956 - root_mean_squared_error: 0.0079 1632/23771 [=>............................] - ETA: 0s - loss: 7.8691e-05 - fvaf: 0.9856 - root_mean_squared_error: 0.0089  3296/23771 [===>..........................] - ETA: 0s - loss: 7.4996e-05 - fvaf: 0.9858 - root_mean_squared_error: 0.0087 4960/23771 [=====>........................] - ETA: 0s - loss: 7.2029e-05 - fvaf: 0.9856 - root_mean_squared_error: 0.0085 6592/23771 [=======>......................] - ETA: 0s - loss: 7.2293e-05 - fvaf: 0.9840 - root_mean_squared_error: 0.0085 8224/23771 [=========>....................] - ETA: 0s - loss: 6.9680e-05 - fvaf: 0.9837 - root_mean_squared_error: 0.0083 9856/23771 [===========>..................] - ETA: 0s - loss: 7.1645e-05 - fvaf: 0.9838 - root_mean_squared_error: 0.008511520/23771 [=============>................] - ETA: 0s - loss: 7.0515e-05 - fvaf: 0.9840 - root_mean_squared_error: 0.008413152/23771 [===============>..............] - ETA: 0s - loss: 7.0020e-05 - fvaf: 0.9837 - root_mean_squared_error: 0.008414784/23771 [=================>............] - ETA: 0s - loss: 6.9037e-05 - fvaf: 0.9835 - root_mean_squared_error: 0.008316448/23771 [===================>..........] - ETA: 0s - loss: 6.8974e-05 - fvaf: 0.9835 - root_mean_squared_error: 0.008318112/23771 [=====================>........] - ETA: 0s - loss: 6.8153e-05 - fvaf: 0.9831 - root_mean_squared_error: 0.008319776/23771 [=======================>......] - ETA: 0s - loss: 6.7666e-05 - fvaf: 0.9831 - root_mean_squared_error: 0.008221440/23771 [==========================>...] - ETA: 0s - loss: 6.9502e-05 - fvaf: 0.9831 - root_mean_squared_error: 0.008323104/23771 [============================>.] - ETA: 0s - loss: 7.0784e-05 - fvaf: 0.9836 - root_mean_squared_error: 0.008423771/23771 [==============================] - 1s 31us/sample - loss: 7.3014e-05 - fvaf: 0.9837 - root_mean_squared_error: 0.0085
  32/1375 [..............................] - ETA: 0s - loss: 0.0012 - fvaf: 0.2247 - root_mean_squared_error: 0.03471375/1375 [==============================] - 0s 32us/sample - loss: 0.0037 - fvaf: 0.6579 - root_mean_squared_error: 0.0609
  32/1130 [..............................] - ETA: 1s - loss: 0.0017 - fvaf: 0.8119 - root_mean_squared_error: 0.04121130/1130 [==============================] - 0s 60us/sample - loss: 0.0098 - fvaf: 0.5011 - root_mean_squared_error: 0.0991
