Total jobs: 120
{'Ntraining': 2, 'rotation': 1}
Params: JI_Ntraining_2_rotation_1
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_2_rotation_1
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/2635 [..............................] - ETA: 0s - loss: 7.0528e-05 - fvaf: 0.9561 - root_mean_squared_error: 0.00841792/2635 [===================>..........] - ETA: 0s - loss: 1.3496e-04 - fvaf: 0.9481 - root_mean_squared_error: 0.01162635/2635 [==============================] - 0s 33us/sample - loss: 1.3413e-04 - fvaf: 0.9512 - root_mean_squared_error: 0.0116
  32/1289 [..............................] - ETA: 0s - loss: 0.0033 - fvaf: 0.5371 - root_mean_squared_error: 0.05781289/1289 [==============================] - 0s 31us/sample - loss: 0.0051 - fvaf: 0.4322 - root_mean_squared_error: 0.0716
  32/1193 [..............................] - ETA: 0s - loss: 0.0045 - fvaf: 0.6473 - root_mean_squared_error: 0.06721193/1193 [==============================] - 0s 41us/sample - loss: 0.0026 - fvaf: 0.5609 - root_mean_squared_error: 0.0509
