Total jobs: 120
{'Ntraining': 5, 'rotation': 12}
Params: JI_Ntraining_5_rotation_12
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_5_rotation_12
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/6971 [..............................] - ETA: 2s - loss: 1.3482e-04 - fvaf: 0.9674 - root_mean_squared_error: 0.01161568/6971 [=====>........................] - ETA: 0s - loss: 9.2357e-05 - fvaf: 0.9756 - root_mean_squared_error: 0.00963072/6971 [============>.................] - ETA: 0s - loss: 8.9959e-05 - fvaf: 0.9780 - root_mean_squared_error: 0.00954544/6971 [==================>...........] - ETA: 0s - loss: 9.2971e-05 - fvaf: 0.9793 - root_mean_squared_error: 0.00966048/6971 [=========================>....] - ETA: 0s - loss: 9.3889e-05 - fvaf: 0.9811 - root_mean_squared_error: 0.00976971/6971 [==============================] - 0s 35us/sample - loss: 9.1865e-05 - fvaf: 0.9811 - root_mean_squared_error: 0.0096
  32/1265 [..............................] - ETA: 0s - loss: 0.0025 - fvaf: 0.7091 - root_mean_squared_error: 0.05041265/1265 [==============================] - 0s 35us/sample - loss: 0.0039 - fvaf: 0.6341 - root_mean_squared_error: 0.0625
  32/1146 [..............................] - ETA: 0s - loss: 0.0019 - fvaf: -2.2889 - root_mean_squared_error: 0.04301146/1146 [==============================] - 0s 34us/sample - loss: 0.0027 - fvaf: 0.6457 - root_mean_squared_error: 0.0518
