Total jobs: 120
{'Ntraining': 18, 'rotation': 1}
Params: JI_Ntraining_18_rotation_1
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_18_rotation_1
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
   32/23794 [..............................] - ETA: 15s - loss: 7.6521e-05 - fvaf: 0.9567 - root_mean_squared_error: 0.0087 1632/23794 [=>............................] - ETA: 0s - loss: 1.1430e-04 - fvaf: 0.9803 - root_mean_squared_error: 0.0107  3040/23794 [==>...........................] - ETA: 0s - loss: 1.1809e-04 - fvaf: 0.9815 - root_mean_squared_error: 0.0109 4512/23794 [====>.........................] - ETA: 0s - loss: 1.2434e-04 - fvaf: 0.9826 - root_mean_squared_error: 0.0112 5952/23794 [======>.......................] - ETA: 0s - loss: 1.3235e-04 - fvaf: 0.9844 - root_mean_squared_error: 0.0115 7360/23794 [========>.....................] - ETA: 0s - loss: 1.3444e-04 - fvaf: 0.9851 - root_mean_squared_error: 0.0116 8768/23794 [==========>...................] - ETA: 0s - loss: 2.6709e-04 - fvaf: 0.9811 - root_mean_squared_error: 0.016310208/23794 [===========>..................] - ETA: 0s - loss: 2.4905e-04 - fvaf: 0.9824 - root_mean_squared_error: 0.015811360/23794 [=============>................] - ETA: 0s - loss: 2.3714e-04 - fvaf: 0.9825 - root_mean_squared_error: 0.015412384/23794 [==============>...............] - ETA: 0s - loss: 2.2739e-04 - fvaf: 0.9827 - root_mean_squared_error: 0.015113312/23794 [===============>..............] - ETA: 0s - loss: 2.2247e-04 - fvaf: 0.9832 - root_mean_squared_error: 0.014914368/23794 [=================>............] - ETA: 0s - loss: 2.1406e-04 - fvaf: 0.9831 - root_mean_squared_error: 0.014615296/23794 [==================>...........] - ETA: 0s - loss: 2.0871e-04 - fvaf: 0.9829 - root_mean_squared_error: 0.014416288/23794 [===================>..........] - ETA: 0s - loss: 2.0209e-04 - fvaf: 0.9827 - root_mean_squared_error: 0.014217344/23794 [====================>.........] - ETA: 0s - loss: 1.9680e-04 - fvaf: 0.9828 - root_mean_squared_error: 0.014018432/23794 [======================>.......] - ETA: 0s - loss: 1.9227e-04 - fvaf: 0.9826 - root_mean_squared_error: 0.013919456/23794 [=======================>......] - ETA: 0s - loss: 1.8935e-04 - fvaf: 0.9830 - root_mean_squared_error: 0.013820448/23794 [========================>.....] - ETA: 0s - loss: 1.8555e-04 - fvaf: 0.9832 - root_mean_squared_error: 0.013621568/23794 [==========================>...] - ETA: 0s - loss: 1.8211e-04 - fvaf: 0.9831 - root_mean_squared_error: 0.013522592/23794 [===========================>..] - ETA: 0s - loss: 1.7906e-04 - fvaf: 0.9831 - root_mean_squared_error: 0.013423744/23794 [============================>.] - ETA: 0s - loss: 1.7564e-04 - fvaf: 0.9830 - root_mean_squared_error: 0.013323794/23794 [==============================] - 1s 44us/sample - loss: 1.7552e-04 - fvaf: 0.9830 - root_mean_squared_error: 0.0132
  32/1289 [..............................] - ETA: 0s - loss: 0.0028 - fvaf: 0.7297 - root_mean_squared_error: 0.05301056/1289 [=======================>......] - ETA: 0s - loss: 0.0035 - fvaf: 0.5141 - root_mean_squared_error: 0.05931289/1289 [==============================] - 0s 54us/sample - loss: 0.0033 - fvaf: 0.5259 - root_mean_squared_error: 0.0573
  32/1193 [..............................] - ETA: 1s - loss: 0.0037 - fvaf: 0.6261 - root_mean_squared_error: 0.06051152/1193 [===========================>..] - ETA: 0s - loss: 0.0024 - fvaf: 0.6071 - root_mean_squared_error: 0.04871193/1193 [==============================] - 0s 77us/sample - loss: 0.0024 - fvaf: 0.6108 - root_mean_squared_error: 0.0490
