Total jobs: 120
{'Ntraining': 18, 'rotation': 19}
Params: JI_Ntraining_18_rotation_19
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_18_rotation_19
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
   32/23523 [..............................] - ETA: 14s - loss: 1.2960e-04 - fvaf: 0.9702 - root_mean_squared_error: 0.0114 1120/23523 [>.............................] - ETA: 1s - loss: 1.0702e-04 - fvaf: 0.9682 - root_mean_squared_error: 0.0103  2304/23523 [=>............................] - ETA: 1s - loss: 9.8139e-05 - fvaf: 0.9661 - root_mean_squared_error: 0.0099 3424/23523 [===>..........................] - ETA: 1s - loss: 9.9580e-05 - fvaf: 0.9630 - root_mean_squared_error: 0.0100 4640/23523 [====>.........................] - ETA: 0s - loss: 9.9821e-05 - fvaf: 0.9650 - root_mean_squared_error: 0.0100 5952/23523 [======>.......................] - ETA: 0s - loss: 1.0369e-04 - fvaf: 0.9645 - root_mean_squared_error: 0.0102 7232/23523 [========>.....................] - ETA: 0s - loss: 1.0837e-04 - fvaf: 0.9682 - root_mean_squared_error: 0.0104 8512/23523 [=========>....................] - ETA: 0s - loss: 1.0700e-04 - fvaf: 0.9699 - root_mean_squared_error: 0.0103 9664/23523 [===========>..................] - ETA: 0s - loss: 1.1013e-04 - fvaf: 0.9719 - root_mean_squared_error: 0.010510816/23523 [============>.................] - ETA: 0s - loss: 1.1105e-04 - fvaf: 0.9729 - root_mean_squared_error: 0.010511968/23523 [==============>...............] - ETA: 0s - loss: 1.7287e-04 - fvaf: 0.9721 - root_mean_squared_error: 0.013113184/23523 [===============>..............] - ETA: 0s - loss: 1.6937e-04 - fvaf: 0.9717 - root_mean_squared_error: 0.013014528/23523 [=================>............] - ETA: 0s - loss: 1.6345e-04 - fvaf: 0.9719 - root_mean_squared_error: 0.012815808/23523 [===================>..........] - ETA: 0s - loss: 1.6055e-04 - fvaf: 0.9725 - root_mean_squared_error: 0.012717088/23523 [====================>.........] - ETA: 0s - loss: 1.5562e-04 - fvaf: 0.9721 - root_mean_squared_error: 0.012518336/23523 [======================>.......] - ETA: 0s - loss: 1.5176e-04 - fvaf: 0.9715 - root_mean_squared_error: 0.012319552/23523 [=======================>......] - ETA: 0s - loss: 1.4822e-04 - fvaf: 0.9714 - root_mean_squared_error: 0.012220832/23523 [=========================>....] - ETA: 0s - loss: 1.4479e-04 - fvaf: 0.9711 - root_mean_squared_error: 0.012022144/23523 [===========================>..] - ETA: 0s - loss: 1.4322e-04 - fvaf: 0.9715 - root_mean_squared_error: 0.012023392/23523 [============================>.] - ETA: 0s - loss: 1.4061e-04 - fvaf: 0.9714 - root_mean_squared_error: 0.011923523/23523 [==============================] - 1s 42us/sample - loss: 1.4033e-04 - fvaf: 0.9713 - root_mean_squared_error: 0.0118
  32/1364 [..............................] - ETA: 0s - loss: 0.0027 - fvaf: 0.6548 - root_mean_squared_error: 0.05241248/1364 [==========================>...] - ETA: 0s - loss: 0.0023 - fvaf: 0.6831 - root_mean_squared_error: 0.04751364/1364 [==============================] - 0s 45us/sample - loss: 0.0023 - fvaf: 0.6882 - root_mean_squared_error: 0.0475
  32/1389 [..............................] - ETA: 0s - loss: 0.0017 - fvaf: 0.3648 - root_mean_squared_error: 0.0412 768/1389 [===============>..............] - ETA: 0s - loss: 0.0020 - fvaf: 0.6399 - root_mean_squared_error: 0.04441389/1389 [==============================] - 0s 58us/sample - loss: 0.0021 - fvaf: 0.6210 - root_mean_squared_error: 0.0463
