Total jobs: 120
{'Ntraining': 10, 'rotation': 5}
Params: JI_Ntraining_10_rotation_5
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_10_rotation_5
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
   32/12705 [..............................] - ETA: 7s - loss: 5.5245e-05 - fvaf: 0.8666 - root_mean_squared_error: 0.0074  768/12705 [>.............................] - ETA: 1s - loss: 9.3541e-05 - fvaf: 0.9804 - root_mean_squared_error: 0.0097 1600/12705 [==>...........................] - ETA: 0s - loss: 1.0602e-04 - fvaf: 0.9823 - root_mean_squared_error: 0.0103 2368/12705 [====>.........................] - ETA: 0s - loss: 1.1107e-04 - fvaf: 0.9826 - root_mean_squared_error: 0.0105 3104/12705 [======>.......................] - ETA: 0s - loss: 3.2862e-04 - fvaf: 0.9772 - root_mean_squared_error: 0.0181 3936/12705 [========>.....................] - ETA: 0s - loss: 2.8870e-04 - fvaf: 0.9784 - root_mean_squared_error: 0.0170 4704/12705 [==========>...................] - ETA: 0s - loss: 2.5873e-04 - fvaf: 0.9789 - root_mean_squared_error: 0.0161 5408/12705 [===========>..................] - ETA: 0s - loss: 2.4220e-04 - fvaf: 0.9787 - root_mean_squared_error: 0.0156 6176/12705 [=============>................] - ETA: 0s - loss: 2.2283e-04 - fvaf: 0.9783 - root_mean_squared_error: 0.0149 7072/12705 [===============>..............] - ETA: 0s - loss: 2.0775e-04 - fvaf: 0.9789 - root_mean_squared_error: 0.0144 7776/12705 [=================>............] - ETA: 0s - loss: 1.9814e-04 - fvaf: 0.9791 - root_mean_squared_error: 0.0141 8544/12705 [===================>..........] - ETA: 0s - loss: 1.8771e-04 - fvaf: 0.9787 - root_mean_squared_error: 0.0137 9216/12705 [====================>.........] - ETA: 0s - loss: 1.8021e-04 - fvaf: 0.9783 - root_mean_squared_error: 0.0134 9856/12705 [======================>.......] - ETA: 0s - loss: 1.7481e-04 - fvaf: 0.9779 - root_mean_squared_error: 0.013210496/12705 [=======================>......] - ETA: 0s - loss: 1.6879e-04 - fvaf: 0.9775 - root_mean_squared_error: 0.013011264/12705 [=========================>....] - ETA: 0s - loss: 1.6349e-04 - fvaf: 0.9771 - root_mean_squared_error: 0.012812000/12705 [===========================>..] - ETA: 0s - loss: 1.5843e-04 - fvaf: 0.9770 - root_mean_squared_error: 0.012612705/12705 [==============================] - 1s 70us/sample - loss: 1.5435e-04 - fvaf: 0.9768 - root_mean_squared_error: 0.0124
  32/1265 [..............................] - ETA: 0s - loss: 0.0027 - fvaf: 0.7373 - root_mean_squared_error: 0.0515 960/1265 [=====================>........] - ETA: 0s - loss: 0.0039 - fvaf: 0.5267 - root_mean_squared_error: 0.06221265/1265 [==============================] - 0s 58us/sample - loss: 0.0036 - fvaf: 0.5685 - root_mean_squared_error: 0.0598
  32/1498 [..............................] - ETA: 0s - loss: 0.0031 - fvaf: 0.7844 - root_mean_squared_error: 0.0559 768/1498 [==============>...............] - ETA: 0s - loss: 0.0084 - fvaf: 0.4657 - root_mean_squared_error: 0.09161440/1498 [===========================>..] - ETA: 0s - loss: 0.0063 - fvaf: 0.5736 - root_mean_squared_error: 0.07941498/1498 [==============================] - 0s 76us/sample - loss: 0.0062 - fvaf: 0.5744 - root_mean_squared_error: 0.0786
