Total jobs: 120
{'Ntraining': 2, 'rotation': 10}
Params: JI_Ntraining_2_rotation_10
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_2_rotation_10
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/2411 [..............................] - ETA: 0s - loss: 4.6412e-05 - fvaf: 0.9927 - root_mean_squared_error: 0.0068 640/2411 [======>.......................] - ETA: 0s - loss: 4.0688e-05 - fvaf: 0.9917 - root_mean_squared_error: 0.00641472/2411 [=================>............] - ETA: 0s - loss: 4.4979e-05 - fvaf: 0.9927 - root_mean_squared_error: 0.00672336/2411 [============================>.] - ETA: 0s - loss: 4.2001e-05 - fvaf: 0.9917 - root_mean_squared_error: 0.00652411/2411 [==============================] - 0s 69us/sample - loss: 4.1703e-05 - fvaf: 0.9917 - root_mean_squared_error: 0.0065
  32/1247 [..............................] - ETA: 0s - loss: 0.0041 - fvaf: 0.7593 - root_mean_squared_error: 0.0640 704/1247 [===============>..............] - ETA: 0s - loss: 0.0028 - fvaf: 0.5934 - root_mean_squared_error: 0.05281247/1247 [==============================] - 0s 76us/sample - loss: 0.0041 - fvaf: 0.5210 - root_mean_squared_error: 0.0638
  32/1257 [..............................] - ETA: 0s - loss: 0.0016 - fvaf: 0.5905 - root_mean_squared_error: 0.0403 704/1257 [===============>..............] - ETA: 0s - loss: 0.0039 - fvaf: 0.5389 - root_mean_squared_error: 0.06231257/1257 [==============================] - 0s 84us/sample - loss: 0.0033 - fvaf: 0.5521 - root_mean_squared_error: 0.0575
