Total jobs: 120
{'Ntraining': 3, 'rotation': 11}
Params: JI_Ntraining_3_rotation_11
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_3_rotation_11
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/3609 [..............................] - ETA: 1s - loss: 3.1339e-05 - fvaf: 0.9566 - root_mean_squared_error: 0.0056 576/3609 [===>..........................] - ETA: 0s - loss: 6.2890e-05 - fvaf: 0.9909 - root_mean_squared_error: 0.00791184/3609 [========>.....................] - ETA: 0s - loss: 5.7565e-05 - fvaf: 0.9898 - root_mean_squared_error: 0.00761792/3609 [=============>................] - ETA: 0s - loss: 5.6216e-05 - fvaf: 0.9889 - root_mean_squared_error: 0.00752432/3609 [===================>..........] - ETA: 0s - loss: 6.0967e-05 - fvaf: 0.9878 - root_mean_squared_error: 0.00783200/3609 [=========================>....] - ETA: 0s - loss: 5.8884e-05 - fvaf: 0.9877 - root_mean_squared_error: 0.00773609/3609 [==============================] - 0s 82us/sample - loss: 5.8975e-05 - fvaf: 0.9876 - root_mean_squared_error: 0.0077
  32/1257 [..............................] - ETA: 0s - loss: 0.0011 - fvaf: 0.6933 - root_mean_squared_error: 0.0336 544/1257 [===========>..................] - ETA: 0s - loss: 0.0046 - fvaf: 0.5641 - root_mean_squared_error: 0.06821248/1257 [============================>.] - ETA: 0s - loss: 0.0033 - fvaf: 0.6176 - root_mean_squared_error: 0.05721257/1257 [==============================] - 0s 91us/sample - loss: 0.0033 - fvaf: 0.6210 - root_mean_squared_error: 0.0571
  32/1265 [..............................] - ETA: 0s - loss: 0.0027 - fvaf: 0.7390 - root_mean_squared_error: 0.0521 672/1265 [==============>...............] - ETA: 0s - loss: 0.0033 - fvaf: 0.6836 - root_mean_squared_error: 0.05731248/1265 [============================>.] - ETA: 0s - loss: 0.0042 - fvaf: 0.5719 - root_mean_squared_error: 0.06501265/1265 [==============================] - 0s 90us/sample - loss: 0.0042 - fvaf: 0.5758 - root_mean_squared_error: 0.0650
