Total jobs: 120
{'Ntraining': 3, 'rotation': 17}
Params: JI_Ntraining_3_rotation_17
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_3_rotation_17
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/4042 [..............................] - ETA: 0s - loss: 1.2536e-04 - fvaf: 0.9678 - root_mean_squared_error: 0.01121024/4042 [======>.......................] - ETA: 0s - loss: 8.1221e-05 - fvaf: 0.9763 - root_mean_squared_error: 0.00901888/4042 [=============>................] - ETA: 0s - loss: 7.5355e-05 - fvaf: 0.9762 - root_mean_squared_error: 0.00872848/4042 [====================>.........] - ETA: 0s - loss: 7.4587e-05 - fvaf: 0.9759 - root_mean_squared_error: 0.00863904/4042 [===========================>..] - ETA: 0s - loss: 8.2615e-05 - fvaf: 0.9748 - root_mean_squared_error: 0.00914042/4042 [==============================] - 0s 54us/sample - loss: 8.1811e-05 - fvaf: 0.9750 - root_mean_squared_error: 0.0090
  32/1359 [..............................] - ETA: 0s - loss: 0.0015 - fvaf: 0.8461 - root_mean_squared_error: 0.03941024/1359 [=====================>........] - ETA: 0s - loss: 0.0053 - fvaf: 0.5348 - root_mean_squared_error: 0.07311359/1359 [==============================] - 0s 53us/sample - loss: 0.0046 - fvaf: 0.5533 - root_mean_squared_error: 0.0678
  32/1579 [..............................] - ETA: 0s - loss: 0.0035 - fvaf: 0.7861 - root_mean_squared_error: 0.05881024/1579 [==================>...........] - ETA: 0s - loss: 0.0031 - fvaf: 0.6727 - root_mean_squared_error: 0.05531579/1579 [==============================] - 0s 54us/sample - loss: 0.0028 - fvaf: 0.6473 - root_mean_squared_error: 0.0530
