Total jobs: 120
{'Ntraining': 18, 'rotation': 6}
Params: JI_Ntraining_18_rotation_6
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_18_rotation_6
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
   32/23526 [..............................] - ETA: 11s - loss: 8.7079e-05 - fvaf: 0.9044 - root_mean_squared_error: 0.0093 1696/23526 [=>............................] - ETA: 0s - loss: 1.1225e-04 - fvaf: 0.9782 - root_mean_squared_error: 0.0106  3360/23526 [===>..........................] - ETA: 0s - loss: 3.5545e-04 - fvaf: 0.9686 - root_mean_squared_error: 0.0189 5056/23526 [=====>........................] - ETA: 0s - loss: 2.6697e-04 - fvaf: 0.9706 - root_mean_squared_error: 0.0163 6752/23526 [=======>......................] - ETA: 0s - loss: 2.2872e-04 - fvaf: 0.9716 - root_mean_squared_error: 0.0151 8416/23526 [=========>....................] - ETA: 0s - loss: 1.9839e-04 - fvaf: 0.9717 - root_mean_squared_error: 0.014110080/23526 [===========>..................] - ETA: 0s - loss: 1.8025e-04 - fvaf: 0.9713 - root_mean_squared_error: 0.013411712/23526 [=============>................] - ETA: 0s - loss: 1.6674e-04 - fvaf: 0.9714 - root_mean_squared_error: 0.012913344/23526 [================>.............] - ETA: 0s - loss: 1.5991e-04 - fvaf: 0.9721 - root_mean_squared_error: 0.012615008/23526 [==================>...........] - ETA: 0s - loss: 1.5232e-04 - fvaf: 0.9721 - root_mean_squared_error: 0.012316672/23526 [====================>.........] - ETA: 0s - loss: 1.4509e-04 - fvaf: 0.9720 - root_mean_squared_error: 0.012018304/23526 [======================>.......] - ETA: 0s - loss: 1.4152e-04 - fvaf: 0.9719 - root_mean_squared_error: 0.011919936/23526 [========================>.....] - ETA: 0s - loss: 1.3619e-04 - fvaf: 0.9718 - root_mean_squared_error: 0.011721536/23526 [==========================>...] - ETA: 0s - loss: 1.3206e-04 - fvaf: 0.9719 - root_mean_squared_error: 0.011523104/23526 [============================>.] - ETA: 0s - loss: 1.2927e-04 - fvaf: 0.9721 - root_mean_squared_error: 0.011423526/23526 [==============================] - 1s 31us/sample - loss: 1.2836e-04 - fvaf: 0.9721 - root_mean_squared_error: 0.0113
  32/1498 [..............................] - ETA: 0s - loss: 0.0032 - fvaf: 0.7847 - root_mean_squared_error: 0.05641498/1498 [==============================] - 0s 33us/sample - loss: 0.0055 - fvaf: 0.5775 - root_mean_squared_error: 0.0745
  32/1252 [..............................] - ETA: 0s - loss: 0.0012 - fvaf: -0.6556 - root_mean_squared_error: 0.03471184/1252 [===========================>..] - ETA: 0s - loss: 0.0057 - fvaf: 0.5283 - root_mean_squared_error: 0.0755 1252/1252 [==============================] - 0s 46us/sample - loss: 0.0055 - fvaf: 0.5290 - root_mean_squared_error: 0.0740
