Total jobs: 120
{'Ntraining': 10, 'rotation': 16}
Params: JI_Ntraining_10_rotation_16
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_10_rotation_16
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
   32/13464 [..............................] - ETA: 4s - loss: 5.6790e-05 - fvaf: 0.9914 - root_mean_squared_error: 0.0075 1632/13464 [==>...........................] - ETA: 0s - loss: 5.0619e-05 - fvaf: 0.9881 - root_mean_squared_error: 0.0071 3168/13464 [======>.......................] - ETA: 0s - loss: 5.0669e-05 - fvaf: 0.9874 - root_mean_squared_error: 0.0071 4640/13464 [=========>....................] - ETA: 0s - loss: 4.9802e-05 - fvaf: 0.9868 - root_mean_squared_error: 0.0071 6112/13464 [============>.................] - ETA: 0s - loss: 5.2725e-05 - fvaf: 0.9869 - root_mean_squared_error: 0.0073 7616/13464 [===============>..............] - ETA: 0s - loss: 5.2209e-05 - fvaf: 0.9866 - root_mean_squared_error: 0.0072 9152/13464 [===================>..........] - ETA: 0s - loss: 5.2812e-05 - fvaf: 0.9865 - root_mean_squared_error: 0.007310720/13464 [======================>.......] - ETA: 0s - loss: 5.3900e-05 - fvaf: 0.9867 - root_mean_squared_error: 0.007312224/13464 [==========================>...] - ETA: 0s - loss: 5.7298e-05 - fvaf: 0.9877 - root_mean_squared_error: 0.007613464/13464 [==============================] - 0s 34us/sample - loss: 6.0738e-05 - fvaf: 0.9879 - root_mean_squared_error: 0.0078
  32/1570 [..............................] - ETA: 0s - loss: 0.0041 - fvaf: 0.7466 - root_mean_squared_error: 0.06401570/1570 [==============================] - 0s 40us/sample - loss: 0.0020 - fvaf: 0.6651 - root_mean_squared_error: 0.0448
  32/1359 [..............................] - ETA: 0s - loss: 0.0017 - fvaf: 0.7143 - root_mean_squared_error: 0.04061359/1359 [==============================] - 0s 33us/sample - loss: 0.0040 - fvaf: 0.6007 - root_mean_squared_error: 0.0635
