Total jobs: 120
{'Ntraining': 10, 'rotation': 15}
Params: JI_Ntraining_10_rotation_15
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_10_rotation_15
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
   32/13571 [..............................] - ETA: 4s - loss: 7.9391e-05 - fvaf: 0.9883 - root_mean_squared_error: 0.0089 1632/13571 [==>...........................] - ETA: 0s - loss: 1.4297e-04 - fvaf: 0.9716 - root_mean_squared_error: 0.0120 3264/13571 [======>.......................] - ETA: 0s - loss: 1.1503e-04 - fvaf: 0.9775 - root_mean_squared_error: 0.0107 4864/13571 [=========>....................] - ETA: 0s - loss: 1.0536e-04 - fvaf: 0.9790 - root_mean_squared_error: 0.0103 6464/13571 [=============>................] - ETA: 0s - loss: 1.0695e-04 - fvaf: 0.9803 - root_mean_squared_error: 0.0103 8064/13571 [================>.............] - ETA: 0s - loss: 1.0213e-04 - fvaf: 0.9810 - root_mean_squared_error: 0.0101 9696/13571 [====================>.........] - ETA: 0s - loss: 9.8584e-05 - fvaf: 0.9816 - root_mean_squared_error: 0.009911296/13571 [=======================>......] - ETA: 0s - loss: 9.5829e-05 - fvaf: 0.9822 - root_mean_squared_error: 0.009812928/13571 [===========================>..] - ETA: 0s - loss: 9.9439e-05 - fvaf: 0.9831 - root_mean_squared_error: 0.010013571/13571 [==============================] - 0s 32us/sample - loss: 9.8873e-05 - fvaf: 0.9837 - root_mean_squared_error: 0.0099
  32/1238 [..............................] - ETA: 0s - loss: 0.0012 - fvaf: 0.5856 - root_mean_squared_error: 0.03491238/1238 [==============================] - 0s 37us/sample - loss: 0.0019 - fvaf: 0.6244 - root_mean_squared_error: 0.0440
  32/1570 [..............................] - ETA: 0s - loss: 0.0040 - fvaf: 0.7293 - root_mean_squared_error: 0.06351570/1570 [==============================] - 0s 33us/sample - loss: 0.0020 - fvaf: 0.6774 - root_mean_squared_error: 0.0442
