Total jobs: 120
{'Ntraining': 5, 'rotation': 8}
Params: JI_Ntraining_5_rotation_8
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_5_rotation_8
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/6140 [..............................] - ETA: 5s - loss: 6.4691e-05 - fvaf: 0.9914 - root_mean_squared_error: 0.0080 256/6140 [>.............................] - ETA: 1s - loss: 8.1478e-05 - fvaf: 0.9752 - root_mean_squared_error: 0.0090 704/6140 [==>...........................] - ETA: 1s - loss: 7.8822e-05 - fvaf: 0.9727 - root_mean_squared_error: 0.0089 992/6140 [===>..........................] - ETA: 1s - loss: 1.0170e-04 - fvaf: 0.9770 - root_mean_squared_error: 0.01011824/6140 [=======>......................] - ETA: 0s - loss: 9.8284e-05 - fvaf: 0.9756 - root_mean_squared_error: 0.00992624/6140 [===========>..................] - ETA: 0s - loss: 9.2972e-05 - fvaf: 0.9748 - root_mean_squared_error: 0.00963488/6140 [================>.............] - ETA: 0s - loss: 9.6655e-05 - fvaf: 0.9764 - root_mean_squared_error: 0.00984288/6140 [===================>..........] - ETA: 0s - loss: 9.3960e-05 - fvaf: 0.9769 - root_mean_squared_error: 0.00974992/6140 [=======================>......] - ETA: 0s - loss: 9.1244e-05 - fvaf: 0.9758 - root_mean_squared_error: 0.00965888/6140 [===========================>..] - ETA: 0s - loss: 8.8912e-05 - fvaf: 0.9746 - root_mean_squared_error: 0.00946140/6140 [==============================] - 1s 84us/sample - loss: 9.0218e-05 - fvaf: 0.9745 - root_mean_squared_error: 0.0095
  32/1375 [..............................] - ETA: 1s - loss: 0.0014 - fvaf: 0.6475 - root_mean_squared_error: 0.0377 448/1375 [========>.....................] - ETA: 0s - loss: 0.0022 - fvaf: 0.6586 - root_mean_squared_error: 0.0474 768/1375 [===============>..............] - ETA: 0s - loss: 0.0022 - fvaf: 0.7123 - root_mean_squared_error: 0.04701375/1375 [==============================] - 0s 132us/sample - loss: 0.0043 - fvaf: 0.6497 - root_mean_squared_error: 0.0655
  32/1130 [..............................] - ETA: 0s - loss: 0.0018 - fvaf: 0.8177 - root_mean_squared_error: 0.0423 832/1130 [=====================>........] - ETA: 0s - loss: 0.0135 - fvaf: 0.4242 - root_mean_squared_error: 0.11601130/1130 [==============================] - 0s 85us/sample - loss: 0.0108 - fvaf: 0.4608 - root_mean_squared_error: 0.1037
