Total jobs: 120
{'Ntraining': 2, 'rotation': 12}
Params: JI_Ntraining_2_rotation_12
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_2_rotation_12
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/2463 [..............................] - ETA: 0s - loss: 7.9127e-05 - fvaf: 0.9717 - root_mean_squared_error: 0.0089 800/2463 [========>.....................] - ETA: 0s - loss: 8.5407e-05 - fvaf: 0.9755 - root_mean_squared_error: 0.00921536/2463 [=================>............] - ETA: 0s - loss: 1.0808e-04 - fvaf: 0.9707 - root_mean_squared_error: 0.01042336/2463 [===========================>..] - ETA: 0s - loss: 1.0017e-04 - fvaf: 0.9709 - root_mean_squared_error: 0.01002463/2463 [==============================] - 0s 67us/sample - loss: 1.0410e-04 - fvaf: 0.9714 - root_mean_squared_error: 0.0102
  32/1265 [..............................] - ETA: 0s - loss: 0.0037 - fvaf: 0.7243 - root_mean_squared_error: 0.0610 960/1265 [=====================>........] - ETA: 0s - loss: 0.0052 - fvaf: 0.5374 - root_mean_squared_error: 0.07211265/1265 [==============================] - 0s 69us/sample - loss: 0.0051 - fvaf: 0.5531 - root_mean_squared_error: 0.0715
  32/1146 [..............................] - ETA: 0s - loss: 0.0011 - fvaf: -1.3928 - root_mean_squared_error: 0.0334 832/1146 [====================>.........] - ETA: 0s - loss: 0.0037 - fvaf: 0.5890 - root_mean_squared_error: 0.0610 1146/1146 [==============================] - 0s 70us/sample - loss: 0.0034 - fvaf: 0.5776 - root_mean_squared_error: 0.0581
