Total jobs: 120
{'Ntraining': 1, 'rotation': 4}
Params: JI_Ntraining_1_rotation_4
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_1_rotation_4
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/1498 [..............................] - ETA: 0s - loss: 3.2398e-05 - fvaf: 0.9910 - root_mean_squared_error: 0.00571088/1498 [====================>.........] - ETA: 0s - loss: 6.2050e-05 - fvaf: 0.9931 - root_mean_squared_error: 0.00791498/1498 [==============================] - 0s 51us/sample - loss: 5.3612e-05 - fvaf: 0.9931 - root_mean_squared_error: 0.0073
  32/1531 [..............................] - ETA: 0s - loss: 0.0071 - fvaf: 0.4674 - root_mean_squared_error: 0.08401120/1531 [====================>.........] - ETA: 0s - loss: 0.0062 - fvaf: 0.2398 - root_mean_squared_error: 0.07891531/1531 [==============================] - 0s 48us/sample - loss: 0.0061 - fvaf: 0.1771 - root_mean_squared_error: 0.0780
  32/1265 [..............................] - ETA: 0s - loss: 0.0052 - fvaf: 0.3498 - root_mean_squared_error: 0.07201265/1265 [==============================] - 0s 42us/sample - loss: 0.0062 - fvaf: 0.1922 - root_mean_squared_error: 0.0786
