Total jobs: 120
{'Ntraining': 10, 'rotation': 12}
Params: JI_Ntraining_10_rotation_12
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_10_rotation_12
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
   32/13310 [..............................] - ETA: 5s - loss: 1.0805e-04 - fvaf: 0.9819 - root_mean_squared_error: 0.0104 1536/13310 [==>...........................] - ETA: 0s - loss: 9.8544e-05 - fvaf: 0.9848 - root_mean_squared_error: 0.0099 3104/13310 [=====>........................] - ETA: 0s - loss: 9.5430e-05 - fvaf: 0.9854 - root_mean_squared_error: 0.0098 4704/13310 [=========>....................] - ETA: 0s - loss: 1.1036e-04 - fvaf: 0.9838 - root_mean_squared_error: 0.0105 6304/13310 [=============>................] - ETA: 0s - loss: 1.0783e-04 - fvaf: 0.9856 - root_mean_squared_error: 0.0104 7904/13310 [================>.............] - ETA: 0s - loss: 1.0629e-04 - fvaf: 0.9856 - root_mean_squared_error: 0.0103 9472/13310 [====================>.........] - ETA: 0s - loss: 1.0527e-04 - fvaf: 0.9855 - root_mean_squared_error: 0.010311136/13310 [========================>.....] - ETA: 0s - loss: 1.0815e-04 - fvaf: 0.9844 - root_mean_squared_error: 0.010412768/13310 [===========================>..] - ETA: 0s - loss: 1.0621e-04 - fvaf: 0.9845 - root_mean_squared_error: 0.010313310/13310 [==============================] - 0s 33us/sample - loss: 1.0604e-04 - fvaf: 0.9844 - root_mean_squared_error: 0.0103
  32/1265 [..............................] - ETA: 0s - loss: 0.0044 - fvaf: 0.6509 - root_mean_squared_error: 0.06671265/1265 [==============================] - 0s 35us/sample - loss: 0.0041 - fvaf: 0.5963 - root_mean_squared_error: 0.0637
  32/1146 [..............................] - ETA: 0s - loss: 0.0021 - fvaf: -2.8923 - root_mean_squared_error: 0.04561146/1146 [==============================] - 0s 37us/sample - loss: 0.0026 - fvaf: 0.6329 - root_mean_squared_error: 0.0512
