Total jobs: 120
{'Ntraining': 10, 'rotation': 4}
Params: JI_Ntraining_10_rotation_4
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_10_rotation_4
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
   32/12633 [..............................] - ETA: 6s - loss: 7.7096e-05 - fvaf: 0.9890 - root_mean_squared_error: 0.0088  928/12633 [=>............................] - ETA: 0s - loss: 1.4683e-04 - fvaf: 0.9880 - root_mean_squared_error: 0.0121 1824/12633 [===>..........................] - ETA: 0s - loss: 1.2188e-04 - fvaf: 0.9885 - root_mean_squared_error: 0.0110 2592/12633 [=====>........................] - ETA: 0s - loss: 1.2532e-04 - fvaf: 0.9889 - root_mean_squared_error: 0.0112 3520/12633 [=======>......................] - ETA: 0s - loss: 1.1440e-04 - fvaf: 0.9883 - root_mean_squared_error: 0.0107 4448/12633 [=========>....................] - ETA: 0s - loss: 1.1300e-04 - fvaf: 0.9886 - root_mean_squared_error: 0.0106 5376/12633 [===========>..................] - ETA: 0s - loss: 2.5034e-04 - fvaf: 0.9849 - root_mean_squared_error: 0.0158 6336/12633 [==============>...............] - ETA: 0s - loss: 2.2654e-04 - fvaf: 0.9855 - root_mean_squared_error: 0.0151 7040/12633 [===============>..............] - ETA: 0s - loss: 2.1383e-04 - fvaf: 0.9857 - root_mean_squared_error: 0.0146 7968/12633 [=================>............] - ETA: 0s - loss: 1.9811e-04 - fvaf: 0.9858 - root_mean_squared_error: 0.0141 8832/12633 [===================>..........] - ETA: 0s - loss: 1.8873e-04 - fvaf: 0.9863 - root_mean_squared_error: 0.0137 9856/12633 [======================>.......] - ETA: 0s - loss: 1.7787e-04 - fvaf: 0.9865 - root_mean_squared_error: 0.013310944/12633 [========================>.....] - ETA: 0s - loss: 1.6827e-04 - fvaf: 0.9863 - root_mean_squared_error: 0.013011936/12633 [===========================>..] - ETA: 0s - loss: 1.6232e-04 - fvaf: 0.9861 - root_mean_squared_error: 0.012712633/12633 [==============================] - 1s 57us/sample - loss: 1.5836e-04 - fvaf: 0.9859 - root_mean_squared_error: 0.0126
  32/1531 [..............................] - ETA: 0s - loss: 0.0060 - fvaf: 0.4411 - root_mean_squared_error: 0.0773 960/1531 [=================>............] - ETA: 0s - loss: 0.0029 - fvaf: 0.6428 - root_mean_squared_error: 0.05361531/1531 [==============================] - 0s 59us/sample - loss: 0.0026 - fvaf: 0.6170 - root_mean_squared_error: 0.0512
  32/1265 [..............................] - ETA: 0s - loss: 0.0023 - fvaf: 0.7650 - root_mean_squared_error: 0.0483 960/1265 [=====================>........] - ETA: 0s - loss: 0.0037 - fvaf: 0.5122 - root_mean_squared_error: 0.06111265/1265 [==============================] - 0s 61us/sample - loss: 0.0034 - fvaf: 0.5635 - root_mean_squared_error: 0.0587
