Total jobs: 120
{'Ntraining': 1, 'rotation': 18}
Params: JI_Ntraining_1_rotation_18
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_1_rotation_18
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/1389 [..............................] - ETA: 0s - loss: 6.7594e-05 - fvaf: 0.9639 - root_mean_squared_error: 0.0082 864/1389 [=================>............] - ETA: 0s - loss: 6.2893e-05 - fvaf: 0.9762 - root_mean_squared_error: 0.00791389/1389 [==============================] - 0s 65us/sample - loss: 6.3066e-05 - fvaf: 0.9776 - root_mean_squared_error: 0.0079
  32/1579 [..............................] - ETA: 0s - loss: 0.0057 - fvaf: 0.5579 - root_mean_squared_error: 0.0755 896/1579 [================>.............] - ETA: 0s - loss: 0.0056 - fvaf: 0.3359 - root_mean_squared_error: 0.07481579/1579 [==============================] - 0s 63us/sample - loss: 0.0051 - fvaf: 0.2866 - root_mean_squared_error: 0.0712
  32/1364 [..............................] - ETA: 0s - loss: 0.0050 - fvaf: 0.5160 - root_mean_squared_error: 0.0708 960/1364 [====================>.........] - ETA: 0s - loss: 0.0047 - fvaf: 0.2879 - root_mean_squared_error: 0.06871364/1364 [==============================] - 0s 56us/sample - loss: 0.0044 - fvaf: 0.2716 - root_mean_squared_error: 0.0665
