Total jobs: 120
{'Ntraining': 18, 'rotation': 0}
Params: JI_Ntraining_18_rotation_0
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_18_rotation_0
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
   32/23598 [..............................] - ETA: 15s - loss: 1.4421e-04 - fvaf: 0.9854 - root_mean_squared_error: 0.0120 1760/23598 [=>............................] - ETA: 0s - loss: 1.4005e-04 - fvaf: 0.9750 - root_mean_squared_error: 0.0118  3488/23598 [===>..........................] - ETA: 0s - loss: 1.4699e-04 - fvaf: 0.9767 - root_mean_squared_error: 0.0121 5216/23598 [=====>........................] - ETA: 0s - loss: 1.5255e-04 - fvaf: 0.9779 - root_mean_squared_error: 0.0124 6944/23598 [=======>......................] - ETA: 0s - loss: 1.6342e-04 - fvaf: 0.9812 - root_mean_squared_error: 0.0128 8672/23598 [==========>...................] - ETA: 0s - loss: 1.6657e-04 - fvaf: 0.9822 - root_mean_squared_error: 0.012910400/23598 [============>.................] - ETA: 0s - loss: 2.7694e-04 - fvaf: 0.9801 - root_mean_squared_error: 0.016612128/23598 [==============>...............] - ETA: 0s - loss: 2.6080e-04 - fvaf: 0.9804 - root_mean_squared_error: 0.016113856/23598 [================>.............] - ETA: 0s - loss: 2.4881e-04 - fvaf: 0.9808 - root_mean_squared_error: 0.015815584/23598 [==================>...........] - ETA: 0s - loss: 2.3838e-04 - fvaf: 0.9809 - root_mean_squared_error: 0.015417312/23598 [=====================>........] - ETA: 0s - loss: 2.2949e-04 - fvaf: 0.9805 - root_mean_squared_error: 0.015119040/23598 [=======================>......] - ETA: 0s - loss: 2.2275e-04 - fvaf: 0.9803 - root_mean_squared_error: 0.014920736/23598 [=========================>....] - ETA: 0s - loss: 2.1916e-04 - fvaf: 0.9806 - root_mean_squared_error: 0.014822464/23598 [===========================>..] - ETA: 0s - loss: 2.1329e-04 - fvaf: 0.9805 - root_mean_squared_error: 0.014623598/23598 [==============================] - 1s 30us/sample - loss: 2.1045e-04 - fvaf: 0.9805 - root_mean_squared_error: 0.0145
  32/1389 [..............................] - ETA: 0s - loss: 0.0034 - fvaf: 0.0456 - root_mean_squared_error: 0.05811389/1389 [==============================] - 0s 31us/sample - loss: 0.0022 - fvaf: 0.5863 - root_mean_squared_error: 0.0472
  32/1289 [..............................] - ETA: 0s - loss: 0.0024 - fvaf: 0.6139 - root_mean_squared_error: 0.04881120/1289 [=========================>....] - ETA: 0s - loss: 0.0034 - fvaf: 0.5319 - root_mean_squared_error: 0.05871289/1289 [==============================] - 0s 46us/sample - loss: 0.0033 - fvaf: 0.5370 - root_mean_squared_error: 0.0575
