Total jobs: 120
{'Ntraining': 5, 'rotation': 6}
Params: JI_Ntraining_5_rotation_6
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_5_rotation_6
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/6274 [..............................] - ETA: 1s - loss: 7.2213e-05 - fvaf: 0.9565 - root_mean_squared_error: 0.00851760/6274 [=======>......................] - ETA: 0s - loss: 1.3597e-04 - fvaf: 0.9860 - root_mean_squared_error: 0.01173520/6274 [===============>..............] - ETA: 0s - loss: 4.6703e-04 - fvaf: 0.9745 - root_mean_squared_error: 0.02165280/6274 [========================>.....] - ETA: 0s - loss: 3.5809e-04 - fvaf: 0.9760 - root_mean_squared_error: 0.01896274/6274 [==============================] - 0s 30us/sample - loss: 3.2875e-04 - fvaf: 0.9775 - root_mean_squared_error: 0.0181
  32/1498 [..............................] - ETA: 0s - loss: 0.0036 - fvaf: 0.6703 - root_mean_squared_error: 0.06021498/1498 [==============================] - 0s 31us/sample - loss: 0.0060 - fvaf: 0.5847 - root_mean_squared_error: 0.0774
  32/1252 [..............................] - ETA: 0s - loss: 0.0015 - fvaf: -0.8747 - root_mean_squared_error: 0.03861252/1252 [==============================] - 0s 31us/sample - loss: 0.0054 - fvaf: 0.5818 - root_mean_squared_error: 0.0733
