Total jobs: 120
{'Ntraining': 5, 'rotation': 10}
Params: JI_Ntraining_5_rotation_10
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_5_rotation_10
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/6444 [..............................] - ETA: 1s - loss: 7.9779e-05 - fvaf: 0.9894 - root_mean_squared_error: 0.0089 896/6444 [===>..........................] - ETA: 0s - loss: 6.6455e-05 - fvaf: 0.9914 - root_mean_squared_error: 0.00821152/6444 [====>.........................] - ETA: 0s - loss: 6.4135e-05 - fvaf: 0.9915 - root_mean_squared_error: 0.00801344/6444 [=====>........................] - ETA: 0s - loss: 6.2419e-05 - fvaf: 0.9918 - root_mean_squared_error: 0.00791696/6444 [======>.......................] - ETA: 0s - loss: 6.1282e-05 - fvaf: 0.9917 - root_mean_squared_error: 0.00782496/6444 [==========>...................] - ETA: 0s - loss: 5.5497e-05 - fvaf: 0.9912 - root_mean_squared_error: 0.00743328/6444 [==============>...............] - ETA: 0s - loss: 5.1470e-05 - fvaf: 0.9909 - root_mean_squared_error: 0.00724032/6444 [=================>............] - ETA: 0s - loss: 5.1965e-05 - fvaf: 0.9900 - root_mean_squared_error: 0.00724864/6444 [=====================>........] - ETA: 0s - loss: 5.0986e-05 - fvaf: 0.9898 - root_mean_squared_error: 0.00715792/6444 [=========================>....] - ETA: 0s - loss: 5.0236e-05 - fvaf: 0.9898 - root_mean_squared_error: 0.00716444/6444 [==============================] - 1s 78us/sample - loss: 4.9513e-05 - fvaf: 0.9897 - root_mean_squared_error: 0.0070
  32/1247 [..............................] - ETA: 1s - loss: 0.0056 - fvaf: 0.6860 - root_mean_squared_error: 0.0747 864/1247 [===================>..........] - ETA: 0s - loss: 0.0045 - fvaf: 0.6149 - root_mean_squared_error: 0.06701247/1247 [==============================] - 0s 82us/sample - loss: 0.0037 - fvaf: 0.6202 - root_mean_squared_error: 0.0606
  32/1257 [..............................] - ETA: 0s - loss: 0.0013 - fvaf: 0.5916 - root_mean_squared_error: 0.03581056/1257 [========================>.....] - ETA: 0s - loss: 0.0030 - fvaf: 0.6376 - root_mean_squared_error: 0.05461257/1257 [==============================] - 0s 55us/sample - loss: 0.0029 - fvaf: 0.6480 - root_mean_squared_error: 0.0535
