Total jobs: 120
{'Ntraining': 2, 'rotation': 8}
Params: JI_Ntraining_2_rotation_8
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_2_rotation_8
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/2504 [..............................] - ETA: 1s - loss: 1.8627e-04 - fvaf: 0.9817 - root_mean_squared_error: 0.01361152/2504 [============>.................] - ETA: 0s - loss: 1.6755e-04 - fvaf: 0.9689 - root_mean_squared_error: 0.01292144/2504 [========================>.....] - ETA: 0s - loss: 1.7016e-04 - fvaf: 0.9678 - root_mean_squared_error: 0.01302504/2504 [==============================] - 0s 54us/sample - loss: 1.6610e-04 - fvaf: 0.9675 - root_mean_squared_error: 0.0129
  32/1375 [..............................] - ETA: 0s - loss: 0.0020 - fvaf: -0.8943 - root_mean_squared_error: 0.04491120/1375 [=======================>......] - ETA: 0s - loss: 0.0058 - fvaf: 0.5358 - root_mean_squared_error: 0.0760 1375/1375 [==============================] - 0s 51us/sample - loss: 0.0059 - fvaf: 0.5224 - root_mean_squared_error: 0.0765
  32/1130 [..............................] - ETA: 0s - loss: 0.0037 - fvaf: 0.6995 - root_mean_squared_error: 0.06071088/1130 [===========================>..] - ETA: 0s - loss: 0.0125 - fvaf: 0.3778 - root_mean_squared_error: 0.11161130/1130 [==============================] - 0s 68us/sample - loss: 0.0121 - fvaf: 0.3794 - root_mean_squared_error: 0.1102
