Total jobs: 120
{'Ntraining': 10, 'rotation': 1}
Params: JI_Ntraining_10_rotation_1
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_10_rotation_1
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
   32/12924 [..............................] - ETA: 6s - loss: 6.6123e-05 - fvaf: 0.9643 - root_mean_squared_error: 0.0081 1248/12924 [=>............................] - ETA: 0s - loss: 7.0250e-05 - fvaf: 0.9844 - root_mean_squared_error: 0.0084 2400/12924 [====>.........................] - ETA: 0s - loss: 7.4648e-05 - fvaf: 0.9851 - root_mean_squared_error: 0.0086 3712/12924 [=======>......................] - ETA: 0s - loss: 8.1139e-05 - fvaf: 0.9853 - root_mean_squared_error: 0.0090 5024/12924 [==========>...................] - ETA: 0s - loss: 9.6137e-05 - fvaf: 0.9869 - root_mean_squared_error: 0.0098 6304/12924 [=============>................] - ETA: 0s - loss: 1.0160e-04 - fvaf: 0.9875 - root_mean_squared_error: 0.0101 7648/12924 [================>.............] - ETA: 0s - loss: 9.8022e-05 - fvaf: 0.9880 - root_mean_squared_error: 0.0099 9088/12924 [====================>.........] - ETA: 0s - loss: 1.7598e-04 - fvaf: 0.9860 - root_mean_squared_error: 0.013310496/12924 [=======================>......] - ETA: 0s - loss: 1.6292e-04 - fvaf: 0.9865 - root_mean_squared_error: 0.012811968/12924 [==========================>...] - ETA: 0s - loss: 1.5394e-04 - fvaf: 0.9865 - root_mean_squared_error: 0.012412924/12924 [==============================] - 1s 39us/sample - loss: 1.4998e-04 - fvaf: 0.9869 - root_mean_squared_error: 0.0122
  32/1289 [..............................] - ETA: 0s - loss: 0.0018 - fvaf: 0.7995 - root_mean_squared_error: 0.04201289/1289 [==============================] - 0s 36us/sample - loss: 0.0031 - fvaf: 0.5845 - root_mean_squared_error: 0.0560
  32/1193 [..............................] - ETA: 0s - loss: 0.0030 - fvaf: 0.6243 - root_mean_squared_error: 0.05461193/1193 [==============================] - 0s 38us/sample - loss: 0.0022 - fvaf: 0.6469 - root_mean_squared_error: 0.0471
