Total jobs: 120
{'Ntraining': 18, 'rotation': 5}
Params: JI_Ntraining_18_rotation_5
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_18_rotation_5
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
   32/23513 [..............................] - ETA: 11s - loss: 3.2221e-05 - fvaf: 0.8750 - root_mean_squared_error: 0.0057 1568/23513 [=>............................] - ETA: 0s - loss: 7.4052e-05 - fvaf: 0.9896 - root_mean_squared_error: 0.0086  3136/23513 [===>..........................] - ETA: 0s - loss: 3.1974e-04 - fvaf: 0.9812 - root_mean_squared_error: 0.0179 4736/23513 [=====>........................] - ETA: 0s - loss: 2.4195e-04 - fvaf: 0.9842 - root_mean_squared_error: 0.0156 6336/23513 [=======>......................] - ETA: 0s - loss: 1.9754e-04 - fvaf: 0.9845 - root_mean_squared_error: 0.0141 7904/23513 [=========>....................] - ETA: 0s - loss: 1.7346e-04 - fvaf: 0.9854 - root_mean_squared_error: 0.0132 9440/23513 [===========>..................] - ETA: 0s - loss: 1.5407e-04 - fvaf: 0.9851 - root_mean_squared_error: 0.012410976/23513 [=============>................] - ETA: 0s - loss: 1.4071e-04 - fvaf: 0.9847 - root_mean_squared_error: 0.011912544/23513 [===============>..............] - ETA: 0s - loss: 1.3040e-04 - fvaf: 0.9847 - root_mean_squared_error: 0.011414112/23513 [=================>............] - ETA: 0s - loss: 1.2436e-04 - fvaf: 0.9851 - root_mean_squared_error: 0.011215648/23513 [==================>...........] - ETA: 0s - loss: 1.1796e-04 - fvaf: 0.9850 - root_mean_squared_error: 0.010917184/23513 [====================>.........] - ETA: 0s - loss: 1.1270e-04 - fvaf: 0.9848 - root_mean_squared_error: 0.010618720/23513 [======================>.......] - ETA: 0s - loss: 1.0859e-04 - fvaf: 0.9846 - root_mean_squared_error: 0.010420288/23513 [========================>.....] - ETA: 0s - loss: 1.0483e-04 - fvaf: 0.9846 - root_mean_squared_error: 0.010221824/23513 [==========================>...] - ETA: 0s - loss: 1.0124e-04 - fvaf: 0.9844 - root_mean_squared_error: 0.010123360/23513 [============================>.] - ETA: 0s - loss: 9.8552e-05 - fvaf: 0.9843 - root_mean_squared_error: 0.009923513/23513 [==============================] - 1s 33us/sample - loss: 9.8307e-05 - fvaf: 0.9843 - root_mean_squared_error: 0.0099
  32/1265 [..............................] - ETA: 0s - loss: 0.0022 - fvaf: 0.7616 - root_mean_squared_error: 0.04651265/1265 [==============================] - 0s 34us/sample - loss: 0.0034 - fvaf: 0.5691 - root_mean_squared_error: 0.0581
  32/1498 [..............................] - ETA: 0s - loss: 0.0031 - fvaf: 0.8149 - root_mean_squared_error: 0.05551088/1498 [====================>.........] - ETA: 0s - loss: 0.0070 - fvaf: 0.5535 - root_mean_squared_error: 0.08371498/1498 [==============================] - 0s 45us/sample - loss: 0.0058 - fvaf: 0.5865 - root_mean_squared_error: 0.0764
