Total jobs: 120
{'Ntraining': 2, 'rotation': 16}
Params: JI_Ntraining_2_rotation_16
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_2_rotation_16
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/2943 [..............................] - ETA: 0s - loss: 1.8496e-04 - fvaf: 0.9872 - root_mean_squared_error: 0.01361376/2943 [=============>................] - ETA: 0s - loss: 1.1378e-04 - fvaf: 0.9745 - root_mean_squared_error: 0.01072688/2943 [==========================>...] - ETA: 0s - loss: 1.1810e-04 - fvaf: 0.9717 - root_mean_squared_error: 0.01092943/2943 [==============================] - 0s 39us/sample - loss: 1.1730e-04 - fvaf: 0.9714 - root_mean_squared_error: 0.0108
  32/1570 [..............................] - ETA: 0s - loss: 0.0086 - fvaf: 0.5575 - root_mean_squared_error: 0.09261280/1570 [=======================>......] - ETA: 0s - loss: 0.0025 - fvaf: 0.5803 - root_mean_squared_error: 0.05001570/1570 [==============================] - 0s 42us/sample - loss: 0.0025 - fvaf: 0.5846 - root_mean_squared_error: 0.0498
  32/1359 [..............................] - ETA: 0s - loss: 0.0025 - fvaf: 0.7771 - root_mean_squared_error: 0.04981216/1359 [=========================>....] - ETA: 0s - loss: 0.0057 - fvaf: 0.4790 - root_mean_squared_error: 0.07521359/1359 [==============================] - 0s 45us/sample - loss: 0.0053 - fvaf: 0.4819 - root_mean_squared_error: 0.0731
