Total jobs: 120
{'Ntraining': 3, 'rotation': 8}
Params: JI_Ntraining_3_rotation_8
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_3_rotation_8
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/3769 [..............................] - ETA: 0s - loss: 1.3691e-04 - fvaf: 0.9910 - root_mean_squared_error: 0.01171344/3769 [=========>....................] - ETA: 0s - loss: 1.0820e-04 - fvaf: 0.9841 - root_mean_squared_error: 0.01042912/3769 [======================>.......] - ETA: 0s - loss: 1.1060e-04 - fvaf: 0.9824 - root_mean_squared_error: 0.01053769/3769 [==============================] - 0s 38us/sample - loss: 1.1894e-04 - fvaf: 0.9831 - root_mean_squared_error: 0.0109
  32/1375 [..............................] - ETA: 0s - loss: 8.5329e-04 - fvaf: 0.2999 - root_mean_squared_error: 0.02921152/1375 [========================>.....] - ETA: 0s - loss: 0.0044 - fvaf: 0.6269 - root_mean_squared_error: 0.0662    1375/1375 [==============================] - 0s 60us/sample - loss: 0.0046 - fvaf: 0.6159 - root_mean_squared_error: 0.0676
  32/1130 [..............................] - ETA: 0s - loss: 0.0021 - fvaf: 0.7969 - root_mean_squared_error: 0.04591130/1130 [==============================] - 0s 53us/sample - loss: 0.0116 - fvaf: 0.4331 - root_mean_squared_error: 0.1075
