Total jobs: 120
{'Ntraining': 18, 'rotation': 18}
Params: JI_Ntraining_18_rotation_18
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_18_rotation_18
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
   32/23333 [..............................] - ETA: 13s - loss: 1.2117e-04 - fvaf: 0.9682 - root_mean_squared_error: 0.0110 1056/23333 [>.............................] - ETA: 1s - loss: 1.4752e-04 - fvaf: 0.9715 - root_mean_squared_error: 0.0121  2112/23333 [=>............................] - ETA: 1s - loss: 1.7422e-04 - fvaf: 0.9697 - root_mean_squared_error: 0.0132 3232/23333 [===>..........................] - ETA: 1s - loss: 1.6956e-04 - fvaf: 0.9709 - root_mean_squared_error: 0.0130 4256/23333 [====>.........................] - ETA: 0s - loss: 1.6628e-04 - fvaf: 0.9693 - root_mean_squared_error: 0.0129 5344/23333 [=====>........................] - ETA: 0s - loss: 1.6594e-04 - fvaf: 0.9703 - root_mean_squared_error: 0.0129 6400/23333 [=======>......................] - ETA: 0s - loss: 1.6347e-04 - fvaf: 0.9709 - root_mean_squared_error: 0.0128 7552/23333 [========>.....................] - ETA: 0s - loss: 1.6283e-04 - fvaf: 0.9722 - root_mean_squared_error: 0.0128 8544/23333 [=========>....................] - ETA: 0s - loss: 1.6779e-04 - fvaf: 0.9739 - root_mean_squared_error: 0.0130 9696/23333 [===========>..................] - ETA: 0s - loss: 1.6689e-04 - fvaf: 0.9753 - root_mean_squared_error: 0.012910848/23333 [============>.................] - ETA: 0s - loss: 1.7585e-04 - fvaf: 0.9749 - root_mean_squared_error: 0.013312000/23333 [==============>...............] - ETA: 0s - loss: 1.7550e-04 - fvaf: 0.9761 - root_mean_squared_error: 0.013213184/23333 [===============>..............] - ETA: 0s - loss: 2.2870e-04 - fvaf: 0.9755 - root_mean_squared_error: 0.015114336/23333 [=================>............] - ETA: 0s - loss: 2.2521e-04 - fvaf: 0.9752 - root_mean_squared_error: 0.015015456/23333 [==================>...........] - ETA: 0s - loss: 2.2204e-04 - fvaf: 0.9754 - root_mean_squared_error: 0.014916576/23333 [====================>.........] - ETA: 0s - loss: 2.1848e-04 - fvaf: 0.9761 - root_mean_squared_error: 0.014817632/23333 [=====================>........] - ETA: 0s - loss: 2.1437e-04 - fvaf: 0.9762 - root_mean_squared_error: 0.014618624/23333 [======================>.......] - ETA: 0s - loss: 2.1099e-04 - fvaf: 0.9760 - root_mean_squared_error: 0.014519648/23333 [========================>.....] - ETA: 0s - loss: 2.0812e-04 - fvaf: 0.9757 - root_mean_squared_error: 0.014420704/23333 [=========================>....] - ETA: 0s - loss: 2.0580e-04 - fvaf: 0.9756 - root_mean_squared_error: 0.014321664/23333 [==========================>...] - ETA: 0s - loss: 2.0319e-04 - fvaf: 0.9755 - root_mean_squared_error: 0.014322720/23333 [============================>.] - ETA: 0s - loss: 2.0227e-04 - fvaf: 0.9755 - root_mean_squared_error: 0.014223333/23333 [==============================] - 1s 48us/sample - loss: 2.0072e-04 - fvaf: 0.9758 - root_mean_squared_error: 0.0142
  32/1579 [..............................] - ETA: 0s - loss: 0.0037 - fvaf: 0.7899 - root_mean_squared_error: 0.06121120/1579 [====================>.........] - ETA: 0s - loss: 0.0028 - fvaf: 0.6674 - root_mean_squared_error: 0.05261579/1579 [==============================] - 0s 49us/sample - loss: 0.0026 - fvaf: 0.6499 - root_mean_squared_error: 0.0513
  32/1364 [..............................] - ETA: 1s - loss: 0.0019 - fvaf: 0.6896 - root_mean_squared_error: 0.04411088/1364 [======================>.......] - ETA: 0s - loss: 0.0026 - fvaf: 0.6393 - root_mean_squared_error: 0.05071364/1364 [==============================] - 0s 70us/sample - loss: 0.0026 - fvaf: 0.6438 - root_mean_squared_error: 0.0505
