Total jobs: 120
{'Ntraining': 1, 'rotation': 15}
Params: JI_Ntraining_1_rotation_15
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_1_rotation_15
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/1359 [..............................] - ETA: 0s - loss: 2.2712e-04 - fvaf: 0.9781 - root_mean_squared_error: 0.01511184/1359 [=========================>....] - ETA: 0s - loss: 2.3716e-04 - fvaf: 0.9710 - root_mean_squared_error: 0.01541359/1359 [==============================] - 0s 46us/sample - loss: 2.3016e-04 - fvaf: 0.9706 - root_mean_squared_error: 0.0152
  32/1238 [..............................] - ETA: 0s - loss: 0.0040 - fvaf: -1.0219 - root_mean_squared_error: 0.06301056/1238 [========================>.....] - ETA: 0s - loss: 0.0039 - fvaf: 0.0139 - root_mean_squared_error: 0.0621 1238/1238 [==============================] - 0s 52us/sample - loss: 0.0040 - fvaf: 0.0534 - root_mean_squared_error: 0.0636
  32/1570 [..............................] - ETA: 0s - loss: 0.0102 - fvaf: 0.4023 - root_mean_squared_error: 0.10081088/1570 [===================>..........] - ETA: 0s - loss: 0.0043 - fvaf: 0.2227 - root_mean_squared_error: 0.06591570/1570 [==============================] - 0s 48us/sample - loss: 0.0042 - fvaf: 0.2158 - root_mean_squared_error: 0.0647
