Total jobs: 120
{'Ntraining': 5, 'rotation': 15}
Params: JI_Ntraining_5_rotation_15
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_5_rotation_15
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/6980 [..............................] - ETA: 1s - loss: 4.4185e-05 - fvaf: 0.9927 - root_mean_squared_error: 0.00661312/6980 [====>.........................] - ETA: 0s - loss: 1.1231e-04 - fvaf: 0.9721 - root_mean_squared_error: 0.01062304/6980 [========>.....................] - ETA: 0s - loss: 9.0207e-05 - fvaf: 0.9785 - root_mean_squared_error: 0.00953552/6980 [==============>...............] - ETA: 0s - loss: 7.5935e-05 - fvaf: 0.9806 - root_mean_squared_error: 0.00874768/6980 [===================>..........] - ETA: 0s - loss: 6.9298e-05 - fvaf: 0.9818 - root_mean_squared_error: 0.00835920/6980 [========================>.....] - ETA: 0s - loss: 6.4842e-05 - fvaf: 0.9825 - root_mean_squared_error: 0.00816976/6980 [============================>.] - ETA: 0s - loss: 6.6003e-05 - fvaf: 0.9829 - root_mean_squared_error: 0.00816980/6980 [==============================] - 0s 45us/sample - loss: 6.5976e-05 - fvaf: 0.9829 - root_mean_squared_error: 0.0081
  32/1238 [..............................] - ETA: 0s - loss: 0.0021 - fvaf: 0.3440 - root_mean_squared_error: 0.04541238/1238 [==============================] - 0s 36us/sample - loss: 0.0022 - fvaf: 0.5928 - root_mean_squared_error: 0.0467
  32/1570 [..............................] - ETA: 0s - loss: 0.0044 - fvaf: 0.7061 - root_mean_squared_error: 0.06661024/1570 [==================>...........] - ETA: 0s - loss: 0.0022 - fvaf: 0.6619 - root_mean_squared_error: 0.04641570/1570 [==============================] - 0s 47us/sample - loss: 0.0021 - fvaf: 0.6557 - root_mean_squared_error: 0.0459
