Total jobs: 120
{'Ntraining': 2, 'rotation': 13}
Params: JI_Ntraining_2_rotation_13
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_2_rotation_13
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/2808 [..............................] - ETA: 0s - loss: 3.3704e-05 - fvaf: 0.9796 - root_mean_squared_error: 0.0058 832/2808 [=======>......................] - ETA: 0s - loss: 3.5154e-05 - fvaf: 0.9856 - root_mean_squared_error: 0.00591568/2808 [===============>..............] - ETA: 0s - loss: 3.9008e-05 - fvaf: 0.9879 - root_mean_squared_error: 0.00622208/2808 [======================>.......] - ETA: 0s - loss: 3.9632e-05 - fvaf: 0.9873 - root_mean_squared_error: 0.00632808/2808 [==============================] - 0s 70us/sample - loss: 4.0178e-05 - fvaf: 0.9872 - root_mean_squared_error: 0.0063
  32/1146 [..............................] - ETA: 0s - loss: 0.0012 - fvaf: -2.6052 - root_mean_squared_error: 0.0341 832/1146 [====================>.........] - ETA: 0s - loss: 0.0035 - fvaf: 0.6166 - root_mean_squared_error: 0.0595 1146/1146 [==============================] - 0s 70us/sample - loss: 0.0033 - fvaf: 0.6167 - root_mean_squared_error: 0.0572
  32/1225 [..............................] - ETA: 0s - loss: 0.0015 - fvaf: 0.7595 - root_mean_squared_error: 0.0381 864/1225 [====================>.........] - ETA: 0s - loss: 0.0020 - fvaf: 0.6790 - root_mean_squared_error: 0.04501225/1225 [==============================] - 0s 64us/sample - loss: 0.0030 - fvaf: 0.5610 - root_mean_squared_error: 0.0547
