Total jobs: 120
{'Ntraining': 2, 'rotation': 17}
Params: JI_Ntraining_2_rotation_17
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_2_rotation_17
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/2753 [..............................] - ETA: 0s - loss: 2.0902e-04 - fvaf: 0.9780 - root_mean_squared_error: 0.01451120/2753 [===========>..................] - ETA: 0s - loss: 1.4694e-04 - fvaf: 0.9732 - root_mean_squared_error: 0.01212272/2753 [=======================>......] - ETA: 0s - loss: 1.3576e-04 - fvaf: 0.9725 - root_mean_squared_error: 0.01172753/2753 [==============================] - 0s 48us/sample - loss: 1.3594e-04 - fvaf: 0.9727 - root_mean_squared_error: 0.0117
  32/1359 [..............................] - ETA: 0s - loss: 0.0018 - fvaf: 0.8417 - root_mean_squared_error: 0.04281216/1359 [=========================>....] - ETA: 0s - loss: 0.0059 - fvaf: 0.4895 - root_mean_squared_error: 0.07671359/1359 [==============================] - 0s 46us/sample - loss: 0.0055 - fvaf: 0.4999 - root_mean_squared_error: 0.0744
  32/1579 [..............................] - ETA: 0s - loss: 0.0043 - fvaf: 0.7646 - root_mean_squared_error: 0.06521312/1579 [=======================>......] - ETA: 0s - loss: 0.0032 - fvaf: 0.6471 - root_mean_squared_error: 0.05681579/1579 [==============================] - 0s 42us/sample - loss: 0.0031 - fvaf: 0.6284 - root_mean_squared_error: 0.0555
