Total jobs: 120
{'Ntraining': 10, 'rotation': 13}
Params: JI_Ntraining_10_rotation_13
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_10_rotation_13
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
   32/13616 [..............................] - ETA: 5s - loss: 9.5678e-05 - fvaf: 0.9617 - root_mean_squared_error: 0.0098 1568/13616 [==>...........................] - ETA: 0s - loss: 9.1847e-05 - fvaf: 0.9789 - root_mean_squared_error: 0.0096 3168/13616 [=====>........................] - ETA: 0s - loss: 1.3115e-04 - fvaf: 0.9669 - root_mean_squared_error: 0.0115 4704/13616 [=========>....................] - ETA: 0s - loss: 1.1865e-04 - fvaf: 0.9739 - root_mean_squared_error: 0.0109 6208/13616 [============>.................] - ETA: 0s - loss: 1.1423e-04 - fvaf: 0.9757 - root_mean_squared_error: 0.0107 7744/13616 [================>.............] - ETA: 0s - loss: 1.0967e-04 - fvaf: 0.9763 - root_mean_squared_error: 0.0105 9312/13616 [===================>..........] - ETA: 0s - loss: 1.1076e-04 - fvaf: 0.9764 - root_mean_squared_error: 0.010510848/13616 [======================>.......] - ETA: 0s - loss: 1.0686e-04 - fvaf: 0.9767 - root_mean_squared_error: 0.010312352/13616 [==========================>...] - ETA: 0s - loss: 1.0499e-04 - fvaf: 0.9769 - root_mean_squared_error: 0.010213616/13616 [==============================] - 0s 34us/sample - loss: 1.0413e-04 - fvaf: 0.9774 - root_mean_squared_error: 0.0102
  32/1146 [..............................] - ETA: 0s - loss: 0.0012 - fvaf: -2.8523 - root_mean_squared_error: 0.03491146/1146 [==============================] - 0s 34us/sample - loss: 0.0024 - fvaf: 0.6555 - root_mean_squared_error: 0.0486
  32/1225 [..............................] - ETA: 0s - loss: 0.0016 - fvaf: 0.6839 - root_mean_squared_error: 0.03991225/1225 [==============================] - 0s 36us/sample - loss: 0.0025 - fvaf: 0.6165 - root_mean_squared_error: 0.0502
