Total jobs: 120
{'Ntraining': 18, 'rotation': 9}
Params: JI_Ntraining_18_rotation_9
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_18_rotation_9
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
   32/23899 [..............................] - ETA: 14s - loss: 4.6914e-05 - fvaf: 0.9773 - root_mean_squared_error: 0.0068 1280/23899 [>.............................] - ETA: 1s - loss: 8.4696e-05 - fvaf: 0.9773 - root_mean_squared_error: 0.0092  2720/23899 [==>...........................] - ETA: 0s - loss: 8.7228e-05 - fvaf: 0.9799 - root_mean_squared_error: 0.0093 4096/23899 [====>.........................] - ETA: 0s - loss: 8.1016e-05 - fvaf: 0.9782 - root_mean_squared_error: 0.0090 5504/23899 [=====>........................] - ETA: 0s - loss: 7.9401e-05 - fvaf: 0.9756 - root_mean_squared_error: 0.0089 7104/23899 [=======>......................] - ETA: 0s - loss: 7.8574e-05 - fvaf: 0.9746 - root_mean_squared_error: 0.0089 8704/23899 [=========>....................] - ETA: 0s - loss: 8.2782e-05 - fvaf: 0.9748 - root_mean_squared_error: 0.009110336/23899 [===========>..................] - ETA: 0s - loss: 8.3834e-05 - fvaf: 0.9740 - root_mean_squared_error: 0.009211936/23899 [=============>................] - ETA: 0s - loss: 8.2617e-05 - fvaf: 0.9735 - root_mean_squared_error: 0.009113504/23899 [===============>..............] - ETA: 0s - loss: 8.1904e-05 - fvaf: 0.9729 - root_mean_squared_error: 0.009115072/23899 [=================>............] - ETA: 0s - loss: 8.4117e-05 - fvaf: 0.9712 - root_mean_squared_error: 0.009216640/23899 [===================>..........] - ETA: 0s - loss: 8.2921e-05 - fvaf: 0.9709 - root_mean_squared_error: 0.009117920/23899 [=====================>........] - ETA: 0s - loss: 8.2457e-05 - fvaf: 0.9710 - root_mean_squared_error: 0.009119104/23899 [======================>.......] - ETA: 0s - loss: 8.2404e-05 - fvaf: 0.9708 - root_mean_squared_error: 0.009120384/23899 [========================>.....] - ETA: 0s - loss: 8.3618e-05 - fvaf: 0.9714 - root_mean_squared_error: 0.009121696/23899 [==========================>...] - ETA: 0s - loss: 8.5214e-05 - fvaf: 0.9721 - root_mean_squared_error: 0.009223072/23899 [===========================>..] - ETA: 0s - loss: 8.7322e-05 - fvaf: 0.9725 - root_mean_squared_error: 0.009323899/23899 [==============================] - 1s 36us/sample - loss: 8.9798e-05 - fvaf: 0.9720 - root_mean_squared_error: 0.0095
  32/1130 [..............................] - ETA: 0s - loss: 0.0023 - fvaf: 0.7946 - root_mean_squared_error: 0.04791130/1130 [==============================] - 0s 63us/sample - loss: 0.0106 - fvaf: 0.4821 - root_mean_squared_error: 0.1027
  32/1247 [..............................] - ETA: 0s - loss: 0.0038 - fvaf: 0.8380 - root_mean_squared_error: 0.0620 768/1247 [=================>............] - ETA: 0s - loss: 0.0025 - fvaf: 0.6936 - root_mean_squared_error: 0.05001247/1247 [==============================] - 0s 65us/sample - loss: 0.0031 - fvaf: 0.6602 - root_mean_squared_error: 0.0560
