Total jobs: 120
{'Ntraining': 18, 'rotation': 15}
Params: JI_Ntraining_18_rotation_15
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_18_rotation_15
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
   32/23468 [..............................] - ETA: 17s - loss: 1.3726e-04 - fvaf: 0.9900 - root_mean_squared_error: 0.0117  960/23468 [>.............................] - ETA: 1s - loss: 2.0514e-04 - fvaf: 0.9818 - root_mean_squared_error: 0.0143  1888/23468 [=>............................] - ETA: 1s - loss: 1.7669e-04 - fvaf: 0.9810 - root_mean_squared_error: 0.0133 2624/23468 [==>...........................] - ETA: 1s - loss: 1.7129e-04 - fvaf: 0.9802 - root_mean_squared_error: 0.0131 3648/23468 [===>..........................] - ETA: 1s - loss: 1.6539e-04 - fvaf: 0.9784 - root_mean_squared_error: 0.0129 4736/23468 [=====>........................] - ETA: 1s - loss: 1.5971e-04 - fvaf: 0.9773 - root_mean_squared_error: 0.0126 5728/23468 [======>.......................] - ETA: 1s - loss: 1.5723e-04 - fvaf: 0.9763 - root_mean_squared_error: 0.0125 6560/23468 [=======>......................] - ETA: 0s - loss: 1.6068e-04 - fvaf: 0.9758 - root_mean_squared_error: 0.0127 7520/23468 [========>.....................] - ETA: 0s - loss: 1.5793e-04 - fvaf: 0.9759 - root_mean_squared_error: 0.0126 8320/23468 [=========>....................] - ETA: 0s - loss: 1.5536e-04 - fvaf: 0.9753 - root_mean_squared_error: 0.0125 9184/23468 [==========>...................] - ETA: 0s - loss: 1.5347e-04 - fvaf: 0.9750 - root_mean_squared_error: 0.012410048/23468 [===========>..................] - ETA: 0s - loss: 1.5199e-04 - fvaf: 0.9750 - root_mean_squared_error: 0.012310848/23468 [============>.................] - ETA: 0s - loss: 1.5118e-04 - fvaf: 0.9752 - root_mean_squared_error: 0.012311296/23468 [=============>................] - ETA: 0s - loss: 1.5119e-04 - fvaf: 0.9751 - root_mean_squared_error: 0.012312192/23468 [==============>...............] - ETA: 0s - loss: 1.5131e-04 - fvaf: 0.9753 - root_mean_squared_error: 0.012313024/23468 [===============>..............] - ETA: 0s - loss: 1.5550e-04 - fvaf: 0.9765 - root_mean_squared_error: 0.012513792/23468 [================>.............] - ETA: 0s - loss: 1.5493e-04 - fvaf: 0.9769 - root_mean_squared_error: 0.012414624/23468 [=================>............] - ETA: 0s - loss: 1.5940e-04 - fvaf: 0.9777 - root_mean_squared_error: 0.012615264/23468 [==================>...........] - ETA: 0s - loss: 1.5935e-04 - fvaf: 0.9775 - root_mean_squared_error: 0.012616192/23468 [===================>..........] - ETA: 0s - loss: 1.6069e-04 - fvaf: 0.9781 - root_mean_squared_error: 0.012716960/23468 [====================>.........] - ETA: 0s - loss: 2.0378e-04 - fvaf: 0.9764 - root_mean_squared_error: 0.014317952/23468 [=====================>........] - ETA: 0s - loss: 2.0185e-04 - fvaf: 0.9770 - root_mean_squared_error: 0.014218912/23468 [=======================>......] - ETA: 0s - loss: 1.9938e-04 - fvaf: 0.9775 - root_mean_squared_error: 0.014119840/23468 [========================>.....] - ETA: 0s - loss: 1.9712e-04 - fvaf: 0.9776 - root_mean_squared_error: 0.014020736/23468 [=========================>....] - ETA: 0s - loss: 1.9616e-04 - fvaf: 0.9779 - root_mean_squared_error: 0.014021664/23468 [==========================>...] - ETA: 0s - loss: 1.9451e-04 - fvaf: 0.9781 - root_mean_squared_error: 0.013922592/23468 [===========================>..] - ETA: 0s - loss: 1.9160e-04 - fvaf: 0.9780 - root_mean_squared_error: 0.013823468/23468 [==============================] - 1s 60us/sample - loss: 1.8967e-04 - fvaf: 0.9778 - root_mean_squared_error: 0.0138
  32/1238 [..............................] - ETA: 0s - loss: 0.0016 - fvaf: 0.5644 - root_mean_squared_error: 0.0398 896/1238 [====================>.........] - ETA: 0s - loss: 0.0017 - fvaf: 0.5688 - root_mean_squared_error: 0.04061238/1238 [==============================] - 0s 59us/sample - loss: 0.0019 - fvaf: 0.5669 - root_mean_squared_error: 0.0439
  32/1570 [..............................] - ETA: 0s - loss: 0.0046 - fvaf: 0.6311 - root_mean_squared_error: 0.0675 512/1570 [========>.....................] - ETA: 0s - loss: 0.0025 - fvaf: 0.6814 - root_mean_squared_error: 0.04961152/1570 [=====================>........] - ETA: 0s - loss: 0.0020 - fvaf: 0.6555 - root_mean_squared_error: 0.04501570/1570 [==============================] - 0s 86us/sample - loss: 0.0020 - fvaf: 0.6512 - root_mean_squared_error: 0.0442
