Total jobs: 120
{'Ntraining': 1, 'rotation': 19}
Params: JI_Ntraining_1_rotation_19
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_1_rotation_19
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/1289 [..............................] - ETA: 0s - loss: 8.9863e-05 - fvaf: 0.9894 - root_mean_squared_error: 0.00951289/1289 [==============================] - 0s 37us/sample - loss: 9.2929e-05 - fvaf: 0.9888 - root_mean_squared_error: 0.0096
  32/1364 [..............................] - ETA: 1s - loss: 0.0040 - fvaf: 0.5018 - root_mean_squared_error: 0.06331364/1364 [==============================] - 0s 53us/sample - loss: 0.0046 - fvaf: 0.2808 - root_mean_squared_error: 0.0677
  32/1389 [..............................] - ETA: 1s - loss: 0.0025 - fvaf: -0.4441 - root_mean_squared_error: 0.05001389/1389 [==============================] - 0s 65us/sample - loss: 0.0038 - fvaf: 0.2469 - root_mean_squared_error: 0.0614
