Total jobs: 120
{'Ntraining': 3, 'rotation': 16}
Params: JI_Ntraining_3_rotation_16
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_3_rotation_16
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/4332 [..............................] - ETA: 0s - loss: 2.6064e-04 - fvaf: 0.9572 - root_mean_squared_error: 0.01611184/4332 [=======>......................] - ETA: 0s - loss: 2.7617e-04 - fvaf: 0.9108 - root_mean_squared_error: 0.01662496/4332 [================>.............] - ETA: 0s - loss: 2.7535e-04 - fvaf: 0.8965 - root_mean_squared_error: 0.01663776/4332 [=========================>....] - ETA: 0s - loss: 2.6139e-04 - fvaf: 0.8949 - root_mean_squared_error: 0.01624332/4332 [==============================] - 0s 41us/sample - loss: 2.6157e-04 - fvaf: 0.8942 - root_mean_squared_error: 0.0162
  32/1570 [..............................] - ETA: 0s - loss: 0.0060 - fvaf: 0.6533 - root_mean_squared_error: 0.07721312/1570 [========================>.....] - ETA: 0s - loss: 0.0025 - fvaf: 0.6119 - root_mean_squared_error: 0.04961570/1570 [==============================] - 0s 43us/sample - loss: 0.0025 - fvaf: 0.5923 - root_mean_squared_error: 0.0499
  32/1359 [..............................] - ETA: 0s - loss: 0.0019 - fvaf: 0.7871 - root_mean_squared_error: 0.04311248/1359 [==========================>...] - ETA: 0s - loss: 0.0055 - fvaf: 0.4778 - root_mean_squared_error: 0.07421359/1359 [==============================] - 0s 45us/sample - loss: 0.0053 - fvaf: 0.4771 - root_mean_squared_error: 0.0727
