Total jobs: 120
{'Ntraining': 3, 'rotation': 19}
Params: JI_Ntraining_3_rotation_19
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_3_rotation_19
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/3586 [..............................] - ETA: 0s - loss: 7.4201e-05 - fvaf: 0.9862 - root_mean_squared_error: 0.0086 960/3586 [=======>......................] - ETA: 0s - loss: 9.8847e-05 - fvaf: 0.9712 - root_mean_squared_error: 0.00991920/3586 [===============>..............] - ETA: 0s - loss: 7.8115e-05 - fvaf: 0.9750 - root_mean_squared_error: 0.00882944/3586 [=======================>......] - ETA: 0s - loss: 7.1627e-05 - fvaf: 0.9745 - root_mean_squared_error: 0.00853586/3586 [==============================] - 0s 53us/sample - loss: 6.9460e-05 - fvaf: 0.9746 - root_mean_squared_error: 0.0083
  32/1364 [..............................] - ETA: 0s - loss: 0.0039 - fvaf: 0.6119 - root_mean_squared_error: 0.06271024/1364 [=====================>........] - ETA: 0s - loss: 0.0032 - fvaf: 0.6514 - root_mean_squared_error: 0.05681364/1364 [==============================] - 0s 53us/sample - loss: 0.0030 - fvaf: 0.6458 - root_mean_squared_error: 0.0546
  32/1389 [..............................] - ETA: 0s - loss: 0.0014 - fvaf: 0.3195 - root_mean_squared_error: 0.03701024/1389 [=====================>........] - ETA: 0s - loss: 0.0020 - fvaf: 0.6772 - root_mean_squared_error: 0.04451389/1389 [==============================] - 0s 56us/sample - loss: 0.0021 - fvaf: 0.6559 - root_mean_squared_error: 0.0458
