Total jobs: 120
{'Ntraining': 18, 'rotation': 7}
Params: JI_Ntraining_18_rotation_7
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_18_rotation_7
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
   32/23649 [..............................] - ETA: 25s - loss: 1.6341e-04 - fvaf: 0.9648 - root_mean_squared_error: 0.0128  448/23649 [..............................] - ETA: 4s - loss: 1.6261e-04 - fvaf: 0.9538 - root_mean_squared_error: 0.0128   768/23649 [..............................] - ETA: 4s - loss: 0.0015 - fvaf: 0.8979 - root_mean_squared_error: 0.0387     1088/23649 [>.............................] - ETA: 4s - loss: 0.0011 - fvaf: 0.9185 - root_mean_squared_error: 0.0338 1536/23649 [>.............................] - ETA: 3s - loss: 8.5008e-04 - fvaf: 0.9242 - root_mean_squared_error: 0.0292 2080/23649 [=>............................] - ETA: 3s - loss: 6.8242e-04 - fvaf: 0.9363 - root_mean_squared_error: 0.0261 2496/23649 [==>...........................] - ETA: 2s - loss: 5.9215e-04 - fvaf: 0.9366 - root_mean_squared_error: 0.0243 2848/23649 [==>...........................] - ETA: 2s - loss: 5.4903e-04 - fvaf: 0.9399 - root_mean_squared_error: 0.0234 3072/23649 [==>...........................] - ETA: 3s - loss: 5.2143e-04 - fvaf: 0.9402 - root_mean_squared_error: 0.0228 3488/23649 [===>..........................] - ETA: 2s - loss: 4.7497e-04 - fvaf: 0.9409 - root_mean_squared_error: 0.0218 4064/23649 [====>.........................] - ETA: 2s - loss: 4.2894e-04 - fvaf: 0.9428 - root_mean_squared_error: 0.0207 4544/23649 [====>.........................] - ETA: 2s - loss: 4.0472e-04 - fvaf: 0.9460 - root_mean_squared_error: 0.0201 4960/23649 [=====>........................] - ETA: 2s - loss: 3.8983e-04 - fvaf: 0.9469 - root_mean_squared_error: 0.0197 5568/23649 [======>.......................] - ETA: 2s - loss: 3.6457e-04 - fvaf: 0.9473 - root_mean_squared_error: 0.0191 5792/23649 [======>.......................] - ETA: 2s - loss: 3.5667e-04 - fvaf: 0.9471 - root_mean_squared_error: 0.0189 6368/23649 [=======>......................] - ETA: 2s - loss: 3.3657e-04 - fvaf: 0.9468 - root_mean_squared_error: 0.0183 6944/23649 [=======>......................] - ETA: 2s - loss: 3.2070e-04 - fvaf: 0.9466 - root_mean_squared_error: 0.0179 7392/23649 [========>.....................] - ETA: 2s - loss: 3.1403e-04 - fvaf: 0.9459 - root_mean_squared_error: 0.0177 8000/23649 [=========>....................] - ETA: 1s - loss: 2.9990e-04 - fvaf: 0.9453 - root_mean_squared_error: 0.0173 8224/23649 [=========>....................] - ETA: 1s - loss: 2.9533e-04 - fvaf: 0.9451 - root_mean_squared_error: 0.0172 8832/23649 [==========>...................] - ETA: 1s - loss: 2.8797e-04 - fvaf: 0.9450 - root_mean_squared_error: 0.0170 9376/23649 [==========>...................] - ETA: 1s - loss: 2.7915e-04 - fvaf: 0.9448 - root_mean_squared_error: 0.0167 9984/23649 [===========>..................] - ETA: 1s - loss: 2.7114e-04 - fvaf: 0.9445 - root_mean_squared_error: 0.016510176/23649 [===========>..................] - ETA: 1s - loss: 2.6956e-04 - fvaf: 0.9443 - root_mean_squared_error: 0.016410592/23649 [============>.................] - ETA: 1s - loss: 2.7126e-04 - fvaf: 0.9442 - root_mean_squared_error: 0.016511040/23649 [=============>................] - ETA: 1s - loss: 2.6707e-04 - fvaf: 0.9454 - root_mean_squared_error: 0.016311488/23649 [=============>................] - ETA: 1s - loss: 2.6342e-04 - fvaf: 0.9458 - root_mean_squared_error: 0.016211808/23649 [=============>................] - ETA: 1s - loss: 2.6033e-04 - fvaf: 0.9458 - root_mean_squared_error: 0.016112320/23649 [==============>...............] - ETA: 1s - loss: 2.5775e-04 - fvaf: 0.9458 - root_mean_squared_error: 0.016112896/23649 [===============>..............] - ETA: 1s - loss: 2.5342e-04 - fvaf: 0.9455 - root_mean_squared_error: 0.015913312/23649 [===============>..............] - ETA: 1s - loss: 2.5105e-04 - fvaf: 0.9453 - root_mean_squared_error: 0.015813728/23649 [================>.............] - ETA: 1s - loss: 2.4951e-04 - fvaf: 0.9449 - root_mean_squared_error: 0.015814368/23649 [=================>............] - ETA: 1s - loss: 2.4547e-04 - fvaf: 0.9445 - root_mean_squared_error: 0.015714848/23649 [=================>............] - ETA: 1s - loss: 2.4241e-04 - fvaf: 0.9443 - root_mean_squared_error: 0.015615552/23649 [==================>...........] - ETA: 0s - loss: 2.3857e-04 - fvaf: 0.9440 - root_mean_squared_error: 0.015416096/23649 [===================>..........] - ETA: 0s - loss: 2.3765e-04 - fvaf: 0.9432 - root_mean_squared_error: 0.015416768/23649 [====================>.........] - ETA: 0s - loss: 2.3507e-04 - fvaf: 0.9435 - root_mean_squared_error: 0.015317472/23649 [=====================>........] - ETA: 0s - loss: 2.3146e-04 - fvaf: 0.9436 - root_mean_squared_error: 0.015217856/23649 [=====================>........] - ETA: 0s - loss: 2.3021e-04 - fvaf: 0.9434 - root_mean_squared_error: 0.015218048/23649 [=====================>........] - ETA: 0s - loss: 2.2889e-04 - fvaf: 0.9433 - root_mean_squared_error: 0.015118496/23649 [======================>.......] - ETA: 0s - loss: 2.2678e-04 - fvaf: 0.9430 - root_mean_squared_error: 0.015119072/23649 [=======================>......] - ETA: 0s - loss: 2.2403e-04 - fvaf: 0.9430 - root_mean_squared_error: 0.015019520/23649 [=======================>......] - ETA: 0s - loss: 2.2198e-04 - fvaf: 0.9429 - root_mean_squared_error: 0.014920032/23649 [========================>.....] - ETA: 0s - loss: 2.2085e-04 - fvaf: 0.9428 - root_mean_squared_error: 0.014920608/23649 [=========================>....] - ETA: 0s - loss: 2.1930e-04 - fvaf: 0.9429 - root_mean_squared_error: 0.014820864/23649 [=========================>....] - ETA: 0s - loss: 2.1905e-04 - fvaf: 0.9429 - root_mean_squared_error: 0.014821184/23649 [=========================>....] - ETA: 0s - loss: 2.1892e-04 - fvaf: 0.9429 - root_mean_squared_error: 0.014821504/23649 [==========================>...] - ETA: 0s - loss: 2.1847e-04 - fvaf: 0.9428 - root_mean_squared_error: 0.014821824/23649 [==========================>...] - ETA: 0s - loss: 2.1738e-04 - fvaf: 0.9430 - root_mean_squared_error: 0.014722368/23649 [===========================>..] - ETA: 0s - loss: 2.1620e-04 - fvaf: 0.9432 - root_mean_squared_error: 0.014722656/23649 [===========================>..] - ETA: 0s - loss: 2.1714e-04 - fvaf: 0.9436 - root_mean_squared_error: 0.014722784/23649 [===========================>..] - ETA: 0s - loss: 2.1759e-04 - fvaf: 0.9438 - root_mean_squared_error: 0.014823008/23649 [============================>.] - ETA: 0s - loss: 2.1881e-04 - fvaf: 0.9444 - root_mean_squared_error: 0.014823520/23649 [============================>.] - ETA: 0s - loss: 2.1843e-04 - fvaf: 0.9452 - root_mean_squared_error: 0.014823649/23649 [==============================] - 3s 121us/sample - loss: 2.1813e-04 - fvaf: 0.9451 - root_mean_squared_error: 0.0148
  32/1252 [..............................] - ETA: 1s - loss: 0.0010 - fvaf: -0.3411 - root_mean_squared_error: 0.0323 224/1252 [====>.........................] - ETA: 0s - loss: 0.0020 - fvaf: 0.7608 - root_mean_squared_error: 0.0444  576/1252 [============>.................] - ETA: 0s - loss: 0.0022 - fvaf: 0.7555 - root_mean_squared_error: 0.04661152/1252 [==========================>...] - ETA: 0s - loss: 0.0058 - fvaf: 0.5595 - root_mean_squared_error: 0.07621252/1252 [==============================] - 0s 167us/sample - loss: 0.0055 - fvaf: 0.5627 - root_mean_squared_error: 0.0739
  32/1375 [..............................] - ETA: 1s - loss: 0.0014 - fvaf: 0.3745 - root_mean_squared_error: 0.0368 416/1375 [========>.....................] - ETA: 0s - loss: 0.0021 - fvaf: 0.6612 - root_mean_squared_error: 0.0453 896/1375 [==================>...........] - ETA: 0s - loss: 0.0025 - fvaf: 0.7085 - root_mean_squared_error: 0.04961375/1375 [==============================] - 0s 136us/sample - loss: 0.0036 - fvaf: 0.6826 - root_mean_squared_error: 0.0601
