Total jobs: 120
{'Ntraining': 5, 'rotation': 9}
Params: JI_Ntraining_5_rotation_9
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_5_rotation_9
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/6131 [..............................] - ETA: 2s - loss: 6.6910e-05 - fvaf: 0.9759 - root_mean_squared_error: 0.0082 672/6131 [==>...........................] - ETA: 0s - loss: 1.5086e-04 - fvaf: 0.9552 - root_mean_squared_error: 0.01231120/6131 [====>.........................] - ETA: 0s - loss: 1.1125e-04 - fvaf: 0.9628 - root_mean_squared_error: 0.01051600/6131 [======>.......................] - ETA: 0s - loss: 9.4618e-05 - fvaf: 0.9689 - root_mean_squared_error: 0.00972304/6131 [==========>...................] - ETA: 0s - loss: 1.1533e-04 - fvaf: 0.9672 - root_mean_squared_error: 0.01072784/6131 [============>.................] - ETA: 0s - loss: 1.1029e-04 - fvaf: 0.9694 - root_mean_squared_error: 0.01053136/6131 [==============>...............] - ETA: 0s - loss: 1.0488e-04 - fvaf: 0.9699 - root_mean_squared_error: 0.01023904/6131 [==================>...........] - ETA: 0s - loss: 9.5717e-05 - fvaf: 0.9710 - root_mean_squared_error: 0.00984608/6131 [=====================>........] - ETA: 0s - loss: 8.9018e-05 - fvaf: 0.9720 - root_mean_squared_error: 0.00945408/6131 [=========================>....] - ETA: 0s - loss: 8.6136e-05 - fvaf: 0.9720 - root_mean_squared_error: 0.00936131/6131 [==============================] - 1s 84us/sample - loss: 8.3428e-05 - fvaf: 0.9726 - root_mean_squared_error: 0.0091
  32/1130 [..............................] - ETA: 0s - loss: 0.0011 - fvaf: 0.8594 - root_mean_squared_error: 0.0327 704/1130 [=================>............] - ETA: 0s - loss: 0.0139 - fvaf: 0.4184 - root_mean_squared_error: 0.11771130/1130 [==============================] - 0s 92us/sample - loss: 0.0113 - fvaf: 0.4591 - root_mean_squared_error: 0.1062
  32/1247 [..............................] - ETA: 0s - loss: 0.0051 - fvaf: 0.7770 - root_mean_squared_error: 0.0713 864/1247 [===================>..........] - ETA: 0s - loss: 0.0041 - fvaf: 0.6182 - root_mean_squared_error: 0.06361247/1247 [==============================] - 0s 70us/sample - loss: 0.0034 - fvaf: 0.6203 - root_mean_squared_error: 0.0587
