Total jobs: 120
{'Ntraining': 1, 'rotation': 5}
Params: JI_Ntraining_1_rotation_5
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_1_rotation_5
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/1252 [..............................] - ETA: 0s - loss: 5.4501e-05 - fvaf: 0.8186 - root_mean_squared_error: 0.0074 608/1252 [=============>................] - ETA: 0s - loss: 6.9785e-05 - fvaf: 0.9765 - root_mean_squared_error: 0.00841184/1252 [===========================>..] - ETA: 0s - loss: 1.1040e-04 - fvaf: 0.9826 - root_mean_squared_error: 0.01051252/1252 [==============================] - 0s 96us/sample - loss: 1.0809e-04 - fvaf: 0.9824 - root_mean_squared_error: 0.0104
  32/1265 [..............................] - ETA: 0s - loss: 0.0052 - fvaf: 0.3686 - root_mean_squared_error: 0.0723 672/1265 [==============>...............] - ETA: 0s - loss: 0.0087 - fvaf: -0.1270 - root_mean_squared_error: 0.09331265/1265 [==============================] - 0s 73us/sample - loss: 0.0075 - fvaf: 0.0139 - root_mean_squared_error: 0.0866
  32/1498 [..............................] - ETA: 0s - loss: 0.0044 - fvaf: 0.5264 - root_mean_squared_error: 0.0665 640/1498 [===========>..................] - ETA: 0s - loss: 0.0117 - fvaf: 0.0168 - root_mean_squared_error: 0.10801280/1498 [========================>.....] - ETA: 0s - loss: 0.0109 - fvaf: 0.1901 - root_mean_squared_error: 0.10441498/1498 [==============================] - 0s 85us/sample - loss: 0.0101 - fvaf: 0.2144 - root_mean_squared_error: 0.1004
