Total jobs: 120
{'Ntraining': 10, 'rotation': 9}
Params: JI_Ntraining_10_rotation_9
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_10_rotation_9
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
   32/13392 [..............................] - ETA: 5s - loss: 8.0713e-05 - fvaf: 0.9790 - root_mean_squared_error: 0.0090 1696/13392 [==>...........................] - ETA: 0s - loss: 8.1877e-05 - fvaf: 0.9870 - root_mean_squared_error: 0.0090 3200/13392 [======>.......................] - ETA: 0s - loss: 8.2216e-05 - fvaf: 0.9882 - root_mean_squared_error: 0.0091 4736/13392 [=========>....................] - ETA: 0s - loss: 7.7313e-05 - fvaf: 0.9875 - root_mean_squared_error: 0.0088 6272/13392 [=============>................] - ETA: 0s - loss: 7.4604e-05 - fvaf: 0.9870 - root_mean_squared_error: 0.0086 7776/13392 [================>.............] - ETA: 0s - loss: 7.3886e-05 - fvaf: 0.9867 - root_mean_squared_error: 0.0086 9312/13392 [===================>..........] - ETA: 0s - loss: 7.6343e-05 - fvaf: 0.9871 - root_mean_squared_error: 0.008710688/13392 [======================>.......] - ETA: 0s - loss: 7.5968e-05 - fvaf: 0.9871 - root_mean_squared_error: 0.008711840/13392 [=========================>....] - ETA: 0s - loss: 7.5189e-05 - fvaf: 0.9871 - root_mean_squared_error: 0.008713376/13392 [============================>.] - ETA: 0s - loss: 7.4186e-05 - fvaf: 0.9871 - root_mean_squared_error: 0.008613392/13392 [==============================] - 0s 35us/sample - loss: 7.4224e-05 - fvaf: 0.9871 - root_mean_squared_error: 0.0086
  32/1130 [..............................] - ETA: 0s - loss: 0.0021 - fvaf: 0.8156 - root_mean_squared_error: 0.04621130/1130 [==============================] - 0s 35us/sample - loss: 0.0107 - fvaf: 0.4994 - root_mean_squared_error: 0.1033
  32/1247 [..............................] - ETA: 0s - loss: 0.0044 - fvaf: 0.6865 - root_mean_squared_error: 0.06661247/1247 [==============================] - 0s 32us/sample - loss: 0.0031 - fvaf: 0.6613 - root_mean_squared_error: 0.0556
