Total jobs: 120
{'Ntraining': 2, 'rotation': 3}
Params: JI_Ntraining_2_rotation_3
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_2_rotation_3
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/2763 [..............................] - ETA: 2s - loss: 1.2598e-04 - fvaf: 0.9862 - root_mean_squared_error: 0.0112 704/2763 [======>.......................] - ETA: 0s - loss: 1.3295e-04 - fvaf: 0.9783 - root_mean_squared_error: 0.01151632/2763 [================>.............] - ETA: 0s - loss: 1.5073e-04 - fvaf: 0.9747 - root_mean_squared_error: 0.01232464/2763 [=========================>....] - ETA: 0s - loss: 1.7055e-04 - fvaf: 0.9766 - root_mean_squared_error: 0.01312763/2763 [==============================] - 0s 71us/sample - loss: 1.6554e-04 - fvaf: 0.9771 - root_mean_squared_error: 0.0129
  32/1104 [..............................] - ETA: 0s - loss: 0.0018 - fvaf: 0.3638 - root_mean_squared_error: 0.0420 960/1104 [=========================>....] - ETA: 0s - loss: 0.0032 - fvaf: 0.4817 - root_mean_squared_error: 0.05701104/1104 [==============================] - 0s 80us/sample - loss: 0.0035 - fvaf: 0.4468 - root_mean_squared_error: 0.0591
  32/1531 [..............................] - ETA: 1s - loss: 0.0058 - fvaf: 0.5154 - root_mean_squared_error: 0.0765 832/1531 [===============>..............] - ETA: 0s - loss: 0.0038 - fvaf: 0.5684 - root_mean_squared_error: 0.06191531/1531 [==============================] - 0s 71us/sample - loss: 0.0037 - fvaf: 0.5698 - root_mean_squared_error: 0.0609
