Total jobs: 120
{'Ntraining': 2, 'rotation': 6}
Params: JI_Ntraining_2_rotation_6
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_2_rotation_6
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/2505 [..............................] - ETA: 0s - loss: 1.3037e-04 - fvaf: 0.8786 - root_mean_squared_error: 0.0114 768/2505 [========>.....................] - ETA: 0s - loss: 1.6165e-04 - fvaf: 0.9557 - root_mean_squared_error: 0.01271504/2505 [=================>............] - ETA: 0s - loss: 2.0900e-04 - fvaf: 0.9695 - root_mean_squared_error: 0.01452432/2505 [============================>.] - ETA: 0s - loss: 5.1459e-04 - fvaf: 0.9642 - root_mean_squared_error: 0.02272505/2505 [==============================] - 0s 66us/sample - loss: 5.0548e-04 - fvaf: 0.9642 - root_mean_squared_error: 0.0225
  32/1498 [..............................] - ETA: 0s - loss: 0.0025 - fvaf: 0.7347 - root_mean_squared_error: 0.0501 640/1498 [===========>..................] - ETA: 0s - loss: 0.0098 - fvaf: 0.2718 - root_mean_squared_error: 0.09911408/1498 [===========================>..] - ETA: 0s - loss: 0.0083 - fvaf: 0.4141 - root_mean_squared_error: 0.09131498/1498 [==============================] - 0s 75us/sample - loss: 0.0081 - fvaf: 0.4158 - root_mean_squared_error: 0.0898
  32/1252 [..............................] - ETA: 0s - loss: 0.0024 - fvaf: -1.9767 - root_mean_squared_error: 0.04941024/1252 [=======================>......] - ETA: 0s - loss: 0.0073 - fvaf: 0.4920 - root_mean_squared_error: 0.0852 1252/1252 [==============================] - 0s 56us/sample - loss: 0.0066 - fvaf: 0.4963 - root_mean_squared_error: 0.0809
