Total jobs: 120
{'Ntraining': 10, 'rotation': 6}
Params: JI_Ntraining_10_rotation_6
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_10_rotation_6
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
   32/12812 [..............................] - ETA: 7s - loss: 3.6888e-05 - fvaf: 0.9630 - root_mean_squared_error: 0.0061 1056/12812 [=>............................] - ETA: 0s - loss: 1.4041e-04 - fvaf: 0.9839 - root_mean_squared_error: 0.0118 2144/12812 [====>.........................] - ETA: 0s - loss: 4.4937e-04 - fvaf: 0.9774 - root_mean_squared_error: 0.0212 3232/12812 [======>.......................] - ETA: 0s - loss: 3.2199e-04 - fvaf: 0.9809 - root_mean_squared_error: 0.0179 4224/12812 [========>.....................] - ETA: 0s - loss: 2.6816e-04 - fvaf: 0.9822 - root_mean_squared_error: 0.0164 5248/12812 [===========>..................] - ETA: 0s - loss: 2.2800e-04 - fvaf: 0.9829 - root_mean_squared_error: 0.0151 6240/12812 [=============>................] - ETA: 0s - loss: 2.0204e-04 - fvaf: 0.9842 - root_mean_squared_error: 0.0142 7296/12812 [================>.............] - ETA: 0s - loss: 1.8237e-04 - fvaf: 0.9845 - root_mean_squared_error: 0.0135 8256/12812 [==================>...........] - ETA: 0s - loss: 1.6882e-04 - fvaf: 0.9842 - root_mean_squared_error: 0.0130 9312/12812 [====================>.........] - ETA: 0s - loss: 1.5771e-04 - fvaf: 0.9840 - root_mean_squared_error: 0.012610272/12812 [=======================>......] - ETA: 0s - loss: 1.4919e-04 - fvaf: 0.9840 - root_mean_squared_error: 0.012211296/12812 [=========================>....] - ETA: 0s - loss: 1.4115e-04 - fvaf: 0.9838 - root_mean_squared_error: 0.011912288/12812 [===========================>..] - ETA: 0s - loss: 1.3720e-04 - fvaf: 0.9841 - root_mean_squared_error: 0.011712812/12812 [==============================] - 1s 51us/sample - loss: 1.3461e-04 - fvaf: 0.9843 - root_mean_squared_error: 0.0116
  32/1498 [..............................] - ETA: 0s - loss: 0.0026 - fvaf: 0.7671 - root_mean_squared_error: 0.05121056/1498 [====================>.........] - ETA: 0s - loss: 0.0074 - fvaf: 0.5050 - root_mean_squared_error: 0.08601498/1498 [==============================] - 0s 52us/sample - loss: 0.0061 - fvaf: 0.5404 - root_mean_squared_error: 0.0779
  32/1252 [..............................] - ETA: 0s - loss: 9.4091e-04 - fvaf: -1.0339 - root_mean_squared_error: 0.03071088/1252 [=========================>....] - ETA: 0s - loss: 0.0058 - fvaf: 0.5447 - root_mean_squared_error: 0.0759     1252/1252 [==============================] - 0s 53us/sample - loss: 0.0053 - fvaf: 0.5504 - root_mean_squared_error: 0.0726
