Total jobs: 120
{'Ntraining': 5, 'rotation': 1}
Params: JI_Ntraining_5_rotation_1
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_5_rotation_1
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/6650 [..............................] - ETA: 2s - loss: 8.6781e-05 - fvaf: 0.9419 - root_mean_squared_error: 0.0093 960/6650 [===>..........................] - ETA: 0s - loss: 1.0296e-04 - fvaf: 0.9647 - root_mean_squared_error: 0.01011888/6650 [=======>......................] - ETA: 0s - loss: 1.0035e-04 - fvaf: 0.9688 - root_mean_squared_error: 0.01002784/6650 [===========>..................] - ETA: 0s - loss: 1.0243e-04 - fvaf: 0.9707 - root_mean_squared_error: 0.01013712/6650 [===============>..............] - ETA: 0s - loss: 1.0491e-04 - fvaf: 0.9711 - root_mean_squared_error: 0.01024576/6650 [===================>..........] - ETA: 0s - loss: 1.1645e-04 - fvaf: 0.9747 - root_mean_squared_error: 0.01085440/6650 [=======================>......] - ETA: 0s - loss: 1.2030e-04 - fvaf: 0.9752 - root_mean_squared_error: 0.01106304/6650 [===========================>..] - ETA: 0s - loss: 1.2426e-04 - fvaf: 0.9766 - root_mean_squared_error: 0.01116650/6650 [==============================] - 0s 59us/sample - loss: 1.2564e-04 - fvaf: 0.9766 - root_mean_squared_error: 0.0112
  32/1289 [..............................] - ETA: 0s - loss: 0.0040 - fvaf: 0.4593 - root_mean_squared_error: 0.0635 928/1289 [====================>.........] - ETA: 0s - loss: 0.0047 - fvaf: 0.5162 - root_mean_squared_error: 0.06841289/1289 [==============================] - 0s 61us/sample - loss: 0.0039 - fvaf: 0.5424 - root_mean_squared_error: 0.0627
  32/1193 [..............................] - ETA: 0s - loss: 0.0028 - fvaf: 0.7002 - root_mean_squared_error: 0.0526 896/1193 [=====================>........] - ETA: 0s - loss: 0.0022 - fvaf: 0.6679 - root_mean_squared_error: 0.04641193/1193 [==============================] - 0s 63us/sample - loss: 0.0021 - fvaf: 0.6738 - root_mean_squared_error: 0.0462
