Total jobs: 120
{'Ntraining': 1, 'rotation': 9}
Params: JI_Ntraining_1_rotation_9
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_1_rotation_9
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/1257 [..............................] - ETA: 0s - loss: 1.6705e-05 - fvaf: 0.9875 - root_mean_squared_error: 0.0041 640/1257 [==============>...............] - ETA: 0s - loss: 3.9936e-05 - fvaf: 0.9935 - root_mean_squared_error: 0.00631257/1257 [==============================] - 0s 82us/sample - loss: 3.3333e-05 - fvaf: 0.9929 - root_mean_squared_error: 0.0058
  32/1130 [..............................] - ETA: 0s - loss: 0.0037 - fvaf: 0.5966 - root_mean_squared_error: 0.0609 672/1130 [================>.............] - ETA: 0s - loss: 0.0164 - fvaf: 0.3209 - root_mean_squared_error: 0.12821130/1130 [==============================] - 0s 75us/sample - loss: 0.0141 - fvaf: 0.3374 - root_mean_squared_error: 0.1186
  32/1247 [..............................] - ETA: 0s - loss: 0.0050 - fvaf: 0.7457 - root_mean_squared_error: 0.0706 800/1247 [==================>...........] - ETA: 0s - loss: 0.0057 - fvaf: 0.4741 - root_mean_squared_error: 0.07521247/1247 [==============================] - 0s 70us/sample - loss: 0.0054 - fvaf: 0.4436 - root_mean_squared_error: 0.0737
