Total jobs: 120
{'Ntraining': 3, 'rotation': 14}
Params: JI_Ntraining_3_rotation_14
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_3_rotation_14
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/4508 [..............................] - ETA: 1s - loss: 6.7408e-05 - fvaf: 0.9923 - root_mean_squared_error: 0.0082 928/4508 [=====>........................] - ETA: 0s - loss: 5.9828e-05 - fvaf: 0.9870 - root_mean_squared_error: 0.00771888/4508 [===========>..................] - ETA: 0s - loss: 7.4989e-05 - fvaf: 0.9858 - root_mean_squared_error: 0.00872784/4508 [=================>............] - ETA: 0s - loss: 8.5551e-05 - fvaf: 0.9857 - root_mean_squared_error: 0.00923744/4508 [=======================>......] - ETA: 0s - loss: 7.9950e-05 - fvaf: 0.9862 - root_mean_squared_error: 0.00894508/4508 [==============================] - 0s 56us/sample - loss: 7.6811e-05 - fvaf: 0.9860 - root_mean_squared_error: 0.0088
  32/1225 [..............................] - ETA: 0s - loss: 0.0031 - fvaf: 0.4286 - root_mean_squared_error: 0.05611120/1225 [==========================>...] - ETA: 0s - loss: 0.0025 - fvaf: 0.5675 - root_mean_squared_error: 0.05041225/1225 [==============================] - 0s 49us/sample - loss: 0.0025 - fvaf: 0.5601 - root_mean_squared_error: 0.0502
  32/1238 [..............................] - ETA: 0s - loss: 0.0019 - fvaf: 0.4639 - root_mean_squared_error: 0.04381238/1238 [==============================] - 0s 44us/sample - loss: 0.0021 - fvaf: 0.5884 - root_mean_squared_error: 0.0457
