Total jobs: 120
{'Ntraining': 10, 'rotation': 19}
Params: JI_Ntraining_10_rotation_19
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_10_rotation_19
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
   32/12884 [..............................] - ETA: 4s - loss: 1.2575e-04 - fvaf: 0.9870 - root_mean_squared_error: 0.0112 1696/12884 [==>...........................] - ETA: 0s - loss: 1.2759e-04 - fvaf: 0.9698 - root_mean_squared_error: 0.0113 3424/12884 [======>.......................] - ETA: 0s - loss: 1.1430e-04 - fvaf: 0.9723 - root_mean_squared_error: 0.0107 5152/12884 [==========>...................] - ETA: 0s - loss: 1.1258e-04 - fvaf: 0.9748 - root_mean_squared_error: 0.0106 6848/12884 [==============>...............] - ETA: 0s - loss: 1.1305e-04 - fvaf: 0.9760 - root_mean_squared_error: 0.0106 8544/12884 [==================>...........] - ETA: 0s - loss: 1.1648e-04 - fvaf: 0.9781 - root_mean_squared_error: 0.010810240/12884 [======================>.......] - ETA: 0s - loss: 1.2448e-04 - fvaf: 0.9786 - root_mean_squared_error: 0.011211936/12884 [==========================>...] - ETA: 0s - loss: 1.9096e-04 - fvaf: 0.9750 - root_mean_squared_error: 0.013812884/12884 [==============================] - 0s 31us/sample - loss: 1.8699e-04 - fvaf: 0.9751 - root_mean_squared_error: 0.0137
  32/1364 [..............................] - ETA: 0s - loss: 0.0032 - fvaf: 0.6398 - root_mean_squared_error: 0.05671364/1364 [==============================] - 0s 32us/sample - loss: 0.0025 - fvaf: 0.6383 - root_mean_squared_error: 0.0499
  32/1389 [..............................] - ETA: 0s - loss: 0.0038 - fvaf: 0.2074 - root_mean_squared_error: 0.06141389/1389 [==============================] - 0s 32us/sample - loss: 0.0022 - fvaf: 0.6048 - root_mean_squared_error: 0.0473
