Total jobs: 120
{'Ntraining': 1, 'rotation': 6}
Params: JI_Ntraining_1_rotation_6
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_1_rotation_6
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/1375 [..............................] - ETA: 0s - loss: 6.3883e-04 - fvaf: 0.5314 - root_mean_squared_error: 0.02531120/1375 [=======================>......] - ETA: 0s - loss: 9.9651e-04 - fvaf: 0.8697 - root_mean_squared_error: 0.03161375/1375 [==============================] - 0s 50us/sample - loss: 0.0010 - fvaf: 0.8626 - root_mean_squared_error: 0.0318
  32/1498 [..............................] - ETA: 0s - loss: 0.0050 - fvaf: 0.4487 - root_mean_squared_error: 0.07051056/1498 [====================>.........] - ETA: 0s - loss: 0.0111 - fvaf: 0.1732 - root_mean_squared_error: 0.10521498/1498 [==============================] - 0s 54us/sample - loss: 0.0099 - fvaf: 0.1288 - root_mean_squared_error: 0.0994
  32/1252 [..............................] - ETA: 0s - loss: 0.0067 - fvaf: -10.6735 - root_mean_squared_error: 0.08181248/1252 [============================>.] - ETA: 0s - loss: 0.0091 - fvaf: 0.1042 - root_mean_squared_error: 0.0953  1252/1252 [==============================] - 0s 47us/sample - loss: 0.0091 - fvaf: 0.1043 - root_mean_squared_error: 0.0953
