Total jobs: 120
{'Ntraining': 10, 'rotation': 11}
Params: JI_Ntraining_10_rotation_11
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_10_rotation_11
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
   32/13352 [..............................] - ETA: 6s - loss: 1.6384e-04 - fvaf: 0.8272 - root_mean_squared_error: 0.0128 1344/13352 [==>...........................] - ETA: 0s - loss: 1.4829e-04 - fvaf: 0.9770 - root_mean_squared_error: 0.0122 2560/13352 [====>.........................] - ETA: 0s - loss: 1.5611e-04 - fvaf: 0.9751 - root_mean_squared_error: 0.0125 3904/13352 [=======>......................] - ETA: 0s - loss: 1.5441e-04 - fvaf: 0.9739 - root_mean_squared_error: 0.0124 5248/13352 [==========>...................] - ETA: 0s - loss: 1.5234e-04 - fvaf: 0.9736 - root_mean_squared_error: 0.0123 6592/13352 [=============>................] - ETA: 0s - loss: 1.5976e-04 - fvaf: 0.9762 - root_mean_squared_error: 0.0126 7968/13352 [================>.............] - ETA: 0s - loss: 1.5695e-04 - fvaf: 0.9763 - root_mean_squared_error: 0.0125 9248/13352 [===================>..........] - ETA: 0s - loss: 1.5595e-04 - fvaf: 0.9761 - root_mean_squared_error: 0.012510720/13352 [=======================>......] - ETA: 0s - loss: 1.5409e-04 - fvaf: 0.9758 - root_mean_squared_error: 0.012411936/13352 [=========================>....] - ETA: 0s - loss: 1.5597e-04 - fvaf: 0.9758 - root_mean_squared_error: 0.012513216/13352 [============================>.] - ETA: 0s - loss: 1.5514e-04 - fvaf: 0.9757 - root_mean_squared_error: 0.012513352/13352 [==============================] - 1s 39us/sample - loss: 1.5507e-04 - fvaf: 0.9756 - root_mean_squared_error: 0.0125
  32/1257 [..............................] - ETA: 0s - loss: 0.0014 - fvaf: 0.5954 - root_mean_squared_error: 0.03801257/1257 [==============================] - 0s 42us/sample - loss: 0.0026 - fvaf: 0.6497 - root_mean_squared_error: 0.0512
  32/1265 [..............................] - ETA: 0s - loss: 0.0039 - fvaf: 0.7422 - root_mean_squared_error: 0.06251265/1265 [==============================] - 0s 40us/sample - loss: 0.0041 - fvaf: 0.6106 - root_mean_squared_error: 0.0641
