Total jobs: 120
{'Ntraining': 10, 'rotation': 8}
Params: JI_Ntraining_10_rotation_8
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_10_rotation_8
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
   32/13250 [..............................] - ETA: 6s - loss: 1.4442e-04 - fvaf: 0.9785 - root_mean_squared_error: 0.0120 1152/13250 [=>............................] - ETA: 0s - loss: 1.3728e-04 - fvaf: 0.9623 - root_mean_squared_error: 0.0117 2368/13250 [====>.........................] - ETA: 0s - loss: 1.3356e-04 - fvaf: 0.9604 - root_mean_squared_error: 0.0116 3520/13250 [======>.......................] - ETA: 0s - loss: 1.3217e-04 - fvaf: 0.9636 - root_mean_squared_error: 0.0115 4800/13250 [=========>....................] - ETA: 0s - loss: 1.3035e-04 - fvaf: 0.9617 - root_mean_squared_error: 0.0114 6080/13250 [============>.................] - ETA: 0s - loss: 1.2941e-04 - fvaf: 0.9582 - root_mean_squared_error: 0.0114 7264/13250 [===============>..............] - ETA: 0s - loss: 1.2780e-04 - fvaf: 0.9551 - root_mean_squared_error: 0.0113 8480/13250 [==================>...........] - ETA: 0s - loss: 1.2619e-04 - fvaf: 0.9539 - root_mean_squared_error: 0.0112 9760/13250 [=====================>........] - ETA: 0s - loss: 1.2779e-04 - fvaf: 0.9551 - root_mean_squared_error: 0.011310944/13250 [=======================>......] - ETA: 0s - loss: 1.2781e-04 - fvaf: 0.9554 - root_mean_squared_error: 0.011312224/13250 [==========================>...] - ETA: 0s - loss: 1.2724e-04 - fvaf: 0.9548 - root_mean_squared_error: 0.011313250/13250 [==============================] - 1s 42us/sample - loss: 1.2683e-04 - fvaf: 0.9539 - root_mean_squared_error: 0.0113
  32/1375 [..............................] - ETA: 0s - loss: 0.0017 - fvaf: 0.3659 - root_mean_squared_error: 0.04101216/1375 [=========================>....] - ETA: 0s - loss: 0.0037 - fvaf: 0.6592 - root_mean_squared_error: 0.06101375/1375 [==============================] - 0s 44us/sample - loss: 0.0038 - fvaf: 0.6434 - root_mean_squared_error: 0.0619
  32/1130 [..............................] - ETA: 0s - loss: 0.0023 - fvaf: 0.8058 - root_mean_squared_error: 0.04821130/1130 [==============================] - 0s 44us/sample - loss: 0.0109 - fvaf: 0.4759 - root_mean_squared_error: 0.1042
