Total jobs: 120
{'Ntraining': 3, 'rotation': 3}
Params: JI_Ntraining_3_rotation_3
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_3_rotation_3
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/4015 [..............................] - ETA: 0s - loss: 1.5399e-04 - fvaf: 0.9781 - root_mean_squared_error: 0.01241536/4015 [==========>...................] - ETA: 0s - loss: 1.7619e-04 - fvaf: 0.9698 - root_mean_squared_error: 0.01333104/4015 [======================>.......] - ETA: 0s - loss: 1.8950e-04 - fvaf: 0.9742 - root_mean_squared_error: 0.01384015/4015 [==============================] - 0s 34us/sample - loss: 1.9579e-04 - fvaf: 0.9759 - root_mean_squared_error: 0.0140
  32/1104 [..............................] - ETA: 0s - loss: 0.0023 - fvaf: 0.0965 - root_mean_squared_error: 0.04801104/1104 [==============================] - 0s 35us/sample - loss: 0.0027 - fvaf: 0.5587 - root_mean_squared_error: 0.0517
  32/1531 [..............................] - ETA: 0s - loss: 0.0044 - fvaf: 0.5852 - root_mean_squared_error: 0.06631504/1531 [============================>.] - ETA: 0s - loss: 0.0028 - fvaf: 0.6425 - root_mean_squared_error: 0.05341531/1531 [==============================] - 0s 36us/sample - loss: 0.0029 - fvaf: 0.6373 - root_mean_squared_error: 0.0535
