Total jobs: 120
{'Ntraining': 5, 'rotation': 7}
Params: JI_Ntraining_5_rotation_7
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_5_rotation_7
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/6045 [..............................] - ETA: 1s - loss: 7.6558e-05 - fvaf: 0.9936 - root_mean_squared_error: 0.00871664/6045 [=======>......................] - ETA: 0s - loss: 5.0151e-04 - fvaf: 0.9816 - root_mean_squared_error: 0.02243360/6045 [===============>..............] - ETA: 0s - loss: 2.8409e-04 - fvaf: 0.9859 - root_mean_squared_error: 0.01695088/6045 [========================>.....] - ETA: 0s - loss: 2.1193e-04 - fvaf: 0.9881 - root_mean_squared_error: 0.01466045/6045 [==============================] - 0s 31us/sample - loss: 1.8835e-04 - fvaf: 0.9884 - root_mean_squared_error: 0.0137
  32/1252 [..............................] - ETA: 0s - loss: 0.0017 - fvaf: -1.8457 - root_mean_squared_error: 0.04101252/1252 [==============================] - 0s 35us/sample - loss: 0.0053 - fvaf: 0.5633 - root_mean_squared_error: 0.0727
  32/1375 [..............................] - ETA: 0s - loss: 0.0011 - fvaf: 0.4687 - root_mean_squared_error: 0.03261375/1375 [==============================] - 0s 31us/sample - loss: 0.0038 - fvaf: 0.6404 - root_mean_squared_error: 0.0619
