Total jobs: 120
{'Ntraining': 3, 'rotation': 15}
Params: JI_Ntraining_3_rotation_15
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_3_rotation_15
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/4302 [..............................] - ETA: 0s - loss: 1.0439e-04 - fvaf: 0.9854 - root_mean_squared_error: 0.0102 768/4302 [====>.........................] - ETA: 0s - loss: 1.3854e-04 - fvaf: 0.9839 - root_mean_squared_error: 0.01181632/4302 [==========>...................] - ETA: 0s - loss: 1.1714e-04 - fvaf: 0.9860 - root_mean_squared_error: 0.01082464/4302 [================>.............] - ETA: 0s - loss: 1.0772e-04 - fvaf: 0.9861 - root_mean_squared_error: 0.01043360/4302 [======================>.......] - ETA: 0s - loss: 1.0687e-04 - fvaf: 0.9853 - root_mean_squared_error: 0.01034256/4302 [============================>.] - ETA: 0s - loss: 1.0440e-04 - fvaf: 0.9849 - root_mean_squared_error: 0.01024302/4302 [==============================] - 0s 62us/sample - loss: 1.0417e-04 - fvaf: 0.9849 - root_mean_squared_error: 0.0102
  32/1238 [..............................] - ETA: 0s - loss: 0.0017 - fvaf: 0.3412 - root_mean_squared_error: 0.0413 896/1238 [====================>.........] - ETA: 0s - loss: 0.0019 - fvaf: 0.6035 - root_mean_squared_error: 0.04401238/1238 [==============================] - 0s 64us/sample - loss: 0.0021 - fvaf: 0.6183 - root_mean_squared_error: 0.0461
  32/1570 [..............................] - ETA: 0s - loss: 0.0034 - fvaf: 0.7841 - root_mean_squared_error: 0.0587 832/1570 [==============>...............] - ETA: 0s - loss: 0.0024 - fvaf: 0.6550 - root_mean_squared_error: 0.04911568/1570 [============================>.] - ETA: 0s - loss: 0.0022 - fvaf: 0.6472 - root_mean_squared_error: 0.04691570/1570 [==============================] - 0s 73us/sample - loss: 0.0022 - fvaf: 0.6468 - root_mean_squared_error: 0.0469
