Total jobs: 120
{'Ntraining': 2, 'rotation': 19}
Params: JI_Ntraining_2_rotation_19
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_2_rotation_19
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/2482 [..............................] - ETA: 0s - loss: 7.9317e-05 - fvaf: 0.9846 - root_mean_squared_error: 0.00891120/2482 [============>.................] - ETA: 0s - loss: 9.7834e-05 - fvaf: 0.9773 - root_mean_squared_error: 0.00992144/2482 [========================>.....] - ETA: 0s - loss: 8.1568e-05 - fvaf: 0.9798 - root_mean_squared_error: 0.00902482/2482 [==============================] - 0s 49us/sample - loss: 7.8096e-05 - fvaf: 0.9797 - root_mean_squared_error: 0.0088
  32/1364 [..............................] - ETA: 0s - loss: 0.0045 - fvaf: 0.4720 - root_mean_squared_error: 0.06691088/1364 [======================>.......] - ETA: 0s - loss: 0.0036 - fvaf: 0.5124 - root_mean_squared_error: 0.05981364/1364 [==============================] - 0s 53us/sample - loss: 0.0034 - fvaf: 0.5211 - root_mean_squared_error: 0.0583
  32/1389 [..............................] - ETA: 0s - loss: 0.0019 - fvaf: 0.2440 - root_mean_squared_error: 0.04371024/1389 [=====================>........] - ETA: 0s - loss: 0.0027 - fvaf: 0.5643 - root_mean_squared_error: 0.05161389/1389 [==============================] - 0s 59us/sample - loss: 0.0028 - fvaf: 0.5310 - root_mean_squared_error: 0.0527
