Total jobs: 120
{'Ntraining': 3, 'rotation': 18}
Params: JI_Ntraining_3_rotation_18
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_3_rotation_18
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/3871 [..............................] - ETA: 0s - loss: 6.9098e-05 - fvaf: 0.9792 - root_mean_squared_error: 0.00831120/3871 [=======>......................] - ETA: 0s - loss: 7.5734e-05 - fvaf: 0.9834 - root_mean_squared_error: 0.00872208/3871 [================>.............] - ETA: 0s - loss: 9.6936e-05 - fvaf: 0.9774 - root_mean_squared_error: 0.00983264/3871 [========================>.....] - ETA: 0s - loss: 9.0204e-05 - fvaf: 0.9789 - root_mean_squared_error: 0.00953871/3871 [==============================] - 0s 48us/sample - loss: 8.6710e-05 - fvaf: 0.9788 - root_mean_squared_error: 0.0093
  32/1579 [..............................] - ETA: 0s - loss: 0.0036 - fvaf: 0.7716 - root_mean_squared_error: 0.06041216/1579 [======================>.......] - ETA: 0s - loss: 0.0033 - fvaf: 0.6500 - root_mean_squared_error: 0.05791579/1579 [==============================] - 0s 46us/sample - loss: 0.0030 - fvaf: 0.6370 - root_mean_squared_error: 0.0552
  32/1364 [..............................] - ETA: 0s - loss: 0.0028 - fvaf: 0.6294 - root_mean_squared_error: 0.05331152/1364 [========================>.....] - ETA: 0s - loss: 0.0028 - fvaf: 0.6637 - root_mean_squared_error: 0.05251364/1364 [==============================] - 0s 54us/sample - loss: 0.0027 - fvaf: 0.6664 - root_mean_squared_error: 0.0518
