Total jobs: 120
{'Ntraining': 2, 'rotation': 15}
Params: JI_Ntraining_2_rotation_15
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_2_rotation_15
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/2938 [..............................] - ETA: 0s - loss: 1.1934e-04 - fvaf: 0.9717 - root_mean_squared_error: 0.0109 960/2938 [========>.....................] - ETA: 0s - loss: 1.8551e-04 - fvaf: 0.9707 - root_mean_squared_error: 0.01361952/2938 [==================>...........] - ETA: 0s - loss: 1.4072e-04 - fvaf: 0.9749 - root_mean_squared_error: 0.01192880/2938 [============================>.] - ETA: 0s - loss: 1.3123e-04 - fvaf: 0.9745 - root_mean_squared_error: 0.01152938/2938 [==============================] - 0s 55us/sample - loss: 1.3025e-04 - fvaf: 0.9746 - root_mean_squared_error: 0.0114
  32/1238 [..............................] - ETA: 0s - loss: 0.0038 - fvaf: -0.0070 - root_mean_squared_error: 0.0616 736/1238 [================>.............] - ETA: 0s - loss: 0.0026 - fvaf: 0.4709 - root_mean_squared_error: 0.0509 1238/1238 [==============================] - 0s 64us/sample - loss: 0.0028 - fvaf: 0.4945 - root_mean_squared_error: 0.0533
  32/1570 [..............................] - ETA: 0s - loss: 0.0055 - fvaf: 0.6032 - root_mean_squared_error: 0.0741 960/1570 [=================>............] - ETA: 0s - loss: 0.0028 - fvaf: 0.5467 - root_mean_squared_error: 0.05311570/1570 [==============================] - 0s 55us/sample - loss: 0.0028 - fvaf: 0.5422 - root_mean_squared_error: 0.0533
