Total jobs: 120
{'Ntraining': 5, 'rotation': 17}
Params: JI_Ntraining_5_rotation_17
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_5_rotation_17
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/6339 [..............................] - ETA: 2s - loss: 1.5536e-04 - fvaf: 0.9771 - root_mean_squared_error: 0.0125 672/6339 [==>...........................] - ETA: 0s - loss: 9.9192e-05 - fvaf: 0.9832 - root_mean_squared_error: 0.01001312/6339 [=====>........................] - ETA: 0s - loss: 9.6486e-05 - fvaf: 0.9834 - root_mean_squared_error: 0.00981792/6339 [=======>......................] - ETA: 0s - loss: 9.5640e-05 - fvaf: 0.9833 - root_mean_squared_error: 0.00982496/6339 [==========>...................] - ETA: 0s - loss: 9.4561e-05 - fvaf: 0.9830 - root_mean_squared_error: 0.00973296/6339 [==============>...............] - ETA: 0s - loss: 9.9269e-05 - fvaf: 0.9828 - root_mean_squared_error: 0.01004096/6339 [==================>...........] - ETA: 0s - loss: 9.8595e-05 - fvaf: 0.9829 - root_mean_squared_error: 0.00994864/6339 [======================>.......] - ETA: 0s - loss: 9.9509e-05 - fvaf: 0.9828 - root_mean_squared_error: 0.01005760/6339 [==========================>...] - ETA: 0s - loss: 9.9020e-05 - fvaf: 0.9822 - root_mean_squared_error: 0.01006339/6339 [==============================] - 0s 72us/sample - loss: 9.8867e-05 - fvaf: 0.9821 - root_mean_squared_error: 0.0099
  32/1359 [..............................] - ETA: 0s - loss: 0.0022 - fvaf: 0.7911 - root_mean_squared_error: 0.0473 704/1359 [==============>...............] - ETA: 0s - loss: 0.0061 - fvaf: 0.4155 - root_mean_squared_error: 0.07801184/1359 [=========================>....] - ETA: 0s - loss: 0.0048 - fvaf: 0.5639 - root_mean_squared_error: 0.06941359/1359 [==============================] - 0s 96us/sample - loss: 0.0045 - fvaf: 0.5721 - root_mean_squared_error: 0.0673
  32/1579 [..............................] - ETA: 0s - loss: 0.0049 - fvaf: 0.7648 - root_mean_squared_error: 0.07021120/1579 [====================>.........] - ETA: 0s - loss: 0.0029 - fvaf: 0.6738 - root_mean_squared_error: 0.05371579/1579 [==============================] - 0s 51us/sample - loss: 0.0027 - fvaf: 0.6515 - root_mean_squared_error: 0.0517
