Total jobs: 120
{'Ntraining': 3, 'rotation': 7}
Params: JI_Ntraining_3_rotation_7
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_3_rotation_7
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/3634 [..............................] - ETA: 0s - loss: 3.4727e-04 - fvaf: 0.9058 - root_mean_squared_error: 0.01861696/3634 [=============>................] - ETA: 0s - loss: 7.9341e-04 - fvaf: 0.9209 - root_mean_squared_error: 0.02823392/3634 [===========================>..] - ETA: 0s - loss: 5.5100e-04 - fvaf: 0.9288 - root_mean_squared_error: 0.02353634/3634 [==============================] - 0s 31us/sample - loss: 5.2832e-04 - fvaf: 0.9287 - root_mean_squared_error: 0.0230
  32/1252 [..............................] - ETA: 0s - loss: 0.0023 - fvaf: -2.6105 - root_mean_squared_error: 0.04791252/1252 [==============================] - 0s 36us/sample - loss: 0.0060 - fvaf: 0.5217 - root_mean_squared_error: 0.0778
  32/1375 [..............................] - ETA: 0s - loss: 0.0014 - fvaf: -0.3310 - root_mean_squared_error: 0.03771375/1375 [==============================] - 0s 39us/sample - loss: 0.0048 - fvaf: 0.5729 - root_mean_squared_error: 0.0696
