Total jobs: 120
{'Ntraining': 1, 'rotation': 17}
Params: JI_Ntraining_1_rotation_17
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_1_rotation_17
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/1364 [..............................] - ETA: 0s - loss: 3.2445e-04 - fvaf: 0.9567 - root_mean_squared_error: 0.01801280/1364 [===========================>..] - ETA: 0s - loss: 2.3268e-04 - fvaf: 0.9705 - root_mean_squared_error: 0.01531364/1364 [==============================] - 0s 44us/sample - loss: 2.3250e-04 - fvaf: 0.9702 - root_mean_squared_error: 0.0152
  32/1359 [..............................] - ETA: 0s - loss: 0.0030 - fvaf: 0.7271 - root_mean_squared_error: 0.05521248/1359 [==========================>...] - ETA: 0s - loss: 0.0080 - fvaf: 0.2939 - root_mean_squared_error: 0.08941359/1359 [==============================] - 0s 44us/sample - loss: 0.0076 - fvaf: 0.3052 - root_mean_squared_error: 0.0875
  32/1579 [..............................] - ETA: 0s - loss: 0.0071 - fvaf: 0.5948 - root_mean_squared_error: 0.08411216/1579 [======================>.......] - ETA: 0s - loss: 0.0043 - fvaf: 0.4653 - root_mean_squared_error: 0.06551579/1579 [==============================] - 0s 46us/sample - loss: 0.0043 - fvaf: 0.4121 - root_mean_squared_error: 0.0654
