Total jobs: 120
{'Ntraining': 10, 'rotation': 2}
Params: JI_Ntraining_10_rotation_2
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_10_rotation_2
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
   32/12966 [..............................] - ETA: 7s - loss: 1.9675e-04 - fvaf: 0.9851 - root_mean_squared_error: 0.0140  896/12966 [=>............................] - ETA: 0s - loss: 1.5922e-04 - fvaf: 0.9822 - root_mean_squared_error: 0.0126 1664/12966 [==>...........................] - ETA: 0s - loss: 1.5865e-04 - fvaf: 0.9814 - root_mean_squared_error: 0.0126 2304/12966 [====>.........................] - ETA: 0s - loss: 1.6228e-04 - fvaf: 0.9820 - root_mean_squared_error: 0.0127 3104/12966 [======>.......................] - ETA: 0s - loss: 1.5993e-04 - fvaf: 0.9826 - root_mean_squared_error: 0.0126 3776/12966 [=======>......................] - ETA: 0s - loss: 1.6251e-04 - fvaf: 0.9850 - root_mean_squared_error: 0.0127 4448/12966 [=========>....................] - ETA: 0s - loss: 1.6114e-04 - fvaf: 0.9852 - root_mean_squared_error: 0.0127 5184/12966 [==========>...................] - ETA: 0s - loss: 1.6457e-04 - fvaf: 0.9857 - root_mean_squared_error: 0.0128 5952/12966 [============>.................] - ETA: 0s - loss: 1.6169e-04 - fvaf: 0.9856 - root_mean_squared_error: 0.0127 6656/12966 [==============>...............] - ETA: 0s - loss: 1.6513e-04 - fvaf: 0.9861 - root_mean_squared_error: 0.0129 7296/12966 [===============>..............] - ETA: 0s - loss: 1.6430e-04 - fvaf: 0.9860 - root_mean_squared_error: 0.0128 8000/12966 [=================>............] - ETA: 0s - loss: 2.7908e-04 - fvaf: 0.9828 - root_mean_squared_error: 0.0167 8736/12966 [===================>..........] - ETA: 0s - loss: 2.6745e-04 - fvaf: 0.9829 - root_mean_squared_error: 0.0164 9440/12966 [====================>.........] - ETA: 0s - loss: 2.5864e-04 - fvaf: 0.9832 - root_mean_squared_error: 0.016110208/12966 [======================>.......] - ETA: 0s - loss: 2.5248e-04 - fvaf: 0.9833 - root_mean_squared_error: 0.015910816/12966 [========================>.....] - ETA: 0s - loss: 2.4736e-04 - fvaf: 0.9834 - root_mean_squared_error: 0.015711392/12966 [=========================>....] - ETA: 0s - loss: 2.4326e-04 - fvaf: 0.9837 - root_mean_squared_error: 0.015612096/12966 [==========================>...] - ETA: 0s - loss: 2.3799e-04 - fvaf: 0.9839 - root_mean_squared_error: 0.015412768/12966 [============================>.] - ETA: 0s - loss: 2.3344e-04 - fvaf: 0.9838 - root_mean_squared_error: 0.015312966/12966 [==============================] - 1s 75us/sample - loss: 2.3221e-04 - fvaf: 0.9837 - root_mean_squared_error: 0.0152
  32/1193 [..............................] - ETA: 0s - loss: 0.0038 - fvaf: 0.5178 - root_mean_squared_error: 0.0616 800/1193 [===================>..........] - ETA: 0s - loss: 0.0024 - fvaf: 0.6298 - root_mean_squared_error: 0.04881193/1193 [==============================] - 0s 77us/sample - loss: 0.0023 - fvaf: 0.6118 - root_mean_squared_error: 0.0484
  32/1104 [..............................] - ETA: 0s - loss: 0.0017 - fvaf: -0.0856 - root_mean_squared_error: 0.0417 640/1104 [================>.............] - ETA: 0s - loss: 0.0023 - fvaf: 0.5280 - root_mean_squared_error: 0.0478 1104/1104 [==============================] - 0s 86us/sample - loss: 0.0024 - fvaf: 0.5509 - root_mean_squared_error: 0.0490
