Total jobs: 120
{'Ntraining': 18, 'rotation': 16}
Params: JI_Ntraining_18_rotation_16
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_18_rotation_16
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
   32/23347 [..............................] - ETA: 15s - loss: 9.7656e-05 - fvaf: 0.9847 - root_mean_squared_error: 0.0099  832/23347 [>.............................] - ETA: 1s - loss: 1.0569e-04 - fvaf: 0.9655 - root_mean_squared_error: 0.0103  1728/23347 [=>............................] - ETA: 1s - loss: 1.0277e-04 - fvaf: 0.9618 - root_mean_squared_error: 0.0101 2656/23347 [==>...........................] - ETA: 1s - loss: 1.0130e-04 - fvaf: 0.9617 - root_mean_squared_error: 0.0101 3616/23347 [===>..........................] - ETA: 1s - loss: 9.7035e-05 - fvaf: 0.9612 - root_mean_squared_error: 0.0099 4512/23347 [====>.........................] - ETA: 1s - loss: 9.4833e-05 - fvaf: 0.9615 - root_mean_squared_error: 0.0097 5280/23347 [=====>........................] - ETA: 1s - loss: 1.1134e-04 - fvaf: 0.9551 - root_mean_squared_error: 0.0106 6048/23347 [======>.......................] - ETA: 1s - loss: 1.0847e-04 - fvaf: 0.9564 - root_mean_squared_error: 0.0104 7008/23347 [========>.....................] - ETA: 0s - loss: 1.0551e-04 - fvaf: 0.9562 - root_mean_squared_error: 0.0103 7840/23347 [=========>....................] - ETA: 0s - loss: 1.0240e-04 - fvaf: 0.9568 - root_mean_squared_error: 0.0101 8736/23347 [==========>...................] - ETA: 0s - loss: 1.0212e-04 - fvaf: 0.9577 - root_mean_squared_error: 0.0101 9632/23347 [===========>..................] - ETA: 0s - loss: 1.0189e-04 - fvaf: 0.9581 - root_mean_squared_error: 0.010110368/23347 [============>.................] - ETA: 0s - loss: 1.0300e-04 - fvaf: 0.9584 - root_mean_squared_error: 0.010111168/23347 [=============>................] - ETA: 0s - loss: 1.0439e-04 - fvaf: 0.9599 - root_mean_squared_error: 0.010212128/23347 [==============>...............] - ETA: 0s - loss: 1.0887e-04 - fvaf: 0.9620 - root_mean_squared_error: 0.010412928/23347 [===============>..............] - ETA: 0s - loss: 1.0917e-04 - fvaf: 0.9620 - root_mean_squared_error: 0.010413760/23347 [================>.............] - ETA: 0s - loss: 1.1250e-04 - fvaf: 0.9622 - root_mean_squared_error: 0.010614624/23347 [=================>............] - ETA: 0s - loss: 1.1395e-04 - fvaf: 0.9633 - root_mean_squared_error: 0.010715552/23347 [==================>...........] - ETA: 0s - loss: 1.6816e-04 - fvaf: 0.9583 - root_mean_squared_error: 0.013016384/23347 [====================>.........] - ETA: 0s - loss: 1.6610e-04 - fvaf: 0.9594 - root_mean_squared_error: 0.012917312/23347 [=====================>........] - ETA: 0s - loss: 1.6324e-04 - fvaf: 0.9603 - root_mean_squared_error: 0.012818208/23347 [======================>.......] - ETA: 0s - loss: 1.6043e-04 - fvaf: 0.9608 - root_mean_squared_error: 0.012719040/23347 [=======================>......] - ETA: 0s - loss: 1.5757e-04 - fvaf: 0.9612 - root_mean_squared_error: 0.012619904/23347 [========================>.....] - ETA: 0s - loss: 1.5660e-04 - fvaf: 0.9621 - root_mean_squared_error: 0.012520832/23347 [=========================>....] - ETA: 0s - loss: 1.5341e-04 - fvaf: 0.9623 - root_mean_squared_error: 0.012421600/23347 [==========================>...] - ETA: 0s - loss: 1.5087e-04 - fvaf: 0.9623 - root_mean_squared_error: 0.012322400/23347 [===========================>..] - ETA: 0s - loss: 1.4921e-04 - fvaf: 0.9620 - root_mean_squared_error: 0.012223264/23347 [============================>.] - ETA: 0s - loss: 1.4707e-04 - fvaf: 0.9619 - root_mean_squared_error: 0.012123347/23347 [==============================] - 1s 60us/sample - loss: 1.4694e-04 - fvaf: 0.9619 - root_mean_squared_error: 0.0121
  32/1570 [..............................] - ETA: 0s - loss: 0.0030 - fvaf: 0.6949 - root_mean_squared_error: 0.0546 864/1570 [===============>..............] - ETA: 0s - loss: 0.0021 - fvaf: 0.6163 - root_mean_squared_error: 0.04591570/1570 [==============================] - 0s 66us/sample - loss: 0.0021 - fvaf: 0.6151 - root_mean_squared_error: 0.0456
  32/1359 [..............................] - ETA: 0s - loss: 0.0014 - fvaf: 0.8253 - root_mean_squared_error: 0.0373 960/1359 [====================>.........] - ETA: 0s - loss: 0.0046 - fvaf: 0.5584 - root_mean_squared_error: 0.06821359/1359 [==============================] - 0s 69us/sample - loss: 0.0039 - fvaf: 0.5865 - root_mean_squared_error: 0.0625
