Total jobs: 120
{'Ntraining': 10, 'rotation': 18}
Params: JI_Ntraining_10_rotation_18
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_10_rotation_18
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
   32/13026 [..............................] - ETA: 5s - loss: 7.1890e-05 - fvaf: 0.9603 - root_mean_squared_error: 0.0085 1696/13026 [==>...........................] - ETA: 0s - loss: 9.9916e-05 - fvaf: 0.9801 - root_mean_squared_error: 0.0100 3392/13026 [======>.......................] - ETA: 0s - loss: 9.9284e-05 - fvaf: 0.9824 - root_mean_squared_error: 0.0100 5088/13026 [==========>...................] - ETA: 0s - loss: 9.8141e-05 - fvaf: 0.9810 - root_mean_squared_error: 0.0099 6752/13026 [==============>...............] - ETA: 0s - loss: 9.7055e-05 - fvaf: 0.9815 - root_mean_squared_error: 0.0099 8320/13026 [==================>...........] - ETA: 0s - loss: 9.6446e-05 - fvaf: 0.9824 - root_mean_squared_error: 0.0098 9920/13026 [=====================>........] - ETA: 0s - loss: 9.8182e-05 - fvaf: 0.9838 - root_mean_squared_error: 0.009911552/13026 [=========================>....] - ETA: 0s - loss: 9.9829e-05 - fvaf: 0.9852 - root_mean_squared_error: 0.010013026/13026 [==============================] - 0s 32us/sample - loss: 1.5495e-04 - fvaf: 0.9835 - root_mean_squared_error: 0.0124
  32/1579 [..............................] - ETA: 0s - loss: 0.0031 - fvaf: 0.8367 - root_mean_squared_error: 0.05531579/1579 [==============================] - 0s 31us/sample - loss: 0.0026 - fvaf: 0.6734 - root_mean_squared_error: 0.0509
  32/1364 [..............................] - ETA: 0s - loss: 0.0027 - fvaf: 0.6917 - root_mean_squared_error: 0.05161364/1364 [==============================] - 0s 32us/sample - loss: 0.0023 - fvaf: 0.6493 - root_mean_squared_error: 0.0482
