Total jobs: 120
{'Ntraining': 3, 'rotation': 9}
Params: JI_Ntraining_3_rotation_9
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_3_rotation_9
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/3668 [..............................] - ETA: 1s - loss: 1.0656e-04 - fvaf: 0.9311 - root_mean_squared_error: 0.0103 640/3668 [====>.........................] - ETA: 0s - loss: 1.6823e-04 - fvaf: 0.9637 - root_mean_squared_error: 0.01301312/3668 [=========>....................] - ETA: 0s - loss: 1.5698e-04 - fvaf: 0.9557 - root_mean_squared_error: 0.01251952/3668 [==============>...............] - ETA: 0s - loss: 1.5680e-04 - fvaf: 0.9547 - root_mean_squared_error: 0.01252528/3668 [===================>..........] - ETA: 0s - loss: 1.6768e-04 - fvaf: 0.9590 - root_mean_squared_error: 0.01293392/3668 [==========================>...] - ETA: 0s - loss: 1.6486e-04 - fvaf: 0.9559 - root_mean_squared_error: 0.01283668/3668 [==============================] - 0s 79us/sample - loss: 1.6367e-04 - fvaf: 0.9552 - root_mean_squared_error: 0.0128
  32/1130 [..............................] - ETA: 0s - loss: 0.0025 - fvaf: 0.6651 - root_mean_squared_error: 0.0503 768/1130 [===================>..........] - ETA: 0s - loss: 0.0131 - fvaf: 0.4424 - root_mean_squared_error: 0.11431130/1130 [==============================] - 0s 73us/sample - loss: 0.0116 - fvaf: 0.4523 - root_mean_squared_error: 0.1077
  32/1247 [..............................] - ETA: 0s - loss: 0.0047 - fvaf: 0.7371 - root_mean_squared_error: 0.0689 736/1247 [================>.............] - ETA: 0s - loss: 0.0029 - fvaf: 0.6630 - root_mean_squared_error: 0.05391247/1247 [==============================] - 0s 79us/sample - loss: 0.0040 - fvaf: 0.5823 - root_mean_squared_error: 0.0629
