Total jobs: 120
{'Ntraining': 1, 'rotation': 2}
Params: JI_Ntraining_1_rotation_2
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_1_rotation_2
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/1531 [..............................] - ETA: 0s - loss: 1.8365e-05 - fvaf: 0.9965 - root_mean_squared_error: 0.00431056/1531 [===================>..........] - ETA: 0s - loss: 1.5917e-05 - fvaf: 0.9973 - root_mean_squared_error: 0.00401531/1531 [==============================] - 0s 64us/sample - loss: 1.6402e-05 - fvaf: 0.9971 - root_mean_squared_error: 0.0040
  32/1193 [..............................] - ETA: 0s - loss: 0.0052 - fvaf: 0.4555 - root_mean_squared_error: 0.07191024/1193 [========================>.....] - ETA: 0s - loss: 0.0037 - fvaf: 0.2685 - root_mean_squared_error: 0.06071193/1193 [==============================] - 0s 68us/sample - loss: 0.0037 - fvaf: 0.2798 - root_mean_squared_error: 0.0604
  32/1104 [..............................] - ETA: 0s - loss: 0.0018 - fvaf: 0.0061 - root_mean_squared_error: 0.0422 928/1104 [========================>.....] - ETA: 0s - loss: 0.0033 - fvaf: 0.2105 - root_mean_squared_error: 0.05731104/1104 [==============================] - 0s 69us/sample - loss: 0.0032 - fvaf: 0.2033 - root_mean_squared_error: 0.0562
