Total jobs: 120
{'Ntraining': 1, 'rotation': 7}
Params: JI_Ntraining_1_rotation_7
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_1_rotation_7
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/1130 [..............................] - ETA: 0s - loss: 1.1728e-04 - fvaf: 0.9743 - root_mean_squared_error: 0.0108 352/1130 [========>.....................] - ETA: 0s - loss: 1.3766e-04 - fvaf: 0.9623 - root_mean_squared_error: 0.0117 800/1130 [====================>.........] - ETA: 0s - loss: 0.0011 - fvaf: 0.9382 - root_mean_squared_error: 0.0337    1130/1130 [==============================] - 0s 119us/sample - loss: 8.5168e-04 - fvaf: 0.9478 - root_mean_squared_error: 0.0292
  32/1252 [..............................] - ETA: 0s - loss: 0.0121 - fvaf: -11.1235 - root_mean_squared_error: 0.1099 672/1252 [===============>..............] - ETA: 0s - loss: 0.0085 - fvaf: 0.0384 - root_mean_squared_error: 0.0924  1252/1252 [==============================] - 0s 81us/sample - loss: 0.0126 - fvaf: 0.1223 - root_mean_squared_error: 0.1123
  32/1375 [..............................] - ETA: 0s - loss: 0.0092 - fvaf: -1.5501 - root_mean_squared_error: 0.0958 832/1375 [=================>............] - ETA: 0s - loss: 0.0093 - fvaf: -0.0672 - root_mean_squared_error: 0.09651375/1375 [==============================] - 0s 73us/sample - loss: 0.0101 - fvaf: 0.1939 - root_mean_squared_error: 0.1005
