Total jobs: 120
{'Ntraining': 18, 'rotation': 4}
Params: JI_Ntraining_18_rotation_4
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_18_rotation_4
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
   32/23480 [..............................] - ETA: 13s - loss: 7.2660e-05 - fvaf: 0.9859 - root_mean_squared_error: 0.0085 1568/23480 [=>............................] - ETA: 0s - loss: 8.4494e-05 - fvaf: 0.9880 - root_mean_squared_error: 0.0092  3136/23480 [===>..........................] - ETA: 0s - loss: 1.0638e-04 - fvaf: 0.9867 - root_mean_squared_error: 0.0103 4672/23480 [====>.........................] - ETA: 0s - loss: 2.4624e-04 - fvaf: 0.9834 - root_mean_squared_error: 0.0157 6240/23480 [======>.......................] - ETA: 0s - loss: 2.0547e-04 - fvaf: 0.9848 - root_mean_squared_error: 0.0143 7808/23480 [========>.....................] - ETA: 0s - loss: 1.7835e-04 - fvaf: 0.9845 - root_mean_squared_error: 0.0134 9344/23480 [==========>...................] - ETA: 0s - loss: 1.6233e-04 - fvaf: 0.9847 - root_mean_squared_error: 0.012710944/23480 [============>.................] - ETA: 0s - loss: 1.4790e-04 - fvaf: 0.9842 - root_mean_squared_error: 0.012212480/23480 [==============>...............] - ETA: 0s - loss: 1.3820e-04 - fvaf: 0.9835 - root_mean_squared_error: 0.011813984/23480 [================>.............] - ETA: 0s - loss: 1.3031e-04 - fvaf: 0.9833 - root_mean_squared_error: 0.011415552/23480 [==================>...........] - ETA: 0s - loss: 1.2533e-04 - fvaf: 0.9835 - root_mean_squared_error: 0.011217056/23480 [====================>.........] - ETA: 0s - loss: 1.2100e-04 - fvaf: 0.9833 - root_mean_squared_error: 0.011018624/23480 [======================>.......] - ETA: 0s - loss: 1.1657e-04 - fvaf: 0.9830 - root_mean_squared_error: 0.010820160/23480 [========================>.....] - ETA: 0s - loss: 1.1265e-04 - fvaf: 0.9827 - root_mean_squared_error: 0.010621728/23480 [==========================>...] - ETA: 0s - loss: 1.1016e-04 - fvaf: 0.9826 - root_mean_squared_error: 0.010523296/23480 [============================>.] - ETA: 0s - loss: 1.0707e-04 - fvaf: 0.9822 - root_mean_squared_error: 0.010323480/23480 [==============================] - 1s 33us/sample - loss: 1.0670e-04 - fvaf: 0.9821 - root_mean_squared_error: 0.0103
  32/1531 [..............................] - ETA: 0s - loss: 0.0042 - fvaf: 0.6008 - root_mean_squared_error: 0.06471531/1531 [==============================] - 0s 34us/sample - loss: 0.0025 - fvaf: 0.6225 - root_mean_squared_error: 0.0504
  32/1265 [..............................] - ETA: 0s - loss: 0.0030 - fvaf: 0.6806 - root_mean_squared_error: 0.05481120/1265 [=========================>....] - ETA: 0s - loss: 0.0036 - fvaf: 0.5242 - root_mean_squared_error: 0.05981265/1265 [==============================] - 0s 46us/sample - loss: 0.0035 - fvaf: 0.5397 - root_mean_squared_error: 0.0593
