Total jobs: 120
{'Ntraining': 1, 'rotation': 10}
Params: JI_Ntraining_1_rotation_10
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_1_rotation_10
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/1265 [..............................] - ETA: 0s - loss: 1.0400e-04 - fvaf: 0.9633 - root_mean_squared_error: 0.0102 768/1265 [=================>............] - ETA: 0s - loss: 9.3982e-05 - fvaf: 0.9627 - root_mean_squared_error: 0.00971265/1265 [==============================] - 0s 74us/sample - loss: 9.7023e-05 - fvaf: 0.9719 - root_mean_squared_error: 0.0099
  32/1247 [..............................] - ETA: 0s - loss: 0.0056 - fvaf: 0.5574 - root_mean_squared_error: 0.0745 928/1247 [=====================>........] - ETA: 0s - loss: 0.0068 - fvaf: 0.2493 - root_mean_squared_error: 0.08261247/1247 [==============================] - 0s 60us/sample - loss: 0.0062 - fvaf: 0.2112 - root_mean_squared_error: 0.0784
  32/1257 [..............................] - ETA: 0s - loss: 0.0065 - fvaf: -0.7772 - root_mean_squared_error: 0.0808 832/1257 [==================>...........] - ETA: 0s - loss: 0.0060 - fvaf: 0.1973 - root_mean_squared_error: 0.0773 1257/1257 [==============================] - 0s 72us/sample - loss: 0.0055 - fvaf: 0.1675 - root_mean_squared_error: 0.0744
