Total jobs: 120
{'Ntraining': 3, 'rotation': 4}
Params: JI_Ntraining_3_rotation_4
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_3_rotation_4
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/4125 [..............................] - ETA: 0s - loss: 1.5875e-04 - fvaf: 0.9804 - root_mean_squared_error: 0.01261728/4125 [===========>..................] - ETA: 0s - loss: 1.5186e-04 - fvaf: 0.9857 - root_mean_squared_error: 0.01233424/4125 [=======================>......] - ETA: 0s - loss: 1.4353e-04 - fvaf: 0.9855 - root_mean_squared_error: 0.01204125/4125 [==============================] - 0s 30us/sample - loss: 1.4364e-04 - fvaf: 0.9860 - root_mean_squared_error: 0.0120
  32/1531 [..............................] - ETA: 0s - loss: 0.0082 - fvaf: 0.3473 - root_mean_squared_error: 0.09061531/1531 [==============================] - 0s 31us/sample - loss: 0.0034 - fvaf: 0.5945 - root_mean_squared_error: 0.0587
  32/1265 [..............................] - ETA: 0s - loss: 0.0036 - fvaf: 0.6137 - root_mean_squared_error: 0.05981265/1265 [==============================] - 0s 31us/sample - loss: 0.0039 - fvaf: 0.5164 - root_mean_squared_error: 0.0627
