Total jobs: 120
{'Ntraining': 10, 'rotation': 7}
Params: JI_Ntraining_10_rotation_7
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_10_rotation_7
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
   32/13016 [..............................] - ETA: 5s - loss: 1.9332e-04 - fvaf: 0.9789 - root_mean_squared_error: 0.0139 1376/13016 [==>...........................] - ETA: 0s - loss: 8.1429e-04 - fvaf: 0.9632 - root_mean_squared_error: 0.0285 2784/13016 [=====>........................] - ETA: 0s - loss: 5.3767e-04 - fvaf: 0.9643 - root_mean_squared_error: 0.0232 4096/13016 [========>.....................] - ETA: 0s - loss: 4.4641e-04 - fvaf: 0.9647 - root_mean_squared_error: 0.0211 5376/13016 [===========>..................] - ETA: 0s - loss: 4.0398e-04 - fvaf: 0.9660 - root_mean_squared_error: 0.0201 6688/13016 [==============>...............] - ETA: 0s - loss: 3.7009e-04 - fvaf: 0.9651 - root_mean_squared_error: 0.0192 8064/13016 [=================>............] - ETA: 0s - loss: 3.4848e-04 - fvaf: 0.9639 - root_mean_squared_error: 0.0187 9472/13016 [====================>.........] - ETA: 0s - loss: 3.2968e-04 - fvaf: 0.9639 - root_mean_squared_error: 0.018210912/13016 [========================>.....] - ETA: 0s - loss: 3.2300e-04 - fvaf: 0.9637 - root_mean_squared_error: 0.018012288/13016 [===========================>..] - ETA: 0s - loss: 3.1251e-04 - fvaf: 0.9648 - root_mean_squared_error: 0.017713016/13016 [==============================] - 0s 38us/sample - loss: 3.0732e-04 - fvaf: 0.9648 - root_mean_squared_error: 0.0175
  32/1252 [..............................] - ETA: 0s - loss: 9.4485e-04 - fvaf: -0.4766 - root_mean_squared_error: 0.03071252/1252 [==============================] - 0s 39us/sample - loss: 0.0051 - fvaf: 0.5698 - root_mean_squared_error: 0.0716
  32/1375 [..............................] - ETA: 0s - loss: 0.0017 - fvaf: 0.3393 - root_mean_squared_error: 0.04141375/1375 [==============================] - 0s 38us/sample - loss: 0.0040 - fvaf: 0.6276 - root_mean_squared_error: 0.0636
