Total jobs: 120
{'Ntraining': 1, 'rotation': 12}
Params: JI_Ntraining_1_rotation_12
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_1_rotation_12
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/1225 [..............................] - ETA: 0s - loss: 6.1564e-05 - fvaf: 0.9834 - root_mean_squared_error: 0.0078 928/1225 [=====================>........] - ETA: 0s - loss: 6.0267e-05 - fvaf: 0.9884 - root_mean_squared_error: 0.00781225/1225 [==============================] - 0s 61us/sample - loss: 8.2693e-05 - fvaf: 0.9758 - root_mean_squared_error: 0.0091
  32/1265 [..............................] - ETA: 0s - loss: 0.0043 - fvaf: 0.6317 - root_mean_squared_error: 0.0652 608/1265 [=============>................] - ETA: 0s - loss: 0.0048 - fvaf: 0.4883 - root_mean_squared_error: 0.06911265/1265 [==============================] - 0s 79us/sample - loss: 0.0061 - fvaf: 0.4232 - root_mean_squared_error: 0.0783
  32/1146 [..............................] - ETA: 0s - loss: 0.0029 - fvaf: -2.2226 - root_mean_squared_error: 0.0536 992/1146 [========================>.....] - ETA: 0s - loss: 0.0049 - fvaf: 0.4284 - root_mean_squared_error: 0.0698 1146/1146 [==============================] - 0s 60us/sample - loss: 0.0046 - fvaf: 0.4253 - root_mean_squared_error: 0.0679
