Total jobs: 120
{'Ntraining': 10, 'rotation': 14}
Params: JI_Ntraining_10_rotation_14
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_10_rotation_14
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
   32/13643 [..............................] - ETA: 5s - loss: 2.2156e-04 - fvaf: 0.9670 - root_mean_squared_error: 0.0149 1760/13643 [==>...........................] - ETA: 0s - loss: 1.1773e-04 - fvaf: 0.9430 - root_mean_squared_error: 0.0109 3552/13643 [======>.......................] - ETA: 0s - loss: 1.2789e-04 - fvaf: 0.9528 - root_mean_squared_error: 0.0113 5344/13643 [==========>...................] - ETA: 0s - loss: 1.2301e-04 - fvaf: 0.9516 - root_mean_squared_error: 0.0111 7136/13643 [==============>...............] - ETA: 0s - loss: 1.1973e-04 - fvaf: 0.9486 - root_mean_squared_error: 0.0109 8928/13643 [==================>...........] - ETA: 0s - loss: 1.2077e-04 - fvaf: 0.9474 - root_mean_squared_error: 0.011010720/13643 [======================>.......] - ETA: 0s - loss: 1.1993e-04 - fvaf: 0.9449 - root_mean_squared_error: 0.011012480/13643 [==========================>...] - ETA: 0s - loss: 1.1946e-04 - fvaf: 0.9448 - root_mean_squared_error: 0.010913643/13643 [==============================] - 0s 29us/sample - loss: 1.2049e-04 - fvaf: 0.9451 - root_mean_squared_error: 0.0110
  32/1225 [..............................] - ETA: 0s - loss: 0.0013 - fvaf: 0.6348 - root_mean_squared_error: 0.03621225/1225 [==============================] - 0s 31us/sample - loss: 0.0025 - fvaf: 0.5343 - root_mean_squared_error: 0.0503
  32/1238 [..............................] - ETA: 0s - loss: 0.0013 - fvaf: 0.3855 - root_mean_squared_error: 0.03591238/1238 [==============================] - 0s 32us/sample - loss: 0.0020 - fvaf: 0.5735 - root_mean_squared_error: 0.0452
