Total jobs: 120
{'Ntraining': 5, 'rotation': 3}
Params: JI_Ntraining_5_rotation_3
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_5_rotation_3
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/6520 [..............................] - ETA: 2s - loss: 1.9914e-04 - fvaf: 0.9711 - root_mean_squared_error: 0.0141 864/6520 [==>...........................] - ETA: 0s - loss: 2.2719e-04 - fvaf: 0.9673 - root_mean_squared_error: 0.01511728/6520 [======>.......................] - ETA: 0s - loss: 2.3034e-04 - fvaf: 0.9715 - root_mean_squared_error: 0.01522624/6520 [===========>..................] - ETA: 0s - loss: 2.4909e-04 - fvaf: 0.9757 - root_mean_squared_error: 0.01583520/6520 [===============>..............] - ETA: 0s - loss: 2.4576e-04 - fvaf: 0.9748 - root_mean_squared_error: 0.01574384/6520 [===================>..........] - ETA: 0s - loss: 2.5403e-04 - fvaf: 0.9750 - root_mean_squared_error: 0.01595280/6520 [=======================>......] - ETA: 0s - loss: 2.5871e-04 - fvaf: 0.9756 - root_mean_squared_error: 0.01616176/6520 [===========================>..] - ETA: 0s - loss: 3.7363e-04 - fvaf: 0.9731 - root_mean_squared_error: 0.01936520/6520 [==============================] - 0s 60us/sample - loss: 3.6748e-04 - fvaf: 0.9740 - root_mean_squared_error: 0.0192
  32/1104 [..............................] - ETA: 0s - loss: 0.0025 - fvaf: 0.0153 - root_mean_squared_error: 0.0500 896/1104 [=======================>......] - ETA: 0s - loss: 0.0029 - fvaf: 0.5517 - root_mean_squared_error: 0.05361104/1104 [==============================] - 0s 63us/sample - loss: 0.0030 - fvaf: 0.5247 - root_mean_squared_error: 0.0547
  32/1531 [..............................] - ETA: 0s - loss: 0.0064 - fvaf: 0.5179 - root_mean_squared_error: 0.0797 992/1531 [==================>...........] - ETA: 0s - loss: 0.0032 - fvaf: 0.6504 - root_mean_squared_error: 0.05661531/1531 [==============================] - 0s 54us/sample - loss: 0.0030 - fvaf: 0.6175 - root_mean_squared_error: 0.0547
