Total jobs: 120
{'Ntraining': 2, 'rotation': 0}
Params: JI_Ntraining_2_rotation_0
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_2_rotation_0
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/2297 [..............................] - ETA: 1s - loss: 2.5725e-04 - fvaf: 0.9776 - root_mean_squared_error: 0.01601632/2297 [====================>.........] - ETA: 0s - loss: 1.6646e-04 - fvaf: 0.9580 - root_mean_squared_error: 0.01292297/2297 [==============================] - 0s 38us/sample - loss: 1.6899e-04 - fvaf: 0.9581 - root_mean_squared_error: 0.0130
  32/1389 [..............................] - ETA: 0s - loss: 0.0016 - fvaf: 0.2436 - root_mean_squared_error: 0.04041389/1389 [==============================] - 0s 48us/sample - loss: 0.0025 - fvaf: 0.5228 - root_mean_squared_error: 0.0500
  32/1289 [..............................] - ETA: 1s - loss: 0.0050 - fvaf: 0.5992 - root_mean_squared_error: 0.07051289/1289 [==============================] - 0s 57us/sample - loss: 0.0047 - fvaf: 0.4360 - root_mean_squared_error: 0.0683
