Total jobs: 120
{'Ntraining': 3, 'rotation': 6}
Params: JI_Ntraining_3_rotation_6
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_3_rotation_6
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/3752 [..............................] - ETA: 4s - loss: 2.0951e-04 - fvaf: 0.8230 - root_mean_squared_error: 0.0145 256/3752 [=>............................] - ETA: 1s - loss: 2.0693e-04 - fvaf: 0.9126 - root_mean_squared_error: 0.0144 672/3752 [====>.........................] - ETA: 0s - loss: 2.5588e-04 - fvaf: 0.9231 - root_mean_squared_error: 0.01601024/3752 [=======>......................] - ETA: 0s - loss: 3.1315e-04 - fvaf: 0.9461 - root_mean_squared_error: 0.01771376/3752 [==========>...................] - ETA: 0s - loss: 3.0669e-04 - fvaf: 0.9418 - root_mean_squared_error: 0.01751632/3752 [============>.................] - ETA: 0s - loss: 3.0556e-04 - fvaf: 0.9383 - root_mean_squared_error: 0.01751824/3752 [=============>................] - ETA: 0s - loss: 3.0121e-04 - fvaf: 0.9386 - root_mean_squared_error: 0.01742112/3752 [===============>..............] - ETA: 0s - loss: 6.5881e-04 - fvaf: 0.9362 - root_mean_squared_error: 0.02572368/3752 [=================>............] - ETA: 0s - loss: 6.4241e-04 - fvaf: 0.9399 - root_mean_squared_error: 0.02532464/3752 [==================>...........] - ETA: 0s - loss: 6.2757e-04 - fvaf: 0.9402 - root_mean_squared_error: 0.02512592/3752 [===================>..........] - ETA: 0s - loss: 6.1320e-04 - fvaf: 0.9403 - root_mean_squared_error: 0.02482784/3752 [=====================>........] - ETA: 0s - loss: 5.9172e-04 - fvaf: 0.9389 - root_mean_squared_error: 0.02432912/3752 [======================>.......] - ETA: 0s - loss: 5.7524e-04 - fvaf: 0.9386 - root_mean_squared_error: 0.02403104/3752 [=======================>......] - ETA: 0s - loss: 5.5585e-04 - fvaf: 0.9378 - root_mean_squared_error: 0.02363392/3752 [==========================>...] - ETA: 0s - loss: 5.3908e-04 - fvaf: 0.9411 - root_mean_squared_error: 0.02323520/3752 [===========================>..] - ETA: 0s - loss: 5.2752e-04 - fvaf: 0.9411 - root_mean_squared_error: 0.02303752/3752 [==============================] - 1s 254us/sample - loss: 5.0806e-04 - fvaf: 0.9403 - root_mean_squared_error: 0.0225
  32/1498 [..............................] - ETA: 1s - loss: 0.0036 - fvaf: 0.7601 - root_mean_squared_error: 0.0603 224/1498 [===>..........................] - ETA: 0s - loss: 0.0035 - fvaf: 0.5841 - root_mean_squared_error: 0.0594 416/1498 [=======>......................] - ETA: 0s - loss: 0.0053 - fvaf: 0.4269 - root_mean_squared_error: 0.0726 576/1498 [==========>...................] - ETA: 0s - loss: 0.0048 - fvaf: 0.5086 - root_mean_squared_error: 0.0695 768/1498 [==============>...............] - ETA: 0s - loss: 0.0085 - fvaf: 0.4342 - root_mean_squared_error: 0.0921 928/1498 [=================>............] - ETA: 0s - loss: 0.0078 - fvaf: 0.4848 - root_mean_squared_error: 0.08851120/1498 [=====================>........] - ETA: 0s - loss: 0.0073 - fvaf: 0.5264 - root_mean_squared_error: 0.08551280/1498 [========================>.....] - ETA: 0s - loss: 0.0068 - fvaf: 0.5397 - root_mean_squared_error: 0.08241498/1498 [==============================] - 0s 332us/sample - loss: 0.0063 - fvaf: 0.5495 - root_mean_squared_error: 0.0791
  32/1252 [..............................] - ETA: 1s - loss: 0.0030 - fvaf: -3.8151 - root_mean_squared_error: 0.0544 192/1252 [===>..........................] - ETA: 0s - loss: 0.0035 - fvaf: 0.5836 - root_mean_squared_error: 0.0595  320/1252 [======>.......................] - ETA: 0s - loss: 0.0035 - fvaf: 0.6347 - root_mean_squared_error: 0.0590 448/1252 [=========>....................] - ETA: 0s - loss: 0.0033 - fvaf: 0.6225 - root_mean_squared_error: 0.0575 608/1252 [=============>................] - ETA: 0s - loss: 0.0030 - fvaf: 0.6427 - root_mean_squared_error: 0.0552 768/1252 [=================>............] - ETA: 0s - loss: 0.0050 - fvaf: 0.6170 - root_mean_squared_error: 0.0705 928/1252 [=====================>........] - ETA: 0s - loss: 0.0072 - fvaf: 0.4710 - root_mean_squared_error: 0.08481056/1252 [========================>.....] - ETA: 0s - loss: 0.0072 - fvaf: 0.5035 - root_mean_squared_error: 0.08501216/1252 [============================>.] - ETA: 0s - loss: 0.0067 - fvaf: 0.5108 - root_mean_squared_error: 0.08161252/1252 [==============================] - 1s 410us/sample - loss: 0.0066 - fvaf: 0.5106 - root_mean_squared_error: 0.0809
