Total jobs: 120
{'Ntraining': 1, 'rotation': 14}
Params: JI_Ntraining_1_rotation_14
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_1_rotation_14
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/1570 [..............................] - ETA: 0s - loss: 9.6049e-04 - fvaf: 0.7379 - root_mean_squared_error: 0.03101376/1570 [=========================>....] - ETA: 0s - loss: 3.9836e-04 - fvaf: 0.7869 - root_mean_squared_error: 0.02001570/1570 [==============================] - 0s 40us/sample - loss: 3.9151e-04 - fvaf: 0.7913 - root_mean_squared_error: 0.0198
  32/1225 [..............................] - ETA: 0s - loss: 0.0044 - fvaf: -0.5254 - root_mean_squared_error: 0.06641225/1225 [==============================] - 0s 40us/sample - loss: 0.0048 - fvaf: -0.1577 - root_mean_squared_error: 0.0695
  32/1238 [..............................] - ETA: 0s - loss: 0.0042 - fvaf: -0.2485 - root_mean_squared_error: 0.06451238/1238 [==============================] - 0s 44us/sample - loss: 0.0041 - fvaf: -0.1115 - root_mean_squared_error: 0.0643
