Total jobs: 120
{'Ntraining': 2, 'rotation': 9}
Params: JI_Ntraining_2_rotation_9
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_2_rotation_9
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/2522 [..............................] - ETA: 1s - loss: 1.0313e-04 - fvaf: 0.9708 - root_mean_squared_error: 0.0102 800/2522 [========>.....................] - ETA: 0s - loss: 1.7563e-04 - fvaf: 0.9798 - root_mean_squared_error: 0.01331760/2522 [===================>..........] - ETA: 0s - loss: 1.5118e-04 - fvaf: 0.9821 - root_mean_squared_error: 0.01232464/2522 [============================>.] - ETA: 0s - loss: 1.5451e-04 - fvaf: 0.9832 - root_mean_squared_error: 0.01242522/2522 [==============================] - 0s 68us/sample - loss: 1.5361e-04 - fvaf: 0.9832 - root_mean_squared_error: 0.0124
  32/1130 [..............................] - ETA: 1s - loss: 0.0020 - fvaf: 0.7831 - root_mean_squared_error: 0.04431056/1130 [===========================>..] - ETA: 0s - loss: 0.0127 - fvaf: 0.4154 - root_mean_squared_error: 0.11251130/1130 [==============================] - 0s 76us/sample - loss: 0.0121 - fvaf: 0.4200 - root_mean_squared_error: 0.1099
  32/1247 [..............................] - ETA: 0s - loss: 0.0035 - fvaf: 0.8417 - root_mean_squared_error: 0.05931152/1247 [==========================>...] - ETA: 0s - loss: 0.0043 - fvaf: 0.5987 - root_mean_squared_error: 0.06561247/1247 [==============================] - 0s 50us/sample - loss: 0.0041 - fvaf: 0.5937 - root_mean_squared_error: 0.0641
