Total jobs: 120
{'Ntraining': 5, 'rotation': 16}
Params: JI_Ntraining_5_rotation_16
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_5_rotation_16
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/6814 [..............................] - ETA: 2s - loss: 2.0746e-04 - fvaf: 0.9769 - root_mean_squared_error: 0.01441376/6814 [=====>........................] - ETA: 0s - loss: 7.5768e-05 - fvaf: 0.9818 - root_mean_squared_error: 0.00872848/6814 [===========>..................] - ETA: 0s - loss: 7.5316e-05 - fvaf: 0.9803 - root_mean_squared_error: 0.00874416/6814 [==================>...........] - ETA: 0s - loss: 7.3511e-05 - fvaf: 0.9801 - root_mean_squared_error: 0.00866016/6814 [=========================>....] - ETA: 0s - loss: 7.4486e-05 - fvaf: 0.9801 - root_mean_squared_error: 0.00866814/6814 [==============================] - 0s 35us/sample - loss: 7.3293e-05 - fvaf: 0.9799 - root_mean_squared_error: 0.0086
  32/1570 [..............................] - ETA: 0s - loss: 0.0052 - fvaf: 0.7280 - root_mean_squared_error: 0.07241472/1570 [===========================>..] - ETA: 0s - loss: 0.0020 - fvaf: 0.6801 - root_mean_squared_error: 0.04521570/1570 [==============================] - 0s 37us/sample - loss: 0.0021 - fvaf: 0.6748 - root_mean_squared_error: 0.0456
  32/1359 [..............................] - ETA: 0s - loss: 0.0014 - fvaf: 0.8165 - root_mean_squared_error: 0.03801359/1359 [==============================] - 0s 36us/sample - loss: 0.0042 - fvaf: 0.5911 - root_mean_squared_error: 0.0650
