Total jobs: 120
{'Ntraining': 18, 'rotation': 3}
Params: JI_Ntraining_18_rotation_3
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_18_rotation_3
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
   32/23641 [..............................] - ETA: 23s - loss: 7.1113e-05 - fvaf: 0.9886 - root_mean_squared_error: 0.0084  704/23641 [..............................] - ETA: 2s - loss: 9.6453e-05 - fvaf: 0.9778 - root_mean_squared_error: 0.0098  1248/23641 [>.............................] - ETA: 2s - loss: 8.7370e-05 - fvaf: 0.9804 - root_mean_squared_error: 0.0093 1760/23641 [=>............................] - ETA: 2s - loss: 9.1391e-05 - fvaf: 0.9815 - root_mean_squared_error: 0.0096 2080/23641 [=>............................] - ETA: 2s - loss: 5.8613e-04 - fvaf: 0.9010 - root_mean_squared_error: 0.0242 2464/23641 [==>...........................] - ETA: 2s - loss: 5.0946e-04 - fvaf: 0.9200 - root_mean_squared_error: 0.0226 2816/23641 [==>...........................] - ETA: 2s - loss: 4.5498e-04 - fvaf: 0.9257 - root_mean_squared_error: 0.0213 3360/23641 [===>..........................] - ETA: 2s - loss: 3.9427e-04 - fvaf: 0.9325 - root_mean_squared_error: 0.0199 3840/23641 [===>..........................] - ETA: 2s - loss: 3.8597e-04 - fvaf: 0.9413 - root_mean_squared_error: 0.0196 4512/23641 [====>.........................] - ETA: 2s - loss: 3.3909e-04 - fvaf: 0.9444 - root_mean_squared_error: 0.0184 4928/23641 [=====>........................] - ETA: 2s - loss: 3.1828e-04 - fvaf: 0.9468 - root_mean_squared_error: 0.0178 5344/23641 [=====>........................] - ETA: 2s - loss: 3.0446e-04 - fvaf: 0.9519 - root_mean_squared_error: 0.0174 5824/23641 [======>.......................] - ETA: 2s - loss: 2.8574e-04 - fvaf: 0.9538 - root_mean_squared_error: 0.0169 6336/23641 [=======>......................] - ETA: 1s - loss: 3.9075e-04 - fvaf: 0.9555 - root_mean_squared_error: 0.0198 6880/23641 [=======>......................] - ETA: 1s - loss: 3.6635e-04 - fvaf: 0.9570 - root_mean_squared_error: 0.0191 7168/23641 [========>.....................] - ETA: 1s - loss: 3.5447e-04 - fvaf: 0.9575 - root_mean_squared_error: 0.0188 7616/23641 [========>.....................] - ETA: 1s - loss: 3.3979e-04 - fvaf: 0.9599 - root_mean_squared_error: 0.0184 8256/23641 [=========>....................] - ETA: 1s - loss: 3.2044e-04 - fvaf: 0.9613 - root_mean_squared_error: 0.0179 9152/23641 [==========>...................] - ETA: 1s - loss: 2.9687e-04 - fvaf: 0.9625 - root_mean_squared_error: 0.0172 9888/23641 [===========>..................] - ETA: 1s - loss: 2.8245e-04 - fvaf: 0.9643 - root_mean_squared_error: 0.016810528/23641 [============>.................] - ETA: 1s - loss: 2.7039e-04 - fvaf: 0.9656 - root_mean_squared_error: 0.016411104/23641 [=============>................] - ETA: 1s - loss: 2.6009e-04 - fvaf: 0.9660 - root_mean_squared_error: 0.016111648/23641 [=============>................] - ETA: 1s - loss: 2.5133e-04 - fvaf: 0.9662 - root_mean_squared_error: 0.015912224/23641 [==============>...............] - ETA: 1s - loss: 2.4303e-04 - fvaf: 0.9665 - root_mean_squared_error: 0.015613024/23641 [===============>..............] - ETA: 1s - loss: 2.3492e-04 - fvaf: 0.9665 - root_mean_squared_error: 0.015313600/23641 [================>.............] - ETA: 0s - loss: 2.2819e-04 - fvaf: 0.9666 - root_mean_squared_error: 0.015113856/23641 [================>.............] - ETA: 0s - loss: 2.2569e-04 - fvaf: 0.9668 - root_mean_squared_error: 0.015014304/23641 [=================>............] - ETA: 0s - loss: 2.2097e-04 - fvaf: 0.9673 - root_mean_squared_error: 0.014914656/23641 [=================>............] - ETA: 0s - loss: 2.1732e-04 - fvaf: 0.9673 - root_mean_squared_error: 0.014715232/23641 [==================>...........] - ETA: 0s - loss: 2.1176e-04 - fvaf: 0.9676 - root_mean_squared_error: 0.014615808/23641 [===================>..........] - ETA: 0s - loss: 2.0906e-04 - fvaf: 0.9680 - root_mean_squared_error: 0.014516288/23641 [===================>..........] - ETA: 0s - loss: 2.0533e-04 - fvaf: 0.9686 - root_mean_squared_error: 0.014316832/23641 [====================>.........] - ETA: 0s - loss: 2.0111e-04 - fvaf: 0.9691 - root_mean_squared_error: 0.014217280/23641 [====================>.........] - ETA: 0s - loss: 1.9778e-04 - fvaf: 0.9694 - root_mean_squared_error: 0.014117568/23641 [=====================>........] - ETA: 0s - loss: 1.9608e-04 - fvaf: 0.9696 - root_mean_squared_error: 0.014018272/23641 [======================>.......] - ETA: 0s - loss: 1.9189e-04 - fvaf: 0.9697 - root_mean_squared_error: 0.013918816/23641 [======================>.......] - ETA: 0s - loss: 1.8862e-04 - fvaf: 0.9699 - root_mean_squared_error: 0.013719296/23641 [=======================>......] - ETA: 0s - loss: 1.8605e-04 - fvaf: 0.9700 - root_mean_squared_error: 0.013619744/23641 [========================>.....] - ETA: 0s - loss: 1.8371e-04 - fvaf: 0.9700 - root_mean_squared_error: 0.013620224/23641 [========================>.....] - ETA: 0s - loss: 1.8110e-04 - fvaf: 0.9702 - root_mean_squared_error: 0.013520672/23641 [=========================>....] - ETA: 0s - loss: 1.7876e-04 - fvaf: 0.9702 - root_mean_squared_error: 0.013421152/23641 [=========================>....] - ETA: 0s - loss: 1.7659e-04 - fvaf: 0.9703 - root_mean_squared_error: 0.013321696/23641 [==========================>...] - ETA: 0s - loss: 1.7496e-04 - fvaf: 0.9705 - root_mean_squared_error: 0.013222336/23641 [===========================>..] - ETA: 0s - loss: 1.7201e-04 - fvaf: 0.9707 - root_mean_squared_error: 0.013122848/23641 [===========================>..] - ETA: 0s - loss: 1.6998e-04 - fvaf: 0.9708 - root_mean_squared_error: 0.013023424/23641 [============================>.] - ETA: 0s - loss: 1.6774e-04 - fvaf: 0.9708 - root_mean_squared_error: 0.013023641/23641 [==============================] - 2s 101us/sample - loss: 1.6687e-04 - fvaf: 0.9708 - root_mean_squared_error: 0.0129
  32/1104 [..............................] - ETA: 0s - loss: 0.0021 - fvaf: 0.2167 - root_mean_squared_error: 0.0463 608/1104 [===============>..............] - ETA: 0s - loss: 0.0022 - fvaf: 0.5644 - root_mean_squared_error: 0.04721056/1104 [===========================>..] - ETA: 0s - loss: 0.0023 - fvaf: 0.5676 - root_mean_squared_error: 0.04761104/1104 [==============================] - 0s 118us/sample - loss: 0.0023 - fvaf: 0.5620 - root_mean_squared_error: 0.0476
  32/1531 [..............................] - ETA: 0s - loss: 0.0037 - fvaf: 0.6632 - root_mean_squared_error: 0.0606 448/1531 [=======>......................] - ETA: 0s - loss: 0.0028 - fvaf: 0.6943 - root_mean_squared_error: 0.0528 896/1531 [================>.............] - ETA: 0s - loss: 0.0026 - fvaf: 0.6791 - root_mean_squared_error: 0.05071440/1531 [===========================>..] - ETA: 0s - loss: 0.0025 - fvaf: 0.6565 - root_mean_squared_error: 0.04971531/1531 [==============================] - 0s 133us/sample - loss: 0.0025 - fvaf: 0.6436 - root_mean_squared_error: 0.0501
