Total jobs: 120
{'Ntraining': 18, 'rotation': 17}
Params: JI_Ntraining_18_rotation_17
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_18_rotation_17
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
   32/23338 [..............................] - ETA: 23s - loss: 1.3736e-04 - fvaf: 0.9831 - root_mean_squared_error: 0.0117  896/23338 [>.............................] - ETA: 2s - loss: 8.3076e-05 - fvaf: 0.9811 - root_mean_squared_error: 0.0091  1792/23338 [=>............................] - ETA: 1s - loss: 7.5388e-05 - fvaf: 0.9801 - root_mean_squared_error: 0.0087 2624/23338 [==>...........................] - ETA: 1s - loss: 7.3711e-05 - fvaf: 0.9793 - root_mean_squared_error: 0.0086 3456/23338 [===>..........................] - ETA: 1s - loss: 8.9926e-05 - fvaf: 0.9784 - root_mean_squared_error: 0.0095 4320/23338 [====>.........................] - ETA: 1s - loss: 8.5599e-05 - fvaf: 0.9786 - root_mean_squared_error: 0.0093 5216/23338 [=====>........................] - ETA: 1s - loss: 8.2699e-05 - fvaf: 0.9785 - root_mean_squared_error: 0.0091 6048/23338 [======>.......................] - ETA: 1s - loss: 8.1026e-05 - fvaf: 0.9786 - root_mean_squared_error: 0.0090 6944/23338 [=======>......................] - ETA: 1s - loss: 8.0168e-05 - fvaf: 0.9786 - root_mean_squared_error: 0.0090 7808/23338 [=========>....................] - ETA: 0s - loss: 7.9234e-05 - fvaf: 0.9790 - root_mean_squared_error: 0.0089 8736/23338 [==========>...................] - ETA: 0s - loss: 8.0626e-05 - fvaf: 0.9792 - root_mean_squared_error: 0.0090 9600/23338 [===========>..................] - ETA: 0s - loss: 8.1761e-05 - fvaf: 0.9801 - root_mean_squared_error: 0.009010400/23338 [============>.................] - ETA: 0s - loss: 8.6327e-05 - fvaf: 0.9812 - root_mean_squared_error: 0.009311232/23338 [=============>................] - ETA: 0s - loss: 8.5373e-05 - fvaf: 0.9815 - root_mean_squared_error: 0.009212128/23338 [==============>...............] - ETA: 0s - loss: 8.9635e-05 - fvaf: 0.9825 - root_mean_squared_error: 0.009513024/23338 [===============>..............] - ETA: 0s - loss: 9.0009e-05 - fvaf: 0.9833 - root_mean_squared_error: 0.009513952/23338 [================>.............] - ETA: 0s - loss: 1.4125e-04 - fvaf: 0.9820 - root_mean_squared_error: 0.011914912/23338 [==================>...........] - ETA: 0s - loss: 1.3900e-04 - fvaf: 0.9823 - root_mean_squared_error: 0.011815904/23338 [===================>..........] - ETA: 0s - loss: 1.3685e-04 - fvaf: 0.9821 - root_mean_squared_error: 0.011716800/23338 [====================>.........] - ETA: 0s - loss: 1.3343e-04 - fvaf: 0.9821 - root_mean_squared_error: 0.011617760/23338 [=====================>........] - ETA: 0s - loss: 1.3193e-04 - fvaf: 0.9824 - root_mean_squared_error: 0.011518688/23338 [=======================>......] - ETA: 0s - loss: 1.2948e-04 - fvaf: 0.9827 - root_mean_squared_error: 0.011419616/23338 [========================>.....] - ETA: 0s - loss: 1.2655e-04 - fvaf: 0.9826 - root_mean_squared_error: 0.011220576/23338 [=========================>....] - ETA: 0s - loss: 1.2428e-04 - fvaf: 0.9825 - root_mean_squared_error: 0.011121536/23338 [==========================>...] - ETA: 0s - loss: 1.2166e-04 - fvaf: 0.9823 - root_mean_squared_error: 0.011022496/23338 [===========================>..] - ETA: 0s - loss: 1.1984e-04 - fvaf: 0.9823 - root_mean_squared_error: 0.010923338/23338 [==============================] - 1s 58us/sample - loss: 1.1813e-04 - fvaf: 0.9822 - root_mean_squared_error: 0.0109
  32/1359 [..............................] - ETA: 0s - loss: 0.0019 - fvaf: 0.8524 - root_mean_squared_error: 0.0436 896/1359 [==================>...........] - ETA: 0s - loss: 0.0051 - fvaf: 0.5355 - root_mean_squared_error: 0.07121359/1359 [==============================] - 0s 64us/sample - loss: 0.0041 - fvaf: 0.5966 - root_mean_squared_error: 0.0639
  32/1579 [..............................] - ETA: 0s - loss: 0.0048 - fvaf: 0.7713 - root_mean_squared_error: 0.0695 480/1579 [========>.....................] - ETA: 0s - loss: 0.0022 - fvaf: 0.7347 - root_mean_squared_error: 0.04711312/1579 [=======================>......] - ETA: 0s - loss: 0.0027 - fvaf: 0.6768 - root_mean_squared_error: 0.05241579/1579 [==============================] - 0s 79us/sample - loss: 0.0026 - fvaf: 0.6532 - root_mean_squared_error: 0.0509
