Total jobs: 120
{'Ntraining': 10, 'rotation': 17}
Params: JI_Ntraining_10_rotation_17
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_10_rotation_17
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
   32/13260 [..............................] - ETA: 4s - loss: 4.8221e-05 - fvaf: 0.9933 - root_mean_squared_error: 0.0069 1344/13260 [==>...........................] - ETA: 0s - loss: 5.8568e-05 - fvaf: 0.9870 - root_mean_squared_error: 0.0077 2752/13260 [=====>........................] - ETA: 0s - loss: 5.8916e-05 - fvaf: 0.9863 - root_mean_squared_error: 0.0077 4128/13260 [========>.....................] - ETA: 0s - loss: 6.3532e-05 - fvaf: 0.9857 - root_mean_squared_error: 0.0080 5440/13260 [===========>..................] - ETA: 0s - loss: 6.2249e-05 - fvaf: 0.9856 - root_mean_squared_error: 0.0079 6784/13260 [==============>...............] - ETA: 0s - loss: 6.1122e-05 - fvaf: 0.9856 - root_mean_squared_error: 0.0078 8064/13260 [=================>............] - ETA: 0s - loss: 6.0332e-05 - fvaf: 0.9858 - root_mean_squared_error: 0.0078 9440/13260 [====================>.........] - ETA: 0s - loss: 6.1607e-05 - fvaf: 0.9860 - root_mean_squared_error: 0.007810752/13260 [=======================>......] - ETA: 0s - loss: 6.3559e-05 - fvaf: 0.9872 - root_mean_squared_error: 0.008012032/13260 [==========================>...] - ETA: 0s - loss: 6.7486e-05 - fvaf: 0.9870 - root_mean_squared_error: 0.008213260/13260 [==============================] - 1s 39us/sample - loss: 6.7824e-05 - fvaf: 0.9872 - root_mean_squared_error: 0.0082
  32/1359 [..............................] - ETA: 0s - loss: 0.0015 - fvaf: 0.8299 - root_mean_squared_error: 0.03871359/1359 [==============================] - 0s 38us/sample - loss: 0.0040 - fvaf: 0.6183 - root_mean_squared_error: 0.0635
  32/1579 [..............................] - ETA: 0s - loss: 0.0037 - fvaf: 0.7671 - root_mean_squared_error: 0.06121579/1579 [==============================] - 0s 33us/sample - loss: 0.0024 - fvaf: 0.6730 - root_mean_squared_error: 0.0493
