Total jobs: 120
{'Ntraining': 18, 'rotation': 13}
Params: JI_Ntraining_18_rotation_13
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_18_rotation_13
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
   32/23905 [..............................] - ETA: 21s - loss: 8.9074e-05 - fvaf: 0.9202 - root_mean_squared_error: 0.0094 1088/23905 [>.............................] - ETA: 1s - loss: 1.0568e-04 - fvaf: 0.9386 - root_mean_squared_error: 0.0103  2112/23905 [=>............................] - ETA: 1s - loss: 1.0768e-04 - fvaf: 0.9493 - root_mean_squared_error: 0.0104 3136/23905 [==>...........................] - ETA: 1s - loss: 1.1031e-04 - fvaf: 0.9517 - root_mean_squared_error: 0.0105 4160/23905 [====>.........................] - ETA: 1s - loss: 1.1643e-04 - fvaf: 0.9585 - root_mean_squared_error: 0.0108 5184/23905 [=====>........................] - ETA: 1s - loss: 1.1597e-04 - fvaf: 0.9590 - root_mean_squared_error: 0.0108 6272/23905 [======>.......................] - ETA: 0s - loss: 1.1595e-04 - fvaf: 0.9569 - root_mean_squared_error: 0.0108 7360/23905 [========>.....................] - ETA: 0s - loss: 1.1562e-04 - fvaf: 0.9553 - root_mean_squared_error: 0.0108 8480/23905 [=========>....................] - ETA: 0s - loss: 1.1487e-04 - fvaf: 0.9543 - root_mean_squared_error: 0.0107 9504/23905 [==========>...................] - ETA: 0s - loss: 1.1857e-04 - fvaf: 0.9540 - root_mean_squared_error: 0.010910592/23905 [============>.................] - ETA: 0s - loss: 1.1749e-04 - fvaf: 0.9542 - root_mean_squared_error: 0.010811488/23905 [=============>................] - ETA: 0s - loss: 1.1653e-04 - fvaf: 0.9534 - root_mean_squared_error: 0.010812416/23905 [==============>...............] - ETA: 0s - loss: 1.1578e-04 - fvaf: 0.9539 - root_mean_squared_error: 0.010813376/23905 [===============>..............] - ETA: 0s - loss: 1.1492e-04 - fvaf: 0.9538 - root_mean_squared_error: 0.010714240/23905 [================>.............] - ETA: 0s - loss: 1.1510e-04 - fvaf: 0.9542 - root_mean_squared_error: 0.010715136/23905 [=================>............] - ETA: 0s - loss: 1.1543e-04 - fvaf: 0.9551 - root_mean_squared_error: 0.010716064/23905 [===================>..........] - ETA: 0s - loss: 1.1807e-04 - fvaf: 0.9584 - root_mean_squared_error: 0.010917056/23905 [====================>.........] - ETA: 0s - loss: 1.1765e-04 - fvaf: 0.9586 - root_mean_squared_error: 0.010817920/23905 [=====================>........] - ETA: 0s - loss: 1.2125e-04 - fvaf: 0.9592 - root_mean_squared_error: 0.011018880/23905 [======================>.......] - ETA: 0s - loss: 1.2418e-04 - fvaf: 0.9605 - root_mean_squared_error: 0.011119872/23905 [=======================>......] - ETA: 0s - loss: 1.8395e-04 - fvaf: 0.9509 - root_mean_squared_error: 0.013620768/23905 [=========================>....] - ETA: 0s - loss: 1.8054e-04 - fvaf: 0.9517 - root_mean_squared_error: 0.013421824/23905 [==========================>...] - ETA: 0s - loss: 1.7823e-04 - fvaf: 0.9533 - root_mean_squared_error: 0.013422720/23905 [===========================>..] - ETA: 0s - loss: 1.7538e-04 - fvaf: 0.9536 - root_mean_squared_error: 0.013223744/23905 [============================>.] - ETA: 0s - loss: 1.7326e-04 - fvaf: 0.9548 - root_mean_squared_error: 0.013223905/23905 [==============================] - 1s 53us/sample - loss: 1.7284e-04 - fvaf: 0.9549 - root_mean_squared_error: 0.0131
  32/1146 [..............................] - ETA: 0s - loss: 0.0028 - fvaf: -2.9507 - root_mean_squared_error: 0.05331088/1146 [===========================>..] - ETA: 0s - loss: 0.0024 - fvaf: 0.6302 - root_mean_squared_error: 0.0493 1146/1146 [==============================] - 0s 51us/sample - loss: 0.0024 - fvaf: 0.6274 - root_mean_squared_error: 0.0492
  32/1225 [..............................] - ETA: 0s - loss: 0.0025 - fvaf: 0.6055 - root_mean_squared_error: 0.0503 608/1225 [=============>................] - ETA: 0s - loss: 0.0023 - fvaf: 0.5782 - root_mean_squared_error: 0.04771225/1225 [==============================] - 0s 71us/sample - loss: 0.0027 - fvaf: 0.5473 - root_mean_squared_error: 0.0522
