Total jobs: 120
{'Ntraining': 18, 'rotation': 14}
Params: JI_Ntraining_18_rotation_14
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_18_rotation_14
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
   32/23813 [..............................] - ETA: 16s - loss: 8.3437e-05 - fvaf: 0.9850 - root_mean_squared_error: 0.0091  896/23813 [>.............................] - ETA: 1s - loss: 6.4024e-05 - fvaf: 0.9710 - root_mean_squared_error: 0.0080  1856/23813 [=>............................] - ETA: 1s - loss: 6.6033e-05 - fvaf: 0.9710 - root_mean_squared_error: 0.0081 2752/23813 [==>...........................] - ETA: 1s - loss: 7.9453e-05 - fvaf: 0.9745 - root_mean_squared_error: 0.0089 3584/23813 [===>..........................] - ETA: 1s - loss: 7.6666e-05 - fvaf: 0.9752 - root_mean_squared_error: 0.0088 4448/23813 [====>.........................] - ETA: 1s - loss: 7.4528e-05 - fvaf: 0.9745 - root_mean_squared_error: 0.0086 5312/23813 [=====>........................] - ETA: 1s - loss: 7.3152e-05 - fvaf: 0.9744 - root_mean_squared_error: 0.0086 6272/23813 [======>.......................] - ETA: 1s - loss: 7.1857e-05 - fvaf: 0.9739 - root_mean_squared_error: 0.0085 7168/23813 [========>.....................] - ETA: 0s - loss: 7.0428e-05 - fvaf: 0.9734 - root_mean_squared_error: 0.0084 8032/23813 [=========>....................] - ETA: 0s - loss: 7.4914e-05 - fvaf: 0.9730 - root_mean_squared_error: 0.0087 8960/23813 [==========>...................] - ETA: 0s - loss: 7.3828e-05 - fvaf: 0.9729 - root_mean_squared_error: 0.0086 9824/23813 [===========>..................] - ETA: 0s - loss: 7.2044e-05 - fvaf: 0.9727 - root_mean_squared_error: 0.008510720/23813 [============>.................] - ETA: 0s - loss: 7.1518e-05 - fvaf: 0.9723 - root_mean_squared_error: 0.008511584/23813 [=============>................] - ETA: 0s - loss: 7.0662e-05 - fvaf: 0.9725 - root_mean_squared_error: 0.008412480/23813 [==============>...............] - ETA: 0s - loss: 6.9958e-05 - fvaf: 0.9728 - root_mean_squared_error: 0.008413312/23813 [===============>..............] - ETA: 0s - loss: 6.9804e-05 - fvaf: 0.9731 - root_mean_squared_error: 0.008414240/23813 [================>.............] - ETA: 0s - loss: 6.9627e-05 - fvaf: 0.9742 - root_mean_squared_error: 0.008315104/23813 [==================>...........] - ETA: 0s - loss: 7.0481e-05 - fvaf: 0.9756 - root_mean_squared_error: 0.008415936/23813 [===================>..........] - ETA: 0s - loss: 7.1124e-05 - fvaf: 0.9759 - root_mean_squared_error: 0.008416800/23813 [====================>.........] - ETA: 0s - loss: 7.1487e-05 - fvaf: 0.9766 - root_mean_squared_error: 0.008517568/23813 [=====================>........] - ETA: 0s - loss: 7.3161e-05 - fvaf: 0.9773 - root_mean_squared_error: 0.008618400/23813 [======================>.......] - ETA: 0s - loss: 1.1189e-04 - fvaf: 0.9763 - root_mean_squared_error: 0.010619264/23813 [=======================>......] - ETA: 0s - loss: 1.1148e-04 - fvaf: 0.9763 - root_mean_squared_error: 0.010620096/23813 [========================>.....] - ETA: 0s - loss: 1.1017e-04 - fvaf: 0.9765 - root_mean_squared_error: 0.010520992/23813 [=========================>....] - ETA: 0s - loss: 1.1122e-04 - fvaf: 0.9754 - root_mean_squared_error: 0.010521920/23813 [==========================>...] - ETA: 0s - loss: 1.0922e-04 - fvaf: 0.9756 - root_mean_squared_error: 0.010522688/23813 [===========================>..] - ETA: 0s - loss: 1.0864e-04 - fvaf: 0.9758 - root_mean_squared_error: 0.010423392/23813 [============================>.] - ETA: 0s - loss: 1.0730e-04 - fvaf: 0.9759 - root_mean_squared_error: 0.010423813/23813 [==============================] - 1s 60us/sample - loss: 1.0654e-04 - fvaf: 0.9759 - root_mean_squared_error: 0.0103
  32/1225 [..............................] - ETA: 0s - loss: 0.0018 - fvaf: 0.6015 - root_mean_squared_error: 0.04291024/1225 [========================>.....] - ETA: 0s - loss: 0.0022 - fvaf: 0.5969 - root_mean_squared_error: 0.04671225/1225 [==============================] - 0s 55us/sample - loss: 0.0026 - fvaf: 0.5473 - root_mean_squared_error: 0.0514
  32/1238 [..............................] - ETA: 0s - loss: 0.0018 - fvaf: 0.2281 - root_mean_squared_error: 0.0422 544/1238 [============>.................] - ETA: 0s - loss: 0.0019 - fvaf: 0.5872 - root_mean_squared_error: 0.04321238/1238 [==============================] - 0s 84us/sample - loss: 0.0022 - fvaf: 0.5852 - root_mean_squared_error: 0.0466
