Total jobs: 120
{'Ntraining': 5, 'rotation': 18}
Params: JI_Ntraining_5_rotation_18
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_5_rotation_18
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/6506 [..............................] - ETA: 3s - loss: 4.9345e-05 - fvaf: 0.9684 - root_mean_squared_error: 0.0070 800/6506 [==>...........................] - ETA: 0s - loss: 5.5582e-05 - fvaf: 0.9855 - root_mean_squared_error: 0.00751600/6506 [======>.......................] - ETA: 0s - loss: 5.3272e-05 - fvaf: 0.9863 - root_mean_squared_error: 0.00732176/6506 [=========>....................] - ETA: 0s - loss: 7.7752e-05 - fvaf: 0.9848 - root_mean_squared_error: 0.00882880/6506 [============>.................] - ETA: 0s - loss: 7.0872e-05 - fvaf: 0.9851 - root_mean_squared_error: 0.00843584/6506 [===============>..............] - ETA: 0s - loss: 6.7600e-05 - fvaf: 0.9851 - root_mean_squared_error: 0.00824288/6506 [==================>...........] - ETA: 0s - loss: 6.5282e-05 - fvaf: 0.9847 - root_mean_squared_error: 0.00814896/6506 [=====================>........] - ETA: 0s - loss: 6.4362e-05 - fvaf: 0.9848 - root_mean_squared_error: 0.00805632/6506 [========================>.....] - ETA: 0s - loss: 6.4308e-05 - fvaf: 0.9848 - root_mean_squared_error: 0.00806432/6506 [============================>.] - ETA: 0s - loss: 6.3935e-05 - fvaf: 0.9851 - root_mean_squared_error: 0.00806506/6506 [==============================] - 0s 74us/sample - loss: 6.4342e-05 - fvaf: 0.9851 - root_mean_squared_error: 0.0080
  32/1579 [..............................] - ETA: 0s - loss: 0.0045 - fvaf: 0.7607 - root_mean_squared_error: 0.0670 672/1579 [===========>..................] - ETA: 0s - loss: 0.0034 - fvaf: 0.7000 - root_mean_squared_error: 0.05791344/1579 [========================>.....] - ETA: 0s - loss: 0.0030 - fvaf: 0.6690 - root_mean_squared_error: 0.05461579/1579 [==============================] - 0s 78us/sample - loss: 0.0028 - fvaf: 0.6610 - root_mean_squared_error: 0.0531
  32/1364 [..............................] - ETA: 0s - loss: 0.0033 - fvaf: 0.5868 - root_mean_squared_error: 0.0579 832/1364 [=================>............] - ETA: 0s - loss: 0.0028 - fvaf: 0.6782 - root_mean_squared_error: 0.05271364/1364 [==============================] - 0s 72us/sample - loss: 0.0025 - fvaf: 0.6724 - root_mean_squared_error: 0.0496
