Total jobs: 120
{'Ntraining': 2, 'rotation': 2}
Params: JI_Ntraining_2_rotation_2
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_2_rotation_2
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/2796 [..............................] - ETA: 0s - loss: 1.9082e-04 - fvaf: 0.9519 - root_mean_squared_error: 0.01381440/2796 [==============>...............] - ETA: 0s - loss: 1.7551e-04 - fvaf: 0.9367 - root_mean_squared_error: 0.01322796/2796 [==============================] - 0s 38us/sample - loss: 1.8722e-04 - fvaf: 0.9392 - root_mean_squared_error: 0.0137
  32/1193 [..............................] - ETA: 0s - loss: 0.0039 - fvaf: 0.6125 - root_mean_squared_error: 0.06231193/1193 [==============================] - 0s 40us/sample - loss: 0.0028 - fvaf: 0.5473 - root_mean_squared_error: 0.0528
  32/1104 [..............................] - ETA: 0s - loss: 0.0015 - fvaf: 0.2616 - root_mean_squared_error: 0.03881104/1104 [==============================] - 0s 40us/sample - loss: 0.0020 - fvaf: 0.5650 - root_mean_squared_error: 0.0452
