Total jobs: 120
{'Ntraining': 18, 'rotation': 12}
Params: JI_Ntraining_18_rotation_12
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_18_rotation_12
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
   32/23865 [..............................] - ETA: 26s - loss: 8.6965e-05 - fvaf: 0.9740 - root_mean_squared_error: 0.0093  896/23865 [>.............................] - ETA: 2s - loss: 7.8504e-05 - fvaf: 0.9718 - root_mean_squared_error: 0.0089  1792/23865 [=>............................] - ETA: 1s - loss: 8.3402e-05 - fvaf: 0.9684 - root_mean_squared_error: 0.0091 2816/23865 [==>...........................] - ETA: 1s - loss: 8.3743e-05 - fvaf: 0.9699 - root_mean_squared_error: 0.0092 3648/23865 [===>..........................] - ETA: 1s - loss: 8.3165e-05 - fvaf: 0.9695 - root_mean_squared_error: 0.0091 4544/23865 [====>.........................] - ETA: 1s - loss: 8.8518e-05 - fvaf: 0.9710 - root_mean_squared_error: 0.0094 5600/23865 [======>.......................] - ETA: 1s - loss: 9.1101e-05 - fvaf: 0.9727 - root_mean_squared_error: 0.0095 6624/23865 [=======>......................] - ETA: 1s - loss: 9.2332e-05 - fvaf: 0.9726 - root_mean_squared_error: 0.0096 7872/23865 [========>.....................] - ETA: 0s - loss: 9.2074e-05 - fvaf: 0.9720 - root_mean_squared_error: 0.0096 8928/23865 [==========>...................] - ETA: 0s - loss: 9.1072e-05 - fvaf: 0.9719 - root_mean_squared_error: 0.0095 9920/23865 [===========>..................] - ETA: 0s - loss: 9.0200e-05 - fvaf: 0.9716 - root_mean_squared_error: 0.009511136/23865 [============>.................] - ETA: 0s - loss: 9.0968e-05 - fvaf: 0.9719 - root_mean_squared_error: 0.009512128/23865 [==============>...............] - ETA: 0s - loss: 8.9826e-05 - fvaf: 0.9718 - root_mean_squared_error: 0.009513344/23865 [===============>..............] - ETA: 0s - loss: 8.8940e-05 - fvaf: 0.9713 - root_mean_squared_error: 0.009414240/23865 [================>.............] - ETA: 0s - loss: 8.9268e-05 - fvaf: 0.9715 - root_mean_squared_error: 0.009415168/23865 [==================>...........] - ETA: 0s - loss: 8.9253e-05 - fvaf: 0.9714 - root_mean_squared_error: 0.009416064/23865 [===================>..........] - ETA: 0s - loss: 8.9928e-05 - fvaf: 0.9715 - root_mean_squared_error: 0.009516928/23865 [====================>.........] - ETA: 0s - loss: 9.2089e-05 - fvaf: 0.9727 - root_mean_squared_error: 0.009617792/23865 [=====================>........] - ETA: 0s - loss: 9.2675e-05 - fvaf: 0.9733 - root_mean_squared_error: 0.009618688/23865 [======================>.......] - ETA: 0s - loss: 9.5067e-05 - fvaf: 0.9743 - root_mean_squared_error: 0.009819584/23865 [=======================>......] - ETA: 0s - loss: 9.4822e-05 - fvaf: 0.9743 - root_mean_squared_error: 0.009720480/23865 [========================>.....] - ETA: 0s - loss: 9.5885e-05 - fvaf: 0.9748 - root_mean_squared_error: 0.009821376/23865 [=========================>....] - ETA: 0s - loss: 1.3277e-04 - fvaf: 0.9734 - root_mean_squared_error: 0.011522272/23865 [==========================>...] - ETA: 0s - loss: 1.3162e-04 - fvaf: 0.9738 - root_mean_squared_error: 0.011523168/23865 [============================>.] - ETA: 0s - loss: 1.3085e-04 - fvaf: 0.9737 - root_mean_squared_error: 0.011423865/23865 [==============================] - 1s 54us/sample - loss: 1.2964e-04 - fvaf: 0.9737 - root_mean_squared_error: 0.0114
  32/1265 [..............................] - ETA: 0s - loss: 0.0022 - fvaf: 0.7871 - root_mean_squared_error: 0.0466 928/1265 [=====================>........] - ETA: 0s - loss: 0.0038 - fvaf: 0.6450 - root_mean_squared_error: 0.06201265/1265 [==============================] - 0s 66us/sample - loss: 0.0037 - fvaf: 0.6649 - root_mean_squared_error: 0.0606
  32/1146 [..............................] - ETA: 0s - loss: 0.0017 - fvaf: -1.6608 - root_mean_squared_error: 0.0416 576/1146 [==============>...............] - ETA: 0s - loss: 0.0027 - fvaf: 0.6858 - root_mean_squared_error: 0.0515 1146/1146 [==============================] - 0s 92us/sample - loss: 0.0023 - fvaf: 0.6803 - root_mean_squared_error: 0.0477
