Total jobs: 120
{'Ntraining': 1, 'rotation': 8}
Params: JI_Ntraining_1_rotation_8
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_1_rotation_8
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/1247 [..............................] - ETA: 0s - loss: 1.6343e-04 - fvaf: 0.9956 - root_mean_squared_error: 0.01281056/1247 [========================>.....] - ETA: 0s - loss: 1.5521e-04 - fvaf: 0.9888 - root_mean_squared_error: 0.01251247/1247 [==============================] - 0s 52us/sample - loss: 1.5111e-04 - fvaf: 0.9879 - root_mean_squared_error: 0.0123
  32/1375 [..............................] - ETA: 0s - loss: 0.0031 - fvaf: -0.8457 - root_mean_squared_error: 0.05561152/1375 [========================>.....] - ETA: 0s - loss: 0.0075 - fvaf: 0.2862 - root_mean_squared_error: 0.0865 1375/1375 [==============================] - 0s 49us/sample - loss: 0.0075 - fvaf: 0.3004 - root_mean_squared_error: 0.0864
  32/1130 [..............................] - ETA: 0s - loss: 0.0080 - fvaf: 0.6067 - root_mean_squared_error: 0.08951130/1130 [==============================] - 0s 49us/sample - loss: 0.0151 - fvaf: 0.1427 - root_mean_squared_error: 0.1231
