Total jobs: 120
{'Ntraining': 10, 'rotation': 10}
Params: JI_Ntraining_10_rotation_10
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_10_rotation_10
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
   32/13424 [..............................] - ETA: 6s - loss: 5.3666e-05 - fvaf: 0.9936 - root_mean_squared_error: 0.0073 1216/13424 [=>............................] - ETA: 0s - loss: 5.4907e-05 - fvaf: 0.9928 - root_mean_squared_error: 0.0074 2336/13424 [====>.........................] - ETA: 0s - loss: 5.2074e-05 - fvaf: 0.9914 - root_mean_squared_error: 0.0072 3584/13424 [=======>......................] - ETA: 0s - loss: 5.0348e-05 - fvaf: 0.9904 - root_mean_squared_error: 0.0071 4864/13424 [=========>....................] - ETA: 0s - loss: 4.9209e-05 - fvaf: 0.9896 - root_mean_squared_error: 0.0070 6144/13424 [============>.................] - ETA: 0s - loss: 4.8184e-05 - fvaf: 0.9894 - root_mean_squared_error: 0.0069 7424/13424 [===============>..............] - ETA: 0s - loss: 5.0349e-05 - fvaf: 0.9896 - root_mean_squared_error: 0.0071 8704/13424 [==================>...........] - ETA: 0s - loss: 5.0103e-05 - fvaf: 0.9898 - root_mean_squared_error: 0.0071 9984/13424 [=====================>........] - ETA: 0s - loss: 4.9988e-05 - fvaf: 0.9895 - root_mean_squared_error: 0.007111264/13424 [========================>.....] - ETA: 0s - loss: 4.9312e-05 - fvaf: 0.9894 - root_mean_squared_error: 0.007012480/13424 [==========================>...] - ETA: 0s - loss: 4.9824e-05 - fvaf: 0.9892 - root_mean_squared_error: 0.007113424/13424 [==============================] - 1s 42us/sample - loss: 4.9779e-05 - fvaf: 0.9892 - root_mean_squared_error: 0.0071
  32/1247 [..............................] - ETA: 0s - loss: 0.0044 - fvaf: 0.6907 - root_mean_squared_error: 0.06641247/1247 [==============================] - 0s 42us/sample - loss: 0.0030 - fvaf: 0.6585 - root_mean_squared_error: 0.0547
  32/1257 [..............................] - ETA: 0s - loss: 0.0016 - fvaf: 0.4499 - root_mean_squared_error: 0.03971216/1257 [============================>.] - ETA: 0s - loss: 0.0026 - fvaf: 0.6352 - root_mean_squared_error: 0.05121257/1257 [==============================] - 0s 47us/sample - loss: 0.0026 - fvaf: 0.6432 - root_mean_squared_error: 0.0510
