Total jobs: 120
{'Ntraining': 5, 'rotation': 0}
Params: JI_Ntraining_5_rotation_0
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_5_rotation_0
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/6591 [..............................] - ETA: 1s - loss: 1.2154e-04 - fvaf: 0.9817 - root_mean_squared_error: 0.01101280/6591 [====>.........................] - ETA: 0s - loss: 1.0487e-04 - fvaf: 0.9591 - root_mean_squared_error: 0.01022528/6591 [==========>...................] - ETA: 0s - loss: 1.0233e-04 - fvaf: 0.9599 - root_mean_squared_error: 0.01013776/6591 [================>.............] - ETA: 0s - loss: 1.0304e-04 - fvaf: 0.9628 - root_mean_squared_error: 0.01025152/6591 [======================>.......] - ETA: 0s - loss: 1.0632e-04 - fvaf: 0.9647 - root_mean_squared_error: 0.01036400/6591 [============================>.] - ETA: 0s - loss: 1.2103e-04 - fvaf: 0.9696 - root_mean_squared_error: 0.01106591/6591 [==============================] - 0s 41us/sample - loss: 1.2053e-04 - fvaf: 0.9697 - root_mean_squared_error: 0.0110
  32/1389 [..............................] - ETA: 0s - loss: 0.0028 - fvaf: 0.2540 - root_mean_squared_error: 0.05251312/1389 [===========================>..] - ETA: 0s - loss: 0.0022 - fvaf: 0.6266 - root_mean_squared_error: 0.04701389/1389 [==============================] - 0s 43us/sample - loss: 0.0023 - fvaf: 0.6140 - root_mean_squared_error: 0.0475
  32/1289 [..............................] - ETA: 0s - loss: 0.0028 - fvaf: 0.6139 - root_mean_squared_error: 0.05321289/1289 [==============================] - 0s 39us/sample - loss: 0.0040 - fvaf: 0.5431 - root_mean_squared_error: 0.0636
