Total jobs: 120
{'Ntraining': 5, 'rotation': 2}
Params: JI_Ntraining_5_rotation_2
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_5_rotation_2
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/6921 [..............................] - ETA: 2s - loss: 2.3501e-04 - fvaf: 0.9553 - root_mean_squared_error: 0.0153 992/6921 [===>..........................] - ETA: 0s - loss: 2.5758e-04 - fvaf: 0.9438 - root_mean_squared_error: 0.01601920/6921 [=======>......................] - ETA: 0s - loss: 2.5133e-04 - fvaf: 0.9417 - root_mean_squared_error: 0.01592784/6921 [===========>..................] - ETA: 0s - loss: 2.5282e-04 - fvaf: 0.9431 - root_mean_squared_error: 0.01593680/6921 [==============>...............] - ETA: 0s - loss: 2.8645e-04 - fvaf: 0.9511 - root_mean_squared_error: 0.01694672/6921 [===================>..........] - ETA: 0s - loss: 2.7869e-04 - fvaf: 0.9521 - root_mean_squared_error: 0.01675664/6921 [=======================>......] - ETA: 0s - loss: 2.9649e-04 - fvaf: 0.9533 - root_mean_squared_error: 0.01726624/6921 [===========================>..] - ETA: 0s - loss: 3.1125e-04 - fvaf: 0.9540 - root_mean_squared_error: 0.01766921/6921 [==============================] - 0s 56us/sample - loss: 3.1213e-04 - fvaf: 0.9533 - root_mean_squared_error: 0.0177
  32/1193 [..............................] - ETA: 0s - loss: 0.0046 - fvaf: 0.5297 - root_mean_squared_error: 0.06761024/1193 [========================>.....] - ETA: 0s - loss: 0.0024 - fvaf: 0.5852 - root_mean_squared_error: 0.04891193/1193 [==============================] - 0s 58us/sample - loss: 0.0025 - fvaf: 0.5857 - root_mean_squared_error: 0.0496
  32/1104 [..............................] - ETA: 0s - loss: 0.0021 - fvaf: -0.0338 - root_mean_squared_error: 0.0457 896/1104 [=======================>......] - ETA: 0s - loss: 0.0023 - fvaf: 0.5373 - root_mean_squared_error: 0.0480 1104/1104 [==============================] - 0s 64us/sample - loss: 0.0024 - fvaf: 0.5215 - root_mean_squared_error: 0.0488
