Total jobs: 120
{'Ntraining': 10, 'rotation': 0}
Params: JI_Ntraining_10_rotation_0
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_10_rotation_0
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
   32/12852 [..............................] - ETA: 7s - loss: 1.1340e-04 - fvaf: 0.9916 - root_mean_squared_error: 0.0106  672/12852 [>.............................] - ETA: 1s - loss: 8.0274e-05 - fvaf: 0.9829 - root_mean_squared_error: 0.0090 1376/12852 [==>...........................] - ETA: 1s - loss: 8.0794e-05 - fvaf: 0.9812 - root_mean_squared_error: 0.0090 2080/12852 [===>..........................] - ETA: 0s - loss: 7.8228e-05 - fvaf: 0.9812 - root_mean_squared_error: 0.0088 2784/12852 [=====>........................] - ETA: 0s - loss: 8.1411e-05 - fvaf: 0.9812 - root_mean_squared_error: 0.0090 3616/12852 [=======>......................] - ETA: 0s - loss: 8.0574e-05 - fvaf: 0.9815 - root_mean_squared_error: 0.0090 4288/12852 [=========>....................] - ETA: 0s - loss: 8.0565e-05 - fvaf: 0.9816 - root_mean_squared_error: 0.0090 5024/12852 [==========>...................] - ETA: 0s - loss: 8.1001e-05 - fvaf: 0.9820 - root_mean_squared_error: 0.0090 5632/12852 [============>.................] - ETA: 0s - loss: 8.4401e-05 - fvaf: 0.9827 - root_mean_squared_error: 0.0092 6304/12852 [=============>................] - ETA: 0s - loss: 9.2944e-05 - fvaf: 0.9840 - root_mean_squared_error: 0.0096 7040/12852 [===============>..............] - ETA: 0s - loss: 9.1713e-05 - fvaf: 0.9842 - root_mean_squared_error: 0.0096 7744/12852 [=================>............] - ETA: 0s - loss: 1.0230e-04 - fvaf: 0.9833 - root_mean_squared_error: 0.0101 8576/12852 [===================>..........] - ETA: 0s - loss: 9.9634e-05 - fvaf: 0.9834 - root_mean_squared_error: 0.0100 9312/12852 [====================>.........] - ETA: 0s - loss: 1.0283e-04 - fvaf: 0.9839 - root_mean_squared_error: 0.010110208/12852 [======================>.......] - ETA: 0s - loss: 1.7440e-04 - fvaf: 0.9822 - root_mean_squared_error: 0.013211008/12852 [========================>.....] - ETA: 0s - loss: 1.6776e-04 - fvaf: 0.9823 - root_mean_squared_error: 0.013011904/12852 [==========================>...] - ETA: 0s - loss: 1.6401e-04 - fvaf: 0.9824 - root_mean_squared_error: 0.012812736/12852 [============================>.] - ETA: 0s - loss: 1.5866e-04 - fvaf: 0.9825 - root_mean_squared_error: 0.012612852/12852 [==============================] - 1s 70us/sample - loss: 1.5794e-04 - fvaf: 0.9825 - root_mean_squared_error: 0.0126
  32/1389 [..............................] - ETA: 0s - loss: 0.0035 - fvaf: 0.5783 - root_mean_squared_error: 0.0589 832/1389 [================>.............] - ETA: 0s - loss: 0.0021 - fvaf: 0.6634 - root_mean_squared_error: 0.04611389/1389 [==============================] - 0s 66us/sample - loss: 0.0023 - fvaf: 0.5941 - root_mean_squared_error: 0.0481
  32/1289 [..............................] - ETA: 0s - loss: 0.0034 - fvaf: 0.6261 - root_mean_squared_error: 0.0579 928/1289 [====================>.........] - ETA: 0s - loss: 0.0039 - fvaf: 0.5896 - root_mean_squared_error: 0.06281289/1289 [==============================] - 0s 60us/sample - loss: 0.0034 - fvaf: 0.6033 - root_mean_squared_error: 0.0584
