Total jobs: 120
{'Ntraining': 18, 'rotation': 11}
Params: JI_Ntraining_18_rotation_11
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_18_rotation_11
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
   32/23754 [..............................] - ETA: 17s - loss: 4.7470e-05 - fvaf: 0.8683 - root_mean_squared_error: 0.0069 1088/23754 [>.............................] - ETA: 1s - loss: 7.2589e-05 - fvaf: 0.9845 - root_mean_squared_error: 0.0085  2240/23754 [=>............................] - ETA: 1s - loss: 7.3281e-05 - fvaf: 0.9829 - root_mean_squared_error: 0.0086 3360/23754 [===>..........................] - ETA: 1s - loss: 6.9357e-05 - fvaf: 0.9812 - root_mean_squared_error: 0.0083 4512/23754 [====>.........................] - ETA: 0s - loss: 6.9683e-05 - fvaf: 0.9820 - root_mean_squared_error: 0.0083 5664/23754 [======>.......................] - ETA: 0s - loss: 7.3676e-05 - fvaf: 0.9830 - root_mean_squared_error: 0.0086 6720/23754 [=======>......................] - ETA: 0s - loss: 7.3804e-05 - fvaf: 0.9841 - root_mean_squared_error: 0.0086 7808/23754 [========>.....................] - ETA: 0s - loss: 7.3191e-05 - fvaf: 0.9843 - root_mean_squared_error: 0.0086 8928/23754 [==========>...................] - ETA: 0s - loss: 7.3162e-05 - fvaf: 0.9841 - root_mean_squared_error: 0.008610048/23754 [===========>..................] - ETA: 0s - loss: 7.2418e-05 - fvaf: 0.9838 - root_mean_squared_error: 0.008511168/23754 [=============>................] - ETA: 0s - loss: 7.2442e-05 - fvaf: 0.9835 - root_mean_squared_error: 0.008512288/23754 [==============>...............] - ETA: 0s - loss: 7.5220e-05 - fvaf: 0.9834 - root_mean_squared_error: 0.008713312/23754 [===============>..............] - ETA: 0s - loss: 7.4123e-05 - fvaf: 0.9833 - root_mean_squared_error: 0.008614432/23754 [=================>............] - ETA: 0s - loss: 7.3178e-05 - fvaf: 0.9831 - root_mean_squared_error: 0.008615552/23754 [==================>...........] - ETA: 0s - loss: 7.3023e-05 - fvaf: 0.9832 - root_mean_squared_error: 0.008516672/23754 [====================>.........] - ETA: 0s - loss: 7.3539e-05 - fvaf: 0.9832 - root_mean_squared_error: 0.008617760/23754 [=====================>........] - ETA: 0s - loss: 7.4301e-05 - fvaf: 0.9834 - root_mean_squared_error: 0.008618752/23754 [======================>.......] - ETA: 0s - loss: 7.6973e-05 - fvaf: 0.9840 - root_mean_squared_error: 0.008819872/23754 [========================>.....] - ETA: 0s - loss: 7.9044e-05 - fvaf: 0.9842 - root_mean_squared_error: 0.008921056/23754 [=========================>....] - ETA: 0s - loss: 7.9724e-05 - fvaf: 0.9846 - root_mean_squared_error: 0.008922208/23754 [===========================>..] - ETA: 0s - loss: 1.1257e-04 - fvaf: 0.9838 - root_mean_squared_error: 0.010623424/23754 [============================>.] - ETA: 0s - loss: 1.1092e-04 - fvaf: 0.9841 - root_mean_squared_error: 0.010523754/23754 [==============================] - 1s 47us/sample - loss: 1.1018e-04 - fvaf: 0.9841 - root_mean_squared_error: 0.0105
  32/1257 [..............................] - ETA: 0s - loss: 0.0012 - fvaf: 0.5567 - root_mean_squared_error: 0.03471152/1257 [==========================>...] - ETA: 0s - loss: 0.0025 - fvaf: 0.6592 - root_mean_squared_error: 0.05051257/1257 [==============================] - 0s 48us/sample - loss: 0.0025 - fvaf: 0.6663 - root_mean_squared_error: 0.0501
  32/1265 [..............................] - ETA: 0s - loss: 0.0034 - fvaf: 0.7139 - root_mean_squared_error: 0.05811152/1265 [==========================>...] - ETA: 0s - loss: 0.0034 - fvaf: 0.6640 - root_mean_squared_error: 0.05791265/1265 [==============================] - 0s 63us/sample - loss: 0.0034 - fvaf: 0.6698 - root_mean_squared_error: 0.0580
