Total jobs: 120
{'Ntraining': 2, 'rotation': 5}
Params: JI_Ntraining_2_rotation_5
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_2_rotation_5
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/2627 [..............................] - ETA: 0s - loss: 1.2316e-04 - fvaf: 0.3240 - root_mean_squared_error: 0.01111408/2627 [===============>..............] - ETA: 0s - loss: 1.1666e-04 - fvaf: 0.9684 - root_mean_squared_error: 0.01082627/2627 [==============================] - 0s 38us/sample - loss: 1.1873e-04 - fvaf: 0.9658 - root_mean_squared_error: 0.0109
  32/1265 [..............................] - ETA: 0s - loss: 0.0051 - fvaf: 0.5366 - root_mean_squared_error: 0.07121265/1265 [==============================] - 0s 37us/sample - loss: 0.0049 - fvaf: 0.3531 - root_mean_squared_error: 0.0700
  32/1498 [..............................] - ETA: 0s - loss: 0.0042 - fvaf: 0.6122 - root_mean_squared_error: 0.06491376/1498 [==========================>...] - ETA: 0s - loss: 0.0087 - fvaf: 0.3988 - root_mean_squared_error: 0.09341498/1498 [==============================] - 0s 40us/sample - loss: 0.0083 - fvaf: 0.4054 - root_mean_squared_error: 0.0913
