Total jobs: 120
{'Ntraining': 5, 'rotation': 4}
Params: JI_Ntraining_5_rotation_4
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_5_rotation_4
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/6502 [..............................] - ETA: 1s - loss: 1.3809e-04 - fvaf: 0.9771 - root_mean_squared_error: 0.01181344/6502 [=====>........................] - ETA: 0s - loss: 1.7435e-04 - fvaf: 0.9835 - root_mean_squared_error: 0.01322656/6502 [===========>..................] - ETA: 0s - loss: 1.6699e-04 - fvaf: 0.9809 - root_mean_squared_error: 0.01294000/6502 [=================>............] - ETA: 0s - loss: 1.5061e-04 - fvaf: 0.9810 - root_mean_squared_error: 0.01235344/6502 [=======================>......] - ETA: 0s - loss: 2.8817e-04 - fvaf: 0.9778 - root_mean_squared_error: 0.01706502/6502 [==============================] - 0s 39us/sample - loss: 2.6508e-04 - fvaf: 0.9772 - root_mean_squared_error: 0.0163
  32/1531 [..............................] - ETA: 0s - loss: 0.0075 - fvaf: 0.4591 - root_mean_squared_error: 0.08681376/1531 [=========================>....] - ETA: 0s - loss: 0.0031 - fvaf: 0.6023 - root_mean_squared_error: 0.05541531/1531 [==============================] - 0s 40us/sample - loss: 0.0030 - fvaf: 0.5978 - root_mean_squared_error: 0.0548
  32/1265 [..............................] - ETA: 0s - loss: 0.0026 - fvaf: 0.7617 - root_mean_squared_error: 0.05111265/1265 [==============================] - 0s 40us/sample - loss: 0.0036 - fvaf: 0.5656 - root_mean_squared_error: 0.0596
