Total jobs: 120
{'Ntraining': 3, 'rotation': 2}
Params: JI_Ntraining_3_rotation_2
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_3_rotation_2
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/4294 [..............................] - ETA: 0s - loss: 2.6997e-04 - fvaf: 0.9727 - root_mean_squared_error: 0.01641696/4294 [==========>...................] - ETA: 0s - loss: 2.6088e-04 - fvaf: 0.9723 - root_mean_squared_error: 0.01623360/4294 [======================>.......] - ETA: 0s - loss: 2.7546e-04 - fvaf: 0.9730 - root_mean_squared_error: 0.01664294/4294 [==============================] - 0s 31us/sample - loss: 2.9241e-04 - fvaf: 0.9729 - root_mean_squared_error: 0.0171
  32/1193 [..............................] - ETA: 0s - loss: 0.0030 - fvaf: 0.6681 - root_mean_squared_error: 0.05521193/1193 [==============================] - 0s 33us/sample - loss: 0.0025 - fvaf: 0.6271 - root_mean_squared_error: 0.0505
  32/1104 [..............................] - ETA: 0s - loss: 0.0016 - fvaf: 0.3307 - root_mean_squared_error: 0.03971104/1104 [==============================] - 0s 34us/sample - loss: 0.0022 - fvaf: 0.5843 - root_mean_squared_error: 0.0466
