Total jobs: 120
{'Ntraining': 2, 'rotation': 11}
Params: JI_Ntraining_2_rotation_11
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_2_rotation_11
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/2371 [..............................] - ETA: 0s - loss: 1.2426e-04 - fvaf: 0.8345 - root_mean_squared_error: 0.0111 800/2371 [=========>....................] - ETA: 0s - loss: 9.0050e-05 - fvaf: 0.9880 - root_mean_squared_error: 0.00951568/2371 [==================>...........] - ETA: 0s - loss: 8.7955e-05 - fvaf: 0.9879 - root_mean_squared_error: 0.00942272/2371 [===========================>..] - ETA: 0s - loss: 9.2360e-05 - fvaf: 0.9873 - root_mean_squared_error: 0.00962371/2371 [==============================] - 0s 73us/sample - loss: 9.2514e-05 - fvaf: 0.9872 - root_mean_squared_error: 0.0096
  32/1257 [..............................] - ETA: 0s - loss: 0.0014 - fvaf: 0.5049 - root_mean_squared_error: 0.0381 768/1257 [=================>............] - ETA: 0s - loss: 0.0044 - fvaf: 0.5503 - root_mean_squared_error: 0.06651257/1257 [==============================] - 0s 84us/sample - loss: 0.0037 - fvaf: 0.5733 - root_mean_squared_error: 0.0610
  32/1265 [..............................] - ETA: 0s - loss: 0.0030 - fvaf: 0.6850 - root_mean_squared_error: 0.0544 768/1265 [=================>............] - ETA: 0s - loss: 0.0037 - fvaf: 0.6332 - root_mean_squared_error: 0.06081265/1265 [==============================] - 0s 74us/sample - loss: 0.0044 - fvaf: 0.5769 - root_mean_squared_error: 0.0665
