Total jobs: 120
{'Ntraining': 18, 'rotation': 2}
Params: JI_Ntraining_18_rotation_2
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_18_rotation_2
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
   32/23979 [..............................] - ETA: 16s - loss: 1.2739e-04 - fvaf: 0.9508 - root_mean_squared_error: 0.0113  672/23979 [..............................] - ETA: 2s - loss: 1.1220e-04 - fvaf: 0.9651 - root_mean_squared_error: 0.0106  1440/23979 [>.............................] - ETA: 1s - loss: 1.1283e-04 - fvaf: 0.9650 - root_mean_squared_error: 0.0106 2368/23979 [=>............................] - ETA: 1s - loss: 1.1847e-04 - fvaf: 0.9649 - root_mean_squared_error: 0.0109 3360/23979 [===>..........................] - ETA: 1s - loss: 1.2336e-04 - fvaf: 0.9675 - root_mean_squared_error: 0.0111 4608/23979 [====>.........................] - ETA: 1s - loss: 1.3232e-04 - fvaf: 0.9716 - root_mean_squared_error: 0.0115 5696/23979 [======>.......................] - ETA: 1s - loss: 0.0014 - fvaf: 0.8699 - root_mean_squared_error: 0.0378     6880/23979 [=======>......................] - ETA: 0s - loss: 0.0012 - fvaf: 0.8903 - root_mean_squared_error: 0.0348 7936/23979 [========>.....................] - ETA: 0s - loss: 0.0012 - fvaf: 0.9069 - root_mean_squared_error: 0.0340 8960/23979 [==========>...................] - ETA: 0s - loss: 0.0010 - fvaf: 0.9138 - root_mean_squared_error: 0.0322 9888/23979 [===========>..................] - ETA: 0s - loss: 9.5247e-04 - fvaf: 0.9180 - root_mean_squared_error: 0.030910656/23979 [============>.................] - ETA: 0s - loss: 8.9222e-04 - fvaf: 0.9206 - root_mean_squared_error: 0.029911584/23979 [=============>................] - ETA: 0s - loss: 8.3027e-04 - fvaf: 0.9259 - root_mean_squared_error: 0.028812576/23979 [==============>...............] - ETA: 0s - loss: 7.7398e-04 - fvaf: 0.9289 - root_mean_squared_error: 0.027813344/23979 [===============>..............] - ETA: 0s - loss: 7.3572e-04 - fvaf: 0.9300 - root_mean_squared_error: 0.027114176/23979 [================>.............] - ETA: 0s - loss: 6.9950e-04 - fvaf: 0.9311 - root_mean_squared_error: 0.026415008/23979 [=================>............] - ETA: 0s - loss: 6.6606e-04 - fvaf: 0.9317 - root_mean_squared_error: 0.025815808/23979 [==================>...........] - ETA: 0s - loss: 6.3819e-04 - fvaf: 0.9332 - root_mean_squared_error: 0.025316640/23979 [===================>..........] - ETA: 0s - loss: 6.1169e-04 - fvaf: 0.9339 - root_mean_squared_error: 0.024717472/23979 [====================>.........] - ETA: 0s - loss: 5.8984e-04 - fvaf: 0.9355 - root_mean_squared_error: 0.024318656/23979 [======================>.......] - ETA: 0s - loss: 5.6015e-04 - fvaf: 0.9378 - root_mean_squared_error: 0.023719680/23979 [=======================>......] - ETA: 0s - loss: 5.3679e-04 - fvaf: 0.9392 - root_mean_squared_error: 0.023220992/23979 [=========================>....] - ETA: 0s - loss: 5.1008e-04 - fvaf: 0.9404 - root_mean_squared_error: 0.022622464/23979 [===========================>..] - ETA: 0s - loss: 4.8413e-04 - fvaf: 0.9411 - root_mean_squared_error: 0.022023979/23979 [==============================] - 1s 51us/sample - loss: 4.6393e-04 - fvaf: 0.9420 - root_mean_squared_error: 0.0215
  32/1193 [..............................] - ETA: 0s - loss: 0.0026 - fvaf: 0.6134 - root_mean_squared_error: 0.05071024/1193 [========================>.....] - ETA: 0s - loss: 0.0022 - fvaf: 0.6138 - root_mean_squared_error: 0.04731193/1193 [==============================] - 0s 57us/sample - loss: 0.0024 - fvaf: 0.6058 - root_mean_squared_error: 0.0485
  32/1104 [..............................] - ETA: 0s - loss: 0.0018 - fvaf: -8.6830e-05 - root_mean_squared_error: 0.0424 576/1104 [==============>...............] - ETA: 0s - loss: 0.0023 - fvaf: 0.4780 - root_mean_squared_error: 0.0478     1104/1104 [==============================] - 0s 93us/sample - loss: 0.0024 - fvaf: 0.5095 - root_mean_squared_error: 0.0493
