Total jobs: 120
{'Ntraining': 3, 'rotation': 12}
Params: JI_Ntraining_3_rotation_12
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_3_rotation_12
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/4033 [..............................] - ETA: 0s - loss: 2.1856e-04 - fvaf: 0.9249 - root_mean_squared_error: 0.0148 928/4033 [=====>........................] - ETA: 0s - loss: 1.4512e-04 - fvaf: 0.9573 - root_mean_squared_error: 0.01201792/4033 [============>.................] - ETA: 0s - loss: 1.8206e-04 - fvaf: 0.9334 - root_mean_squared_error: 0.01352592/4033 [==================>...........] - ETA: 0s - loss: 1.7693e-04 - fvaf: 0.9401 - root_mean_squared_error: 0.01333392/4033 [========================>.....] - ETA: 0s - loss: 1.6605e-04 - fvaf: 0.9451 - root_mean_squared_error: 0.01294033/4033 [==============================] - 0s 63us/sample - loss: 1.6314e-04 - fvaf: 0.9469 - root_mean_squared_error: 0.0128
  32/1265 [..............................] - ETA: 0s - loss: 0.0033 - fvaf: 0.7486 - root_mean_squared_error: 0.0576 864/1265 [===================>..........] - ETA: 0s - loss: 0.0052 - fvaf: 0.5269 - root_mean_squared_error: 0.07191265/1265 [==============================] - 0s 69us/sample - loss: 0.0049 - fvaf: 0.5654 - root_mean_squared_error: 0.0698
  32/1146 [..............................] - ETA: 0s - loss: 8.7240e-04 - fvaf: -0.6964 - root_mean_squared_error: 0.0295 960/1146 [========================>.....] - ETA: 0s - loss: 0.0031 - fvaf: 0.6448 - root_mean_squared_error: 0.0558     1146/1146 [==============================] - 0s 59us/sample - loss: 0.0030 - fvaf: 0.6414 - root_mean_squared_error: 0.0543
