Total jobs: 120
{'Ntraining': 10, 'rotation': 3}
Params: JI_Ntraining_10_rotation_3
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_10_rotation_3
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
   32/12660 [..............................] - ETA: 6s - loss: 7.7094e-05 - fvaf: 0.9875 - root_mean_squared_error: 0.0088  960/12660 [=>............................] - ETA: 0s - loss: 8.4255e-05 - fvaf: 0.9783 - root_mean_squared_error: 0.0092 1888/12660 [===>..........................] - ETA: 0s - loss: 8.8459e-05 - fvaf: 0.9844 - root_mean_squared_error: 0.0094 2688/12660 [=====>........................] - ETA: 0s - loss: 9.5359e-05 - fvaf: 0.9864 - root_mean_squared_error: 0.0098 3520/12660 [=======>......................] - ETA: 0s - loss: 9.0420e-05 - fvaf: 0.9864 - root_mean_squared_error: 0.0095 4224/12660 [=========>....................] - ETA: 0s - loss: 9.5710e-05 - fvaf: 0.9857 - root_mean_squared_error: 0.0098 4928/12660 [==========>...................] - ETA: 0s - loss: 9.3818e-05 - fvaf: 0.9855 - root_mean_squared_error: 0.0097 5536/12660 [============>.................] - ETA: 0s - loss: 9.4231e-05 - fvaf: 0.9861 - root_mean_squared_error: 0.0097 6208/12660 [=============>................] - ETA: 0s - loss: 2.1503e-04 - fvaf: 0.9816 - root_mean_squared_error: 0.0147 6912/12660 [===============>..............] - ETA: 0s - loss: 2.0088e-04 - fvaf: 0.9820 - root_mean_squared_error: 0.0142 7648/12660 [=================>............] - ETA: 0s - loss: 1.9003e-04 - fvaf: 0.9821 - root_mean_squared_error: 0.0138 8288/12660 [==================>...........] - ETA: 0s - loss: 1.8620e-04 - fvaf: 0.9810 - root_mean_squared_error: 0.0136 9024/12660 [====================>.........] - ETA: 0s - loss: 1.7632e-04 - fvaf: 0.9811 - root_mean_squared_error: 0.0133 9632/12660 [=====================>........] - ETA: 0s - loss: 1.6981e-04 - fvaf: 0.9814 - root_mean_squared_error: 0.013010464/12660 [=======================>......] - ETA: 0s - loss: 1.6446e-04 - fvaf: 0.9819 - root_mean_squared_error: 0.012811328/12660 [=========================>....] - ETA: 0s - loss: 1.5684e-04 - fvaf: 0.9819 - root_mean_squared_error: 0.012512096/12660 [===========================>..] - ETA: 0s - loss: 1.5124e-04 - fvaf: 0.9818 - root_mean_squared_error: 0.012312660/12660 [==============================] - 1s 69us/sample - loss: 1.4899e-04 - fvaf: 0.9817 - root_mean_squared_error: 0.0122
  32/1104 [..............................] - ETA: 0s - loss: 0.0012 - fvaf: 0.3392 - root_mean_squared_error: 0.0346 800/1104 [====================>.........] - ETA: 0s - loss: 0.0024 - fvaf: 0.5707 - root_mean_squared_error: 0.04951104/1104 [==============================] - 0s 74us/sample - loss: 0.0025 - fvaf: 0.5348 - root_mean_squared_error: 0.0500
  32/1531 [..............................] - ETA: 0s - loss: 0.0056 - fvaf: 0.3776 - root_mean_squared_error: 0.0750 896/1531 [================>.............] - ETA: 0s - loss: 0.0031 - fvaf: 0.6065 - root_mean_squared_error: 0.05581531/1531 [==============================] - 0s 60us/sample - loss: 0.0028 - fvaf: 0.5895 - root_mean_squared_error: 0.0530
