Total jobs: 120
{'Ntraining': 5, 'rotation': 19}
Params: JI_Ntraining_5_rotation_19
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_5_rotation_19
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/6382 [..............................] - ETA: 2s - loss: 3.0742e-05 - fvaf: 0.9925 - root_mean_squared_error: 0.0055 672/6382 [==>...........................] - ETA: 0s - loss: 1.1721e-04 - fvaf: 0.9776 - root_mean_squared_error: 0.01081280/6382 [=====>........................] - ETA: 0s - loss: 7.8566e-05 - fvaf: 0.9799 - root_mean_squared_error: 0.00891952/6382 [========>.....................] - ETA: 0s - loss: 6.5828e-05 - fvaf: 0.9820 - root_mean_squared_error: 0.00812560/6382 [===========>..................] - ETA: 0s - loss: 5.9020e-05 - fvaf: 0.9820 - root_mean_squared_error: 0.00773328/6382 [==============>...............] - ETA: 0s - loss: 5.4603e-05 - fvaf: 0.9825 - root_mean_squared_error: 0.00743936/6382 [=================>............] - ETA: 0s - loss: 5.2634e-05 - fvaf: 0.9832 - root_mean_squared_error: 0.00734416/6382 [===================>..........] - ETA: 0s - loss: 5.0952e-05 - fvaf: 0.9834 - root_mean_squared_error: 0.00715088/6382 [======================>.......] - ETA: 0s - loss: 4.9749e-05 - fvaf: 0.9836 - root_mean_squared_error: 0.00715696/6382 [=========================>....] - ETA: 0s - loss: 4.8946e-05 - fvaf: 0.9838 - root_mean_squared_error: 0.00706382/6382 [==============================] - 1s 81us/sample - loss: 4.8677e-05 - fvaf: 0.9843 - root_mean_squared_error: 0.0070
  32/1364 [..............................] - ETA: 0s - loss: 0.0032 - fvaf: 0.6619 - root_mean_squared_error: 0.0562 672/1364 [=============>................] - ETA: 0s - loss: 0.0024 - fvaf: 0.6597 - root_mean_squared_error: 0.04921364/1364 [==============================] - 0s 72us/sample - loss: 0.0025 - fvaf: 0.6642 - root_mean_squared_error: 0.0500
  32/1389 [..............................] - ETA: 0s - loss: 0.0014 - fvaf: 0.6381 - root_mean_squared_error: 0.0371 672/1389 [=============>................] - ETA: 0s - loss: 0.0017 - fvaf: 0.7198 - root_mean_squared_error: 0.04141376/1389 [============================>.] - ETA: 0s - loss: 0.0020 - fvaf: 0.6793 - root_mean_squared_error: 0.04511389/1389 [==============================] - 0s 80us/sample - loss: 0.0020 - fvaf: 0.6803 - root_mean_squared_error: 0.0452
