Total jobs: 120
{'Ntraining': 2, 'rotation': 4}
Params: JI_Ntraining_2_rotation_4
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_2_rotation_4
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/2750 [..............................] - ETA: 0s - loss: 2.5687e-04 - fvaf: 0.9842 - root_mean_squared_error: 0.01601696/2750 [=================>............] - ETA: 0s - loss: 3.4281e-04 - fvaf: 0.9815 - root_mean_squared_error: 0.01852750/2750 [==============================] - 0s 31us/sample - loss: 3.3613e-04 - fvaf: 0.9820 - root_mean_squared_error: 0.0183
  32/1531 [..............................] - ETA: 0s - loss: 0.0072 - fvaf: 0.3890 - root_mean_squared_error: 0.08491531/1531 [==============================] - 0s 32us/sample - loss: 0.0046 - fvaf: 0.4606 - root_mean_squared_error: 0.0679
  32/1265 [..............................] - ETA: 0s - loss: 0.0035 - fvaf: 0.6417 - root_mean_squared_error: 0.05881265/1265 [==============================] - 0s 32us/sample - loss: 0.0050 - fvaf: 0.4307 - root_mean_squared_error: 0.0708
