Total jobs: 120
{'Ntraining': 5, 'rotation': 13}
Params: JI_Ntraining_5_rotation_13
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_5_rotation_13
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/7110 [..............................] - ETA: 5s - loss: 1.0012e-04 - fvaf: 0.9052 - root_mean_squared_error: 0.01001248/7110 [====>.........................] - ETA: 0s - loss: 1.1637e-04 - fvaf: 0.9435 - root_mean_squared_error: 0.01082432/7110 [=========>....................] - ETA: 0s - loss: 1.1177e-04 - fvaf: 0.9514 - root_mean_squared_error: 0.01063552/7110 [=============>................] - ETA: 0s - loss: 1.2089e-04 - fvaf: 0.9590 - root_mean_squared_error: 0.01104704/7110 [==================>...........] - ETA: 0s - loss: 1.1918e-04 - fvaf: 0.9622 - root_mean_squared_error: 0.01095824/7110 [=======================>......] - ETA: 0s - loss: 1.1843e-04 - fvaf: 0.9619 - root_mean_squared_error: 0.01097072/7110 [============================>.] - ETA: 0s - loss: 1.1753e-04 - fvaf: 0.9606 - root_mean_squared_error: 0.01087110/7110 [==============================] - 0s 47us/sample - loss: 1.1745e-04 - fvaf: 0.9606 - root_mean_squared_error: 0.0108
  32/1146 [..............................] - ETA: 0s - loss: 0.0026 - fvaf: -2.6371 - root_mean_squared_error: 0.05091146/1146 [==============================] - 0s 42us/sample - loss: 0.0027 - fvaf: 0.5920 - root_mean_squared_error: 0.0523
  32/1225 [..............................] - ETA: 0s - loss: 0.0024 - fvaf: 0.4464 - root_mean_squared_error: 0.04911056/1225 [========================>.....] - ETA: 0s - loss: 0.0023 - fvaf: 0.5879 - root_mean_squared_error: 0.04841225/1225 [==============================] - 0s 54us/sample - loss: 0.0025 - fvaf: 0.5720 - root_mean_squared_error: 0.0495
