Total jobs: 120
{'Ntraining': 3, 'rotation': 10}
Params: JI_Ntraining_3_rotation_10
File name base: ./results/bmi_torque_hidden_100_100_10_JI_Ntraining_3_rotation_10
960
hidden0
hidden1
hidden2
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
hidden0 (Dense)              (None, 100)               96100     
_________________________________________________________________
hidden1 (Dense)              (None, 100)               10100     
_________________________________________________________________
hidden2 (Dense)              (None, 10)                1010      
_________________________________________________________________
output (Dense)               (None, 2)                 22        
=================================================================
Total params: 107,232
Trainable params: 107,232
Non-trainable params: 0
_________________________________________________________________
None
  32/3636 [..............................] - ETA: 2s - loss: 2.5335e-04 - fvaf: 0.9791 - root_mean_squared_error: 0.0159 608/3636 [====>.........................] - ETA: 0s - loss: 2.9956e-04 - fvaf: 0.9750 - root_mean_squared_error: 0.01731344/3636 [==========>...................] - ETA: 0s - loss: 3.2644e-04 - fvaf: 0.9772 - root_mean_squared_error: 0.01811984/3636 [===============>..............] - ETA: 0s - loss: 3.1217e-04 - fvaf: 0.9754 - root_mean_squared_error: 0.01772752/3636 [=====================>........] - ETA: 0s - loss: 3.0080e-04 - fvaf: 0.9729 - root_mean_squared_error: 0.01733552/3636 [============================>.] - ETA: 0s - loss: 2.9748e-04 - fvaf: 0.9710 - root_mean_squared_error: 0.01723636/3636 [==============================] - 0s 77us/sample - loss: 2.9690e-04 - fvaf: 0.9707 - root_mean_squared_error: 0.0172
  32/1247 [..............................] - ETA: 0s - loss: 0.0053 - fvaf: 0.6898 - root_mean_squared_error: 0.0726 672/1247 [===============>..............] - ETA: 0s - loss: 0.0031 - fvaf: 0.5820 - root_mean_squared_error: 0.05571247/1247 [==============================] - 0s 82us/sample - loss: 0.0040 - fvaf: 0.5534 - root_mean_squared_error: 0.0635
  32/1257 [..............................] - ETA: 0s - loss: 0.0013 - fvaf: 0.6967 - root_mean_squared_error: 0.0357 576/1257 [============>.................] - ETA: 0s - loss: 0.0040 - fvaf: 0.5943 - root_mean_squared_error: 0.06331257/1257 [==============================] - 0s 92us/sample - loss: 0.0032 - fvaf: 0.5891 - root_mean_squared_error: 0.0570
